{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "766104217",
      "Content_Hash": "549502325"
    },
    "Metadata": [
      {
        "Id": [
          "4306e463-9e5b-49b1-aaf6-edaff69ed6e6"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Do Not Develop Your Own Cryptographic Algorithms"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Develop Your Own Cryptographic Algorithms"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>What to Do</h2>\n  <p>They will likely be exposed to attacks that are well-understood by cryptographers. Reverse engineering techniques are mature. If your algorithm can be compromised if attackers find out how it works, then it is especially weak.</p>\n  <h1>Why</h1>\n  <p>Developing cryptogaphic algorithms and the implementations of those algorithms is extremely difficult. Errors which are very hard to spot without a background in cryptanalysis can easily compromise security, while still appearing to be secure. Because reference\n and system implementations are used by many applications, they're tested heavily by people with the appropriate background, ensuring a high level of dependability.</p>\n  <h1>When</h1>\n  <p>All systems which use encryption should use standard implementations and algorithms.</p>\n  <h1>How</h1>\n  <p>All platforms provide standard cryptographic libraries, often available as services inside the platform or host operating system. Use those services according to their documentation, taking into account what properties a given algorithm or API can and cannot\n supply.</p>"
        ]
      }
    ]
  }
}