{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1322955050",
      "Content_Hash": "382197307"
    },
    "Metadata": [
      {
        "Id": [
          "48da8870-2f21-488c-8c4a-df3b29e83169"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')"
        ],
        "Category": [
          "Input Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>Description</h2>\r\n  <p>The software constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream\r\n component.</p>\r\n  <p>This could allow attackers to execute unexpected, dangerous commands directly on the operating system. This weakness can lead to a vulnerability in environments in which the attacker does not have direct access to the operating system, such as in web applications.\r\n Alternately, if the weakness occurs in a privileged program, it could allow the attacker to specify commands that normally would not be accessible, or to call alternate commands with privileges that the attacker does not have. The problem is exacerbated if\r\n the compromised process does not follow the principle of least privilege, because the attacker-controlled commands may run with special system privileges that increases the amount of damage.</p>\r\n  <p>There are at least two subtypes of OS command injection:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>The application intends to execute a single, fixed program that is under its own control.</strong> It intends to use externally-supplied inputs as arguments to that program. For example, the program might use system(\"<em>nslookup [HOSTNAME]</em>\")\r\n to run <em>nslookup</em> and allow the user to supply a <em>HOSTNAME</em>, which is used as an argument. Attackers cannot prevent nslookup from executing. However, if the program does not remove command separators from the\r\n<em>HOSTNAME</em> argument, attackers could place the separators into the arguments, which allows them to execute their own program after\r\n<em>nslookup</em> has finished executing.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>The application accepts an input that it uses to fully select which program to run, as well as which commands to use.</strong> The application simply redirects this entire command to the operating system. For example, the program might use \"<em>exec([COMMAND])</em>\"\r\n to execute the <em>[COMMAND]</em> that was supplied by the user. If the <em>COMMAND</em> is under attacker control, then the attacker can execute arbitrary commands or programs. If the command is being executed using functions like\r\n<em>exec()</em> and <em>CreateProcess()</em>, the attacker might not be able to combine multiple commands together in the same line.</p>\r\n    </li>\r\n  </ol>\r\n  <p>From a weakness standpoint, these variants represent distinct programmer errors. In the first variant, the programmer clearly intends that input from untrusted parties will be part of the arguments in the command to be executed. In the second variant, the\r\n programmer does not intend for the command to be accessible to any untrusted party, but the programmer probably has not accounted for alternate ways in which malicious attackers can provide input.</p>\r\n  <h2>Discussion</h2>\r\n  <p>Your software is often the bridge between an outsider on the network and the internals of your operating system. When you invoke another program on the operating system, but you allow untrusted inputs to be fed into the command string that you generate for\r\n executing that program, then you are inviting attackers to cross that bridge into a land of riches by executing their own commands instead of yours.</p>\r\n  <h2>Detection</h2>\r\n  <p>There are multiple ways to identify OS Command Injection vulnerabilities:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Automated Static Analysis.</strong> This weakness can often be detected using automated static analysis tools. Many modern tools use data flow analysis or constraint-based techniques to minimize the number of false positives.<br />\r\nAutomated static analysis might not be able to recognize when proper input validation is being performed, leading to false positives - i.e., warnings that do not have any security consequences or require any code changes. Automated static analysis might not\r\n be able to detect the usage of custom API functions or third-party libraries that indirectly invoke OS commands, leading to false negatives - especially if the API/library code is not available for analysis. This is not a perfect solution, since 100% accuracy\r\n and coverage are not feasible.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Automated Dynamic Analysis.</strong> This weakness can be detected using dynamic tools and techniques that interact with the software using large test suites with many diverse inputs, such as fuzz testing (fuzzing), robustness testing, and fault\r\n injection. The software's operation may slow down, but it should not become unstable, crash, or generate incorrect results.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Manual Static Analysis. </strong>Since this weakness does not typically appear frequently within a single software package, manual white box techniques may be able to provide sufficient code coverage and reduction of false positives if all potentially-vulnerable\r\n operations can be assessed within limited time constraints.</p>\r\n    </li>\r\n  </ol>\r\n  <h2>Mitigation</h2>\r\n  <p>Multiple options are available for fixing or preventing OS Command Injection vulnerabilities:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Avoid using external processes.</strong> If at all possible, use library calls rather than external processes to recreate the desired functionality.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use a sandbox.</strong> Run your code in a \"jail\" or similar sandbox environment that enforces strict boundaries between the process and the operating system. This may effectively restrict which files can be accessed in a particular directory or\r\n which commands can be executed by your software. OS-level examples include the Unix\r\n<em>chroot</em> jail, <em>AppArmor</em>, and <em>SELinux</em>. In general, managed code may provide some protection. For example,\r\n<em>java.io.FilePermission</em> in the <em>Java SecurityManager</em> allows you to specify restrictions on file operations. This may not be a feasible solution, and it only limits the impact to the operating system; the rest of your application may still be\r\n subject to compromise. Be careful to avoid CWE-243 and other weaknesses related to jails. Notes: The effectiveness of this mitigation depends on the prevention capabilities of the specific sandbox or jail being used and might only help to reduce the scope\r\n of an attack, such as restricting the attacker to certain system calls or limiting the portion of the file system that can be accessed.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Limit user input when calling external processes.</strong> For any data that will be used to generate a command to be executed, keep as much of that data out of external control as possible. For example, in web applications, this may require storing\r\n the data locally in the session's state instead of sending it out to the client in a hidden form field.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use server-side security controls.</strong> For any security checks that are performed on the client side, ensure that these checks are duplicated on the server side, in order to avoid CWE-602. Attackers can bypass the client-side checks by modifying\r\n values after the checks have been performed, or by changing the client to remove the client-side checks entirely. Then, these modified values would be submitted to the server.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use a secure framework.</strong> Use a vetted library or framework that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid. For example, consider using the\r\n<em>ESAPI Encoding</em> control or a similar tool, library, or framework. These will help the programmer encode outputs in a manner less prone to error.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Sanitize data used to execute external processes.</strong> If you need to use dynamically-generated query strings or commands in spite of the risk, properly quote arguments and escape any special characters within those arguments. The most conservative\r\n approach is to escape or filter all characters that do not pass an extremely strict whitelist (such as everything that is not alphanumeric or white space). If some special characters are still needed, such as white space, wrap each argument in quotes after\r\n the escaping/filtering step. Be careful of argument injection (CWE-88).</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Avoid using the command line.</strong> If the program to be executed allows arguments to be specified within an input file or from standard input, then consider using that mode to pass arguments instead of the command line.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use parameterized APIs.</strong> If available, use structured mechanisms that automatically enforce the separation between data and code. These mechanisms may be able to provide the relevant quoting, encoding, and validation automatically, instead\r\n of relying on the developer to provide this capability at every point where output is generated. Some languages offer multiple functions that can be used to invoke commands. Where possible, identify any function that invokes a command shell using a single\r\n string, and replace it with a function that requires individual arguments. These functions typically perform appropriate quoting and filtering of arguments. For example, in C, the\r\n<em>system()</em> function accepts a string that contains the entire command to be executed, whereas\r\n<em>execl()</em>, <em>execve()</em>, and others require an array of strings, one for each argument. In Windows,\r\n<em>CreateProcess()</em> only accepts one command at a time. In Perl, if <em>system()</em> is provided with an array of arguments, then it will quote each of the arguments.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Assume all input is malicious.</strong> Use an \"accept known good\" input validation strategy, i.e., use a whitelist of acceptable inputs that strictly conform to specifications. Reject any input that does not strictly conform to specifications, or\r\n transform it into something that does. Do not rely exclusively on looking for malicious or malformed inputs (i.e., do not rely on a blacklist). However, blacklists can be useful for detecting potential attacks or determining which inputs are so malformed that\r\n they should be rejected outright.<br />\r\nWhen performing input validation, consider all potentially relevant properties, including length, type of input, the full range of acceptable values, missing or extra inputs, syntax, consistency across related fields, and conformance to business rules. As an\r\n example of business rule logic, \"boat\" may be syntactically valid because it only contains alphanumeric characters, but it is not valid if you are expecting colors such as \"red\" or \"blue.\"</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use white-list input validation.</strong> When constructing OS command strings, use stringent whitelists that limit the character set based on the expected value of the parameter in the request. Use runtime policy enforcement to create a whitelist\r\n of allowable commands, then prevent use of any command that does not appear in the whitelist. Technologies such as\r\n<em>AppArmor</em> are available to do this.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use reference maps.</strong> When the set of acceptable objects, such as filenames or URLs, is limited or known, create a mapping from a set of fixed input values (such as numeric IDs) to the actual filenames or URLs, and reject all other inputs.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Prevent information disclosure in error messages.</strong> Ensure that error messages only contain minimal details that are useful to the intended audience, and nobody else. The messages need to strike the balance between being too cryptic and not\r\n being cryptic enough. They should not necessarily reveal the methods that were used to determine the error. Such detailed information can be used to refine the original attack to increase the chances of success. If errors must be tracked in some detail, capture\r\n them in log messages - but consider what could occur if the log messages can be viewed by attackers. Avoid recording highly sensitive information such as passwords in any form. Avoid inconsistent messaging that might accidentally tip off an attacker about\r\n internal state, such as whether a username is valid or not. In the context of OS Command Injection, error information passed back to the user might reveal whether an OS command is being executed and possibly which command is being used.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>(Optional) Use a web application firewall.</strong> Use an application firewall that can detect attacks against this weakness. It can be beneficial in cases in which the code cannot be fixed (because it is controlled by a third party), as an emergency\r\n prevention measure while more comprehensive software assurance measures are applied, or to provide defense in depth.\r\n<br /><strong>Note:</strong> An application firewall might not cover all possible input vectors. In addition, attack techniques might be available to bypass the protection mechanism, such as using malformed inputs that can still be processed by the component that\r\n receives those inputs. Depending on functionality, an application firewall might inadvertently reject or modify legitimate requests. Finally, some manual effort may be required for customization.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use the principle of least privilege.</strong> Run your code using the lowest privileges that are required to accomplish the necessary tasks. If possible, create isolated accounts with limited privileges that are only used for a single task. That\r\n way, a successful attack will not immediately give the attacker access to the rest of the software or its environment. For example, database applications rarely need to run as the database administrator, especially in day-to-day operations.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>(PHP Only) Disable register_globals.</strong> If you are using PHP, configure your application so that it does not use\r\n<em>register_globals</em>. During implementation, develop your application so that it does not rely on this feature, but be wary of implementing a\r\n<em>register_globals</em> emulation that is subject to weaknesses such as CWE-95, CWE-621, and similar issues.</p>\r\n    </li>\r\n  </ol>\r\n  <h2>Additional Information</h2>\r\n  <ul>\r\n    <li>For more information about OS Command Injection, please see <a href=\"http://cwe.mitre.org/top25/index.html#CWE-78\">\r\nhttp://cwe.mitre.org/top25/index.html#CWE-78</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}