{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1284118614",
      "Content_Hash": "-451664795"
    },
    "Metadata": [
      {
        "Id": [
          "517adc33-c74b-45bc-b0be-70537f8f8052"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Prevent Information Disclosure in Error Messages"
        ],
        "Category": [
          "Error Handling"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Prevent Information Disclosure in Error Messages"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>What to Do</h2>\n  <p>Ensure that error messages only contain minimal details that are useful to the intended audience, and nobody else. The messages need to strike the balance between being too cryptic and not being cryptic enough. They should not necessarily reveal the methods\n that were used to determine the error. Such detailed information can be used to refine the original attack to increase the chances of success.</p>\n  <p>If errors must be tracked in some detail, capture them in log messages - but consider what could occur if the log messages can be viewed by attackers. Avoid recording highly sensitive information such as passwords in any form.</p>\n  <h2>Why</h2>\n  <p>In the context of path traversal, error messages which disclose path information can help attackers craft the appropriate attack strings to move through the file system hierarchy.</p>\n  <p>In the context of OS Command Injection, error information passed back to the user might reveal whether an OS command is being executed and possibly which command is being used.</p>\n  <p>In the context of SQL Injection, error messages revealing the structure of a SQL query can help attackers tailor successful attack strings.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to prevent disclosure of sensitive information in error messages:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify error messages.</strong> Review error handling code and find all instances of error messages being presented to the user, including errors displayed by the framework.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Write simple error messages.</strong> Write simple messages and warnings explaining the error to the user but don't include any of the following sensitive information:</p>\n      <ul>\n        <li>\n          <p>\n            <strong>File locations.</strong> Filesystem information, such as the locations of Operating System files, databases, or other sensitive information may be used by an attacker to coordinate his attacks, so this information should not be included in error\n messages.</p>\n        </li>\n        <li>\n          <p>\n            <strong>System information.</strong> System information, such as Operating System version, network names, internal network addresses, etc should not be included in error messages because it may help an attacker identify vulnerable software, choose exploits,\n or attack other systems on the network.</p>\n        </li>\n        <li>\n          <p>\n            <strong>User account information.</strong> Information such as usernames, personal names, e-mail addresses, or other user information should not be revealed in error messages, because it may help an attacker attack that user account.</p>\n        </li>\n        <li>\n          <p>\n            <strong>Secrets. </strong>It goes without saying that secret information, such as passwords, password hashes, cardholder data, etc should not be disclosed in error messages.</p>\n        </li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Use simple error messages.</strong> Rewrite code that displays verbose error messages that display sensitive information to the user to display new, simple error messages.</p>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}