{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "480658496",
      "Content_Hash": "1732365504"
    },
    "Metadata": [
      {
        "Id": [
          "5e94df22-cb93-4088-ad58-ceb4ef7b62f8"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "CWE-862: Missing Authorization"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "CWE-862: Missing Authorization"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>Description</h2>\r\n  <p>The software does not perform an authorization check when an actor attempts to access a resource or perform an action.</p>\r\n  <p>Assuming a user with a given identity, authorization is the process of determining whether that user can access a given resource, based on the user's privileges and any permissions or other access-control specifications that apply to the resource.</p>\r\n  <p>When access control checks are not applied, users are able to access data or perform actions that they should not be allowed to perform. This can lead to a wide range of problems, including information exposure, denial of service, and arbitrary code execution.</p>\r\n  <h2>Discussion</h2>\r\n  <p>Suppose you're hosting a house party for a few close friends and their guests. You invite everyone into your living room, but while you're catching up with one of your friends, one of the guests raids your fridge, peeks into your medicine cabinet, and ponders\r\n what you've hidden in the nightstand next to your bed. Software faces similar authorization problems that could lead to more dire consequences. If you don't ensure that your software's users are only doing what they're allowed to, then attackers will try to\r\n exploit your improper authorization and exercise unauthorized functionality that you only intended for restricted users. In May 2011, Citigroup revealed that it had been compromised by hackers who were able to steal details of hundreds of thousands of bank\r\n accounts by changing the account information that was present in fields in the URL. An application that implemented proper&nbsp;authorization would check that the user had the rights to access the account being specified. Earlier, a similar missing-authorization\r\n attack was used to steal private information of iPad owners from an AT&T site.</p>\r\n  <h2>Detection</h2>\r\n  <p>The ways to check for missing authorization are:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Automated Static Analysis. </strong>Automated static analysis is useful for detecting commonly-used idioms for authorization. A tool may be able to analyze related configuration files, such as\r\n<em>.htaccess</em> in Apache web servers, or detect the usage of commonly-used authorization libraries. Generally, automated static analysis tools have difficulty detecting custom authorization schemes. In addition, the software's design may include some functionality\r\n that is accessible to any user and does not require an authorization check; an automated technique that detects the absence of authorization may report false positives.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Automated Dynamic Analysis.</strong> Automated dynamic analysis may find many or all possible interfaces that do not require authorization, but manual analysis is required to determine if the lack of authorization violates business logic.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Manual Analysis.</strong> This weakness can be detected using tools and techniques that require manual (human) analysis, such as penetration testing, threat modeling, and interactive tools that allow the tester to record and modify an active session.\r\n Specifically, manual static analysis is useful for evaluating the correctness of custom authorization mechanisms. These may be more effective than strictly automated techniques. This is especially the case with weaknesses that are related to design and business\r\n rules. However, manual efforts might not achieve desired code coverage within limited time constraints.</p>\r\n    </li>\r\n  </ol>\r\n  <h2>Mitigation</h2>\r\n  <p>The mitigation methods for missing authorization vulnerabilities are:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Separate the site into secure and public areas.</strong> Divide your application into anonymous, normal, privileged, and administrative areas. Reduce the attack surface by carefully mapping roles with data and functionality. Use role-based access\r\n control (RBAC) to enforce the roles at the appropriate boundaries.<br />\r\nNote that this approach may not protect against horizontal authorization, i.e., it will not protect a user from attacking others with the same role.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Implement business logic checks. </strong>Ensure that you perform access control checks related to your business logic. These checks may be different from the access control checks that you apply to more generic resources such as files, connections,\r\n processes, memory, and database records. For example, a database may restrict access to medical records to a specific database user, but each record might only be intended to be accessible to the patient and the patient's doctor.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use a secure framework.</strong> Use a vetted library or framework that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid. For example, consider using authorization frameworks such as the\r\n<em>JAAS Authorization Framework</em> and the OWASP<em> ESAPI Access Control</em> feature.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use server-side security controls.</strong> For web applications, make sure that the access control mechanism is enforced correctly on every server side resource. Users should not be able to access any unauthorized functionality or information by\r\n simply requesting direct access to that page. One way to do this is to ensure that all pages containing sensitive information are not cached. Additionally, requests for such pages must contain an active and authenticated session token associated with a user.\r\n This user must have the required permissions to access that page.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use OS access control.</strong> Use the access control capabilities of your operating system and server environment and define your access control lists accordingly. Use a \"default deny\" policy when defining these ACLs.</p>\r\n    </li>\r\n  </ol>\r\n  <h2>Additional Information</h2>\r\n  <ul>\r\n    <li>For more information about missing authorization vulnerabilities, please see <a href=\"http://cwe.mitre.org/top25/index.html#CWE-862\">\r\nhttp://cwe.mitre.org/top25/index.html#CWE-862</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}