{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "690590556",
      "Content_Hash": "764665155"
    },
    "Metadata": [
      {
        "Id": [
          "a044e5d9-ccaa-488c-bdf2-b940d9a0b2b6"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Use Server-side Security Controls"
        ],
        "Category": [
          "Input Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Server-side Security Controls"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>What to Do</h2>\r\n  <p>For any security checks that are performed on the client side, ensure that these checks are duplicated on the server side, in order to avoid CWE-602. Attackers can bypass the client-side checks by modifying values after the checks have been performed, or\r\n by changing the client to remove the client-side checks entirely. Then, these modified values would be submitted to the server.</p>\r\n  <h1>Why</h1>\r\n  <p>It is easy to modify the behavior of the client or just write a new client that does not observe the same data validation rules.</p>\r\n  <h1>When</h1>\r\n  <p>All applications should only use server-side validation when the code relies on security.</p>\r\n  <h1>How</h1>\r\n  <p>Server-side code should perform its own validation. What if an attacker bypasses your client, or shuts off your client-side script routines, for example, by disabling JavaScript? Use client-side validation to help reduce the number of round trips to the\r\n server but do not rely on it for security. This is an example of defense in depth.</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about \"CWE-602: Client-Side Enforcement of Server-Side Security\", please see\r\n<a href=\"http://cwe.mitre.org/data/definitions/602.html\">http://cwe.mitre.org/data/definitions/602.html</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}