{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "29058630",
      "Content_Hash": "-895283589"
    },
    "Metadata": [
      {
        "Id": [
          "d98eef4f-c50a-447a-ac28-1353cc2a70b4"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Allocate Sufficient Memory for Buffers"
        ],
        "Category": [
          "Memory Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Allocate Sufficient Memory for Buffers"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>What to Do</h2>\r\n  <p>If you allocate a buffer for the purpose of transforming, converting, or encoding an input, make sure that you allocate enough memory to handle the largest possible encoding. For example, in a routine that converts \"<em>&</em>\" characters to \"<em>&</em>\"\r\n for HTML entity encoding, you will need an output buffer that is at least 5 times as large as the input buffer.\r\n</p>\r\n  <p>When processing structured incoming data containing a size field followed by raw data, ensure that you identify and resolve any inconsistencies between the size field and the actual size of the data (CWE-130).\r\n</p>\r\n  <p>When allocating memory that uses sentinels to mark the end of a data structure - such as\r\n<em>NUL</em> bytes in strings - make sure you also include the sentinel in your calculation of the total amount of memory that must be allocated.\r\n</p>\r\n  <p>Use <em>sizeof()</em> on the appropriate data type to avoid CWE-467.</p>\r\n  <h1>Why</h1>\r\n  <p>Copying more data than an array or string can fit results in a buffer overflow.</p>\r\n  <h1>When</h1>\r\n  <p>Allocate enough buffer space for copying data, when data is being copied to an array or a string.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following steps to assure that your code allocates enough buffer space when copying data to prevent buffer overflows:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all functions that copy data to strings or arrays.</strong> List the components, modules, and libraries that do the most amount of data handling. Usually there exists some code heavy on manipulating data that copies many buffers or constructs\r\n various strings.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Calculate the amount of memory that is used by data being copied or set a maximum size limit for valid data.</strong> Make sure to include a trailing null if a null-terminated string is being copied. When calculating the size of data, count the amount\r\n of memory it uses, not the amount of elements in the array. Be careful when using the sizeof() function, because it returns the size of a pointer when an array containing data is passed as a parameter to the function. The memory size of data should be calculated\r\n beforehand, ideally in the same scope in which the data structure containing data is declared, and passed as an argument to the function that does the copying.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Allocate memory for the buffer.</strong> Once the amount of memory needed to fit all the data is determined, allocate an array or a string of a sufficient size. Write code to handle possible memory allocation errors.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check bounds when copying.</strong> Use the size of the allocated array or string when copying to assure that only the amount of data that fits into the array is copied. This should always be the case if the amount of memory to allocate is calculated\r\n correctly, but for extra security it is a good idea to write code in a way that truncates data if it doesn't fit into the buffer.</p>\r\n    </li>\r\n  </ol>\r\n  <h2>Additional Resources</h2>\r\n  <ul>\r\n    <li>For more information about \"CWE-130: Improper Handling of Length Parameter Inconsistency\", please see\r\n<a href=\"http://cwe.mitre.org/data/definitions/130.html\">http://cwe.mitre.org/data/definitions/130.html</a></li>\r\n    <li>For more information about \"CWE-467: Use of sizeof() on a Pointer Type\", please see\r\n<a href=\"http://cwe.mitre.org/data/definitions/467.html\">http://cwe.mitre.org/data/definitions/467.html</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}