{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1756523511",
      "Content_Hash": "-1986916218"
    },
    "Metadata": [
      {
        "Id": [
          "db12d62f-5d51-4967-ae8a-f3ebb8c38de0"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "CWE-759: Use of a One-Way Hash without a Salt"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "CWE-759: Use of a One-Way Hash without a Salt"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>Discussion</h2>\n  <p>Salt might not be good for your diet, but it can be good for your password security. Instead of storing passwords in plain text, a common practice is to apply a one-way hash, which effectively randomizes the output and can make it more difficult if (or when?)\n attackers gain access to your password database. If you don't add a little salt to your hash, then the health of your application is in danger.</p>\n  <h2>Detection</h2>\n  <p>The software uses a one-way cryptographic hash against an input that should not be reversible, such as a password, but the software does not also use a salt as part of the input. This makes it easier for attackers to pre-compute the hash value using dictionary\n attack techniques such as rainbow tables.</p>\n  <h2>Mitigation</h2>\n  <p>Generate a random salt each time you process a new password. Add the salt to the plaintext password before hashing it. When you store the hash, also store the salt. Do not use the same salt for every password that you process (CWE-760).</p>\n  <p>Use one-way hashing techniques that allow you to configure a large number of rounds, such as bcrypt. This may increase the expense when processing incoming authentication requests, but if the hashed passwords are ever stolen, it significantly increases the\n effort for conducting a brute force attack, including rainbow tables. With the ability to configure the number of rounds, you can increase the number of rounds whenever CPU speeds or attack techniques become more efficient. When you use industry-approved techniques,\n you need to use them correctly. Don't cut corners by skipping resource-intensive steps (CWE-325). These steps are often essential for preventing common attacks.</p>\n  <h2>\n    <br />\nAdditional Information</h2>\n  <ul>\n    <li>For more information about hashing without salt vulnerabilities, please see <a href=\"http://cwe.mitre.org/top25/index.html#CWE-759\">\nhttp://cwe.mitre.org/top25/index.html#CWE-759</a></li>\n  </ul>"
        ]
      }
    ]
  }
}