{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1686700574",
      "Content_Hash": "1570639496"
    },
    "Metadata": [
      {
        "Id": [
          "dbc9a373-0314-4177-a402-6a9589284d37"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Use a Web Application Firewall"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use a Web Application Firewall"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>What to Do</h2>\r\n  <p>Use an application firewall that can detect attacks against this weakness. It can be beneficial in cases in which the code cannot be fixed (because it is controlled by a third party), as an emergency prevention measure while more comprehensive software assurance\r\n measures are applied, or to provide defense in depth.</p>\r\n  <p>\r\n    <strong>Note:</strong> An application firewall might not cover all possible input vectors. In addition, attack techniques might be available to bypass the protection mechanism, such as using malformed inputs that can still be processed by the component that\r\n receives those inputs. Depending on functionality, an application firewall might inadvertently reject or modify legitimate requests. Finally, some manual effort may be required for customization.</p>\r\n  <h1>Why</h1>\r\n  <p>A web application firewall may prevent an attacker from successfully exploiting a vulnerability in a public-facing web application.</p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps to deploy a web application firewall:</p>\r\n  <ol>\r\n    <li>\r\n      <strong>Choose a WAF. </strong>\r\n      <span>Decide whether to conduct regular reviews of the web application or to install a web application firewall. If you decide on a web application firewall, c</span>hoose a web application firewall based on compatibility\r\n with your log server, availability of vendor support, and considerations listed on the OWASP Web Application Firewall page\r\n</li>\r\n    <li>\r\n      <p>\r\n        <strong>Deploy the WAF.</strong> Install the web application firewall in front of the public-facing web application. Please refer to the vendor's documentation for detailed instructions on how to install and configure your web application firewall (WAF)\r\n of choice. Often, the installation process simply means wiring the physical firewall in front of the web application and configuring some basic TCP/IP settings.</p>\r\n    </li>\r\n    <li>\r\n      <strong>Configure the WAF. </strong>The configuration process and available options vary by vendor. Please refer to your vendor's documentation or technical support for detailed instructions on setting up your web application firewall.</li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>\r\n      <p>For more information about web application firewalls and a list of web application firewall vendors, please see the OWASP \"Web Application Firewall\" page at\r\n<a href=\"http://www.owasp.org/index.php/Web_Application_Firewall\">http://www.owasp.org/index.php/Web_Application_Firewall</a>.</p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}