{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-114860860",
      "Content_Hash": "-465433718"
    },
    "Metadata": [
      {
        "Id": [
          "dd7dbfa9-cddf-450e-933c-6da5dee70aed"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Hash and Salt Passwords"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Hash and Salt Passwords"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h2>What to Do</h2>\r\n  <p>Instead of storing passwords in plain text, a common practice is to apply a one-way hash, which effectively randomizes the output and can make it more difficult if (or when?) attackers gain access to your password database. Use one-way hashing techniques\r\n that allow you to configure a large number of rounds, such as bcrypt. Generate a random salt each time you process a new password. Add the salt to the plaintext password before hashing it. When you store the hash, also store the salt.&nbsp;\r\n</p>\r\n  <h2>Why</h2>\r\n  <p>Storing hashes instead of plain-text passwords assures that an attacker cannot easily recover the passwords if he gains access to the password files. Adding salt to hashed passwords greatly increases computational requirements for password guessing attacks.\r\n Hashing should be applied multiple times, because modern computers can perform hashing operations very quickly.</p>\r\n  <h2>How</h2>\r\n  <p>Use one-way hashing techniques that allow you to configure a large number of rounds, such as bcrypt. This may increase the expense when processing incoming authentication requests, but if the hashed passwords are ever stolen, it significantly increases the\r\n effort for conducting a brute force attack, including rainbow tables. With the ability to configure the number of rounds, you can increase the number of rounds whenever CPU speeds or attack techniques become more efficient.</p>\r\n  <p>Generate a random salt each time you process a new password. Add the salt to the plaintext password before hashing it. When you store the hash, also store the salt. Do not use the same salt for every password that you process (CWE-760).</p>\r\n  <p>When you use industry-approved techniques, you need to use them correctly. Don't cut corners by skipping resource-intensive steps (CWE-325). These steps are often essential for preventing common attacks.</p>\r\n  <h2>Additional Resources</h2>\r\n  <ul>\r\n    <li>For more information about hashing without salt vulnerabilities, please see <a href=\"http://cwe.mitre.org/top25/index.html#CWE-759\">\r\nhttp://cwe.mitre.org/top25/index.html#CWE-759</a></li>\r\n    <li>For more information about \"CWE-325: Missing Required Cryptographic Step\", please see\r\n<a href=\"http://cwe.mitre.org/data/definitions/325.html\">http://cwe.mitre.org/data/definitions/325.html</a></li>\r\n    <li>For more information about \"CWE-760: Use of a One-Way Hash with a Predictable Salt\", please see\r\n<a href=\"http://cwe.mitre.org/data/definitions/760.html\">http://cwe.mitre.org/data/definitions/760.html</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}