{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000003cb5b4"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000003cb5b4,645a4a21-ec35-4dc7-abaa-26cac097a302,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "Session-Specific Data Is Not Stored in Shared Objects"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Session-Specific Data Is Not Stored in Shared Objects"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Java\n\n\n==What to Check For==\n\nEnsure that the application does not store session-specific values in shared or global objects. \n\n\n==Why==\n\nValues in shared or global objects are not guaranteed to be thread safe and are therefore subject to race conditions. Race conditions are difficult to detect and debug and can lead to exposure of sensitive user data. \n\n\n==How to Check==\n\nTo make sure that session-specific data is not stored in shared objectsL\n\n# **Identify code that stores session-specific data.** Enumerate all code that stores session-specific data. Identify session-specific data values as well as objects that are shared or globally accessible such as: static classes, static variables and methods, including static references to non-static classes, class instance variables, and application-level global variables.\n# **Ensure that shared objects do not contain data created for a specific session.** Review all code that stores session data and make sure that it uses in-memory, thread safe session management, session cookies, or database sessions and not shared objects. \n\n\n==How to Fix=\n\nTo avoid storing session-specific data in shared objects:\n\n# **Identify code that stores session-specific data.** Enumerate all code that stores session-specific data. Identify session-specific data values as well as objects that are shared or globally accessible such as: static classes, static variables and methods, including static references to non-static classes, class instance variables, and application-level global variables.\n# **Avoid storing unnecessary values in any session objects.** Review all code that stores session data and consider whether each piece of session data needs to be stored. Remove code that stores unneeded session data if possible.\n# **Ensure that shared objects do not contain data created for a specific session.** Review all code that stores session data. If session data is stored in shared objects, rewrite the affected code to use in-memory, thread safe session management, session cookies, or database sessions instead. \n\n\n==Problem Example==\n\nA web-based shopping cart allows users to add and modify the contents of their cart and continue shopping. A server that stores shopping cart data in a static class variable might cause race conditions resulting in a user's shopping cart switching to another user's session, under certain load conditions, exposing sensitive account information.\n\n\n==Solution Example==\n\nA shopping cart that only uses local variables within methods that are tightly bound to the session token will ensure that data will not be available to other sessions. Carefully-planned session life-cycles and proper destruction of expired sessions further prevent reuse and possible data retention from other sessions. \n"
        ]
      }
    ]
  }
}