{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-000000364213"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-000000364213,440ec18c-3afe-4a67-a6b1-32fc2be96a1d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Ask User Permission Before Sending a Manifest"
        ],
        "Category": [
          "Privacy"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Ask User Permission Before Sending a Manifest"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* HTML5\r\n\r\n==What to Do==\r\n\r\nAsk the user about caching the application before sending the manifest file.\r\n\r\n==Why==\r\n\r\nThe user should be informed that the application is being cached to mitigate the risk of cache poisoning attacks.\r\n\r\n==How==\r\n\r\nTo notify the user about caching the application:\r\n\r\n# **Identify whether the application is likely to be cached.** An accurate manifest file is necessary for an HTML5 application to be cached properly. If your application has a manifest file, the application is likely to be cached (presumably the developers have decided that the user might want to cache the application and use it off-line). If there is no manifest file, consider whether the application is likely to be cached and used off-line. If so, write a manifest file for it.\r\n# **Write a message to inform the user about the risks of caching the application.** Write a message that explains to the user that the application might be substituted by a malicious one if the user is connected to an untrusted network.\r\n# **Ask the user for permission before sending the manifest file.** Use the following steps:\r\n##Find the page that references the manifest file in the html tag (let's call this the manifest-loading page). \r\n##Next, find all the pages that send the user to the manifest-loading page. On all such pages, before you send the user to the manifest-loading page, display the warning message which you created in the previous step. Note that referencing the manifest file in the html tag causes the browser to download the manifest file and possibly cache the application. The user should be warned before this happens. \r\n##If it is impractical to place warnings on all the possible pages that lead to the manifest-loading page, it might be simpler to place a warning directly on the manifest-loading page (let's call this the warning page). For this to work, you'll need to remove the manifest reference from the warning page, because otherwise it will be loaded regardless of the user's response to the message. Create another page to load the manifest (let's call this the caching page). Remove the reference to the manifest from the warning page. On the warning page, place a link to the caching page, for use when the user has accepted the warning and decides to cache the application anyway.\r\n\r\n==Privacy and Trust Guidelines==\r\n\r\n* [[00000000-0000-0000-0000-0000001de66c|Ask User Permission Before Using Geopositioning]]\r\n* [[00000000-0000-0000-0000-000000364213|Ask User Permission Before Sending a Manifest]]\r\n* [[00000000-0000-0000-0000-0000003b92c3|Tell Users to Clear the Cache after Browsing Through Untrusted Networks]]\r\n\r\n==Privacy and Trust Checklist Items==\r\n\r\n* [[00000000-0000-0000-0000-0000006e3400|The User Is Asked for Permission Before Geopositioning]]\r\n* [[00000000-0000-0000-0000-00000085555d|The User Is Asked for Permission Before Sending a Manifest]]\r\n* [[00000000-0000-0000-0000-0000003087b2|Users Are Told to Clear the Cache After Browsing Through Untrusted Networks]]\r\n"
        ]
      }
    ]
  }
}