{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000006a783"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000006a783,44dd47a8-fa0e-4c4d-bf97-37340731aa9d,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Validate Data Received by Web Workers"
        ],
        "Category": [
          "Web Workers"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Validate Data Received by Web Workers"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* HTML5\r\n\r\n==What to Do==\r\n\r\nValidate data exchanged between the server and the Web Worker. Validate the data on the server.\r\n\r\n==Why==\r\n\r\nValidate data received by Web Workers to make it harder for an attacker to manipulate the Web Worker's activity via a Man-in-the-middle attack.\r\n\r\n==How==\r\n\r\nTo validate data exchanged between the Web Worker and the server:\r\n\r\n# **Identify all data types exchanged between the Web Workers and the server.** Create a spreadsheet of all data types that are exchanged between the Web Workers and the server.\r\n# **Define valid data formats.** For each type of data in the spreadsheet, define valid characters, length, format, and range (for numerical values).\r\n# **Define validator functions.** Define a set of validator functions that should be used to validate each type of data exchanged between the server and the Web Workers. Data should be validated on the server. \r\n# **Validate length.** Add code to check that the length of the data is valid.\r\n# **Validate characters.** Use regular expressions to restrict the acceptable range of characters in text data.\r\n# **Validate format.** If the data type has a specific pattern, such as a date or a phone number, add code to use regular expressions to make sure data matches the correct type. Use regular expressions to enforce strong password requirements.\r\n# **Validate range.** To restrict the acceptable range of numerical input, compare the data to maximum and minimum acceptable values.\r\n# **Find code that exchanges data between the server and the Web Workers.** Create a spreadsheet of all the code used by the Web Workers that receives data from the server.\r\n# **Use the validator functions.** Identify all code that handles messages received by Web Workers. Add code to use the validator functions before actually processing the messages. If data is not valid, it should not be processed. \r\n\r\n==Web Worker Guidelines==\r\n\r\n* [[00000000-0000-0000-0000-00000083c4cc|Do Not Pass Code to Web Workers to eval()]]\r\n* [[00000000-0000-0000-0000-00000006a783|Validate Data Received by Web Workers]]\r\n\r\n==Web Worker Checklist Items==\r\n\r\n* [[00000000-0000-0000-0000-000000392041|Web Workers Do Not eval() Data Pased to Them]]\r\n* [[00000000-0000-0000-0000-0000002f59fd|Data Received by Web Workers Is Validated]]\r\n"
        ]
      }
    ]
  }
}