{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-000000816c4a"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-000000816c4a,bda55543-fbca-4b9f-aa25-d5252492d817,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Authentication Attempts Are Throttled"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Authentication Attempts Are Throttled"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "==What to Check For==\n\nVerify that authentication attempts are throttled.\n\n==Why==\n\nThrottling authentication attempts makes password guessing attacks less effective. Authentication throttling should be implemented on the server, since client-side controls are trivial to bypass.\n\n==How to Check==\n\nTo verify that authentication attempts are throttled:\n\n# **Review authentication throttling requirements.** Determine the time-out period between authentication attempts. A recommended time-out period is three seconds.\n# **Identify authentication code.** Identify server-side code that is responsible for authentication.\n# **Review authentication code.** Examine authentication code to make sure that repeated authentication attempts are throttled. Verify that log entries are generated that indicate multiple repeated failed authentication attempts. Make sure the application keeps track of clients that attempt to authenticate using IPs and session cookies.\n# **Attempt to log into the application repeatedly.** Test authentication throttling by attempting to log in repeatedly and observing that the application enforces a pause between authentication attempts.\n\n\n==How to Fix==\n\nTo throttle authentication attempts:\n\n# **Define authentication throttling requirements.** Define the time-out period between authentication attempts. A recommended time-out period is three seconds.\n# **Identify authentication code.** Identify server-side code that is responsible for authentication.\n# **Add code that throttles authentication attempts.** Edit the authentication code identified in the previous step to wait for the required time period before handling another authentication request. Keep track of clients using IPs and session cookies to make it harder to bypass authentication throttling.\n"
        ]
      }
    ]
  }
}