{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000006ab8ac"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000006ab8ac,cc0387a1-a1d6-4730-843e-4a9f3092d048,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Validate Data Received by Event Handlers"
        ],
        "Category": [
          "Web Messaging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Validate Data Received by Event Handlers"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* HTML5\n\n==What to Do==\n\nValidate data received by event handlers.\n\n==Why==\n\nValidate data received by event handlers to make it harder for attackers to send malicious data to the application. Even if an attacker is able to send data that appears to come from the trusted server, the attacker will be limited to sending data in valid formats, thus severely limiting his ability to affect the application.\n\n==How==\n\nTo validate data received by event handlers:\n\n# **Identify code that receives messages from the server.** Search application code for all references to the //addEventListener// method. Create a spreadsheet to list all code that receives messages from the server.\n# **Identify data formats.** For each piece of code that receives messages, define valid data formats that are expected by the application. For example, a piece of code might be expecting a time, a name, or a social security number. Each of these types of data has a distinct valid format; a time has a different format from a name, and a social security number has a different format altogether. As you add information to the spreadsheet about expected data formats, include examples and be as specific as possible.\n# **Define validators.** For each distinct data type, write a validator function that determines whether a piece of data matches the correct format or not. Regular expressions are usually used for this task. Validate data length first, before using regular expressions, to prevent regular expression denial of service (DoS) attacks. The general pattern for validating data formats is: validata data length, validate valid characters, validate patterns of structured data (like social security numbers or dates), and validate ranges of numerical data.\n# **Validate data.** Using the spreadsheet as a guide, for each piece of code that receives messages, add code that validates data immediately after it is received, using the validator matching the data type that is expected. Only continue to process the data if it has the correct format.\n\n==Web Messaging Guidelines==\n\n* [[00000000-0000-0000-0000-00000012aada|Do Not Evaluate Messages as Code]]\n* [[00000000-0000-0000-0000-00000010eb47|Use element.textContent to Assign Values to DOM Elements]]\n* [[00000000-0000-0000-0000-00000076ad87|Explicitly State the Expected Origin with postMessage]]\n* [[00000000-0000-0000-0000-0000006ab8ac|Validate Data Received by Event Handlers]]\n* [[00000000-0000-0000-0000-00000085babd|Validate the Origin Attribute Against the FQDN]]\n* [[00000000-0000-0000-0000-000000763637|Check The Origin Attribute of Messages]]\n\n==Web Messaging Checklist Items==\n\n* [[00000000-0000-0000-0000-0000008e9b8f|Messages Are Not Evaluated as Code]]\n* [[00000000-0000-0000-0000-00000060fefb|Element.textContent Is Used to Assign Values to DOM Elements]]\n* [[00000000-0000-0000-0000-0000004a4216|Expected Origin Is Explicitly Stated with postMessage]]\n* [[967c9b95-2319-4741-a6fd-1b4bcdf3b636|Data Received by Event Handlers Is Validated]]\n* [[16628f7f-e17a-4bd1-838a-011736bf0995|The Origin Attribute Is Validated Against the FQDN]]\n* [[f103974e-3a42-4837-b04b-7da7e87c41ec|The Origin Attribute of Messages Is Checked]]\n"
        ]
      }
    ]
  }
}