{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000085bc2f"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000085bc2f,83c2a77e-f746-4892-8f39-5d6fe0080cd8,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Tunnel TCP via WebSockets"
        ],
        "Category": [
          "WebSockets"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Tunnel TCP via WebSockets"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* HTML5 and JavaScript\n\n==What to Do==\n\nDo not use WebSockets to tunnel TCP connections. Instead, make those connections through standard TCP ports.\n\n==Why==\n\nDo not use WebSockets to tunnel TCP connections for several reasons:\n* Web proxies may not necessarily support the WebSockets upgrade to the HTTP port protocol.\n* Tunneling non-HTTP and non-HTTPS traffic through ports 80 and 443 will circumvent firewall rules that may be in place for a larger reason. If you offer support for TCP tunneling by turning your web server into a network proxy, you may undermine standard security infrastructure, such as firewalls and secure gateways.\n* Data sent through tunneled TCP connections via WebSockets may not be securely transmitted—particularly if the connection is sent via {{{ws://}}} rather than {{{wss://}}}. The WebSockets connection may not employ the same security and care as the standard TCP connection. This could expose the connection to eavesdropping or other exploits.\n\n==When==\n\nAvoid TCP tunneling of any kind over WebSockets in your applications. \n\n==How==\n\nPerform a thorough review of your applications and remove instances of TCP tunneling if you find any in the review. To perform the review, follow these steps:\n\n# **Find instances of code that uses WebSockets.** Look for instances where a WebSocket is created, such as: {{{var socket = new WebSocket(url);}}}\n# **Review the code to ensure the code is not used for tunneling TCP connections.** Look for any code that uses a port that is not 80 or 443. Also look for code that uses TCP sockets, such as the {{{Socket}}} object.\n# **Remove code that performs tunneling.** If you find any code that you suspect of TCP tunneling, remove the offending code from the application.\n# **If tunneling is necessary, replace the tunneling with secure techniques such as VPN (virtual private networking).** Use industry-standard mechanisms for providing access to required services. Define and implement access policies that use these mechanisms.\n\n==Problem Example==\n\nAn application uses WebSockets to perform a TCP tunnel to provide access over the web to a VNC server. If the web application is compromised, an attacker could now gain access to the VNC server and make more attacks. Since the traffic is tunneled over WebSockets, the traffic is not limited or logged as it would be if a security policy was in place governing VNC traffic.\n\n==Solution Example==\n\nRemove TCP tunneling over WebSockets from the application, and use another method to provide access. For example, open VNC to a specific server directly in the firewall and create access rules.\n\n==WebSocket Guidelines==\n\n* [[00000000-0000-0000-0000-000000869806|Validate Data Coming from WebSockets]]\n* [[00000000-0000-0000-0000-00000093dea4|Check the Origin Header in the WebSocket Handshake]]\n* [[00000000-0000-0000-0000-0000005f2e4a|Use TLS to Encrypt WebSocket Connections]]\n* [[00000000-0000-0000-0000-000000736a21|Check the Origin Attribute of WebSocket Messages]]\n* [[00000000-0000-0000-0000-0000005326a8|Use the Latest WebSocket RFC 6455 Standard]]\n* [[00000000-0000-0000-0000-00000085bc2f|Do Not Tunnel TCP via WebSockets]]\n\n==WebSocket Checklist Items==\n\n* [[00000000-0000-0000-0000-00000086537e|Data Coming from WebSockets Is Validated]]\n* [[00000000-0000-0000-0000-00000077e316|The Origin Header in WebSocket Handshake is Checked]]\n* [[bd870268-f104-4f6f-ba0d-6628dc34eb2a|TLS is Used to Encrypt WebSocket Connections]]\n* [[00000000-0000-0000-0000-0000002f39d7|The Origin Attribute of WebSocket Messages Is Checked]]\n* [[18d5564d-00a4-4afe-a853-707269df2566|Latest RFC 6455 Standard is Used]]\n* [[00000000-0000-0000-0000-00000091ce5a|TCP Is Not Tunneled via WebSockets]]\n"
        ]
      }
    ]
  }
}