{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000006bb239"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000006bb239,da6f6a9d-c91b-4f35-8773-1398c7c3d59d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "XML Data Is Validated Using a Schema"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "XML Data Is Validated Using a Schema"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\nEnsure that all XML data is syntactically validated on the server by using an XML schema.\n\n==Why==\nAn attacker passing malicious XML input can attempt XML injection attacks that aim to exploit your application by overwriting XML data, disclose information from arbitrary URIs, or cause the XML parser to crash or process slowly.\n\n==How To Check==\nTo check for this problem, use the following steps:\n# **Identify all areas where the application generates or consumes XML data.** During the design phase, enumerate all areas where XML data is generated or parsed by the application. Examine the code during the implementation phase for areas that may have been missed.\n# **Identify XML schemas which describe the XML data.** All XML data generated or parsed should have an associated XML schema such as an XSD file, and ensure that the schema is being used.\n# **Ensure quality of XML schemas.** Ensure that the XML schemas tightly define the structure and format of the XML data by using built-in and custom defined element types such as //xs:date//.\n\n==How To Fix==\n\nXML data can be validated with either an XSD or DTD. XSDs are more flexible and are generally favored over DTDs.\n\nTo solve using XSD use the following steps:\n\n# **Identify all areas where the application generates or consumes XML data.** Enumerate all areas where XML data is generated or parsed in your application.\n# **Define an XSD which describes the XML data.** Examine the XML data and define an XSD which tightly defines the structure of the XML data. An XML Schema can consist of a single file, multiple files, or in-line with the XML. If the XML is being generated dynamically via code, it is likely that an XSD can be outputted as well. Finally, the XSD should tightly constrain the XML data by using element types; for example defining a birthday element and assigning it the xs:date type.\n# **Validate the XML with the XSD.** XML can be validated using the XML parser provided by the platform.\n"
        ]
      }
    ]
  }
}