{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000080c790"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000080c790,2fde58cd-6cb4-421b-8023-cbca9cdc7a1d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "File Formats Are Validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Android"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "File Formats Are Validated"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "==Applies To==\n\n* Android applications that open saved files or documents.\n\n==What to Check For==\n\nVerify that file formats are validated.\n\n==Why==\n\nMany vulnerabilities are exploited via malformed documents supplied to the application. One particular vector of attack that is frequently used is embedding malformed documents in web pages - some applications are integrated into the web browser and will open malicious documents automatically in that scenario. Making sure that file format is valid before loading files into the application makes it harder to embed exploit code into documents.\n\n==How to Check==\n\nIdentify the functions that open data files. Verify that these functions include provisions for validating the input data file format before passing it on to other functions.\n\n==How to Fix==\n\nPerform the following actions to validate file format before loading files into the application:\n\n# **Define the file format.** Specify valid values for all possible fields in all document types used by your applications. This information should be a part of project documentation and the developers may already have it.\n# **Review code.** Search for code that loads saved files into the application. Examine the extents of the validation already being performed by the application. If some validation is already being performed, some code may be recycled for a more thorough validation routine.\n# **Implement validation.** Write validation functions for all fields in all document types supported by the application.\n# **Centralize validation.** Move the validation functions for all document fields to the centralized input and data validation class or library. Write a master file format validation function that calls all individual data field validation functions.\n# **Use validation.** Go back to code that loads data files into the application. Remove any old validation code. Add code that calls the master file format validation function on all files being loaded before loading them into the application.\n\n==Data Validation Guidelines==\n\n* [[00000000-0000-0000-0000-0000008d3cec|Canonicalize File Names and Paths]]\n* [[00000000-0000-0000-0000-0000008149ca|Validate All Input]]\n* [[00000000-0000-0000-0000-0000006c7089|Validate and Encode Data Inserted into XML Documents]]\n* [[00000000-0000-0000-0000-0000007635ae|Validate File Formats]]\n\n==Data Validation Checklists==\n\n* [[00000000-0000-0000-0000-0000009763b8|File Names and Paths Are Canonicalized]]\n* [[00000000-0000-0000-0000-0000004f2fec|All Input Is Validated]]\n* [[00000000-0000-0000-0000-00000071b4f0|Data Inserted into XML Documents Is Validated and Encoded]]\n* [[00000000-0000-0000-0000-00000080c790|File Formats Are Validated]]"
        ]
      }
    ]
  }
}