{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000031051f"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000031051f,8304558e-ff6f-4055-8d03-cbaef17d1cfc,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Role-based Authorization Is Used"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Android"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Role-based Access Control Is Used"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Android applications that access resources on a remote server.\r\n\r\n==What to Check For==\r\n\r\nVerify that role-based access control is used.\r\n\r\n==Why==\r\n\r\nApplication roles allow administrators to group users into categories that need the same level of privileges. The mechanism provides an easy and clear way to discover and manage the least privilege necessary for the execution of a given task. It provides a more robust and flexible way of managing the application's users than per-user access control.\r\n\r\n==How to Check==\r\n\r\nTo verify that role-based access control is used:\r\n\r\n# **Understand the different types of users.** Enumerate the different types of users needed for the application. Understand how they will use the application and to which resources they will need access. Create a matrix (spreadsheet) mapping the actions each role is authorized to perform with the corresponding system components. Use this matrix (spreadsheet) to identify the different types of users according to the functionality they need. Creating a threat model may be a useful step to ensure that you correctly understand the implications of this matrix.\r\n# **Verify that roles have been defined.** Determine which resources can be accessed by each role.\r\n# **Verify that access control is implemented.** Examine code that accesses each type of resources to make sure that it performs access control checks before accessing the resource.\r\n# **Verify that access control enforces defined roles.** Examine the code that performs access control checks to make sure that it enforces the defined roles.\r\n\r\n==How to Fix==\r\n\r\nUse the following steps when designing role-based security:\r\n\r\n# **Understand the different types of users.** Enumerate the different types of users needed for the application. Understand how they will use the application and to which resources they will need access. Create a matrix mapping the actions each role is authorized to perform with the corresponding system components. Use this matrix to identify the different types of users according to the functionality they need. Creating a threat model may be a useful step to ensure that you correctly understand the implications of this matrix.\r\n# **Establish the roles.** Define which resources can be accessed by each role. Place access control checks at the appropriate locations in your application.\r\n# **Manage the users.** Assign the users into their respective user roles. The application should enforce the security policy according to the user roles instead of the actual user.\r\n\r\n==Authorization Guidelines==\r\n\r\n* [[00000000-0000-0000-0000-0000007ea0fe|Disable File Sharing by Default]]\r\n* [[00000000-0000-0000-0000-000000760326|Use Role-based Access Control]]\r\n\r\n==Authorization Checklists==\r\n\r\n* [[00000000-0000-0000-0000-000000402966|File Sharing Is Disabled by Default]]\r\n* [[00000000-0000-0000-0000-00000031051f|Role-based Access Control Is Used]]\r\n\r\n"
        ]
      }
    ]
  }
}