{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-000000396c19"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-000000396c19,ed7404ea-00fa-4f4c-a692-9771b8ed3eda,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "All Input Is Validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "iOS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All Input Is Validated"
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* iOS applications that accept user input.\r\n\r\n\r\n## What to Check For ##\r\n\r\nVerify that all input is validated.\r\n\r\n\r\n## Why ##\r\n\r\nProperly implemented input validation mitigates many types of injection vulnerabilities. Input validation should be used as a part of a defense-in-depth strategy.\r\n\r\n\r\n## How to Check ##\r\n\r\nTo verify that all input is validated:\r\n\r\n1. **Identify all entry points for user input.** Make a list of all possible sources of user input in your application.\r\n\r\n2. **Identify all types on input accepted by the application.** For each source of user input on the list, define valid characters, length, format, and range (for numerical values).\r\n\r\n3. **Trace data from source to sink.** Trace each source of input through your application until you find its ultimate destination.  The ultimate sink may be in memory, on the hard drive, or in a database, or the data may ultimately be sent over the network.\r\n\r\n4. **Inspect the input validation subsystem.** Each input source should have a data validation routine associated with it. The validation should occur as soon as possible after the input reaches your application. Shared validation routines are better than many different routines spread throughout your code base. Check for consolidation of routines to aid testing and reduce the chance of one-off bugs. If an input source does not have a validation routine associated with it, flag it for fixing. \r\n\r\n5. **Ensure quality of validation routines.** Make sure that each validator verifies the characters, length, format, and range (for numerical values) of its respective type of input. Validation should check first for known valid and safe data and then for malicious, dangerous data. Do not rely on filtering out all malicious data, as it is easy to miss something.\r\n\r\n\r\n## How to Fix ##\r\n\r\nTo validate all user input using whitelist input validation:\r\n\r\n1. **Identify all entry points for user input.** Make a list of all possible sources of user input in your application.\r\n\r\n2. **Identify all types of input accepted by the application.** For each source of user input on the list, define valid characters, length, format, and range (for numerical values).\r\n\r\n3. **Define an input validation subsystem.** Define a set of validator functions that should be used to validate each type of input handled by the application.\r\n\r\n4. **Validate characters.** Restrict the acceptable range of characters in text input using regular expressions.\r\n\r\n5. **Validate length.** Add code to check that the length of the user input is valid.\r\n\r\n6. **Validate format.** If the input type has a specific pattern, such as a date or a phone number, use regular expressions to make sure user input matches the input type specified by the application. \r\n\r\n7. **Validate range.** Restrict the acceptable range of numerical input by comparing the input to the maximum and minimum acceptable values.\r\n\r\n8. **(Optional) Reject and respond to known bad input.** This step does not add much actual security, but it may provide some defense in depth. The input validation subsystem may check for known attack strings and respond to these likely attacks by alerting the user. The options for responding to invalid input are: reject invalid input, log invalid input, take evasive action.\r\n\r\n9. **(Context-sensitive) Encode input.** If the input is going to be displayed back through a web browser, consider encoding it to prevent Cross-Site Scripting attacks.\r\n"
        ]
      }
    ]
  }
}