{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000002ca360"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000002ca360,b3efe307-3bdc-4a4a-bd2c-8b10f485bef0,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Strong Session Identifiers Are Used"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Strong Session Identifiers Are Used"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET\r\n\r\n==What to Check For==\r\n\r\nVerify that default ASP.NET session identifiers are used.\r\n\r\n==Why==\r\n\r\nUsing strong session identifiers prevents attackers from easily guessing session ids and taking over users' sessions. If an attacker hijacks the session he/she can perform the same functions as the logged in user. This will lead to a compromise of user account and in case the user is an administrator, the whole application.\r\n\r\n==How to Check==\r\n\r\nTo make sure that default ASP.NET session identifiers are used.\r\n\r\n# **Load the application.** Open the application in a web browser. Log in to the application. Any other way to start a session is okay, but logging in is a pretty sure way to start a session for any reasonably designed application.\r\n# **Examine the session identifier.** Use the browser plug-in or settings page that allows viewing the cookies. Make sure the //ASP.NET_SessionId// cookie is present. This cookie indicates that ASP.NET session state is used. Absence of this cookie should be alarming.\r\n# **(Optional) Review application code.** The presence of the ASP.NET session cookie is a strong indicator that the default session ID generation algorithm is being used. To be absolutely sure, review the application code that handles session state. Make sure that it either uses the default session ID generation algorithm or that it generates a strong random session identifier. The definition of what constitutes a strong session identifier is different for different standards. The default ASP.NET session ID generation algorithm has 2^120 possibilities. This number can be used as a benchmark for any custom algorithms that may be used. Another important consideration is the source or sources of entropy. ASP.NET uses multiple sources of entropy to generate session IDs and overall it is best to just use the default algorithm.\r\n\r\n==How to Fix==\r\n\r\nASP.NET uses strong session IDs by default. Please, make sure that your application uses the default ASP.NET session IDs. Rewrite the application session state handling code, if necessary, to use the default ASP.NET session ID generation algorithm. Session cookies will automatically be created if ASP.NET session state is used.\r\n\r\nEven though it is strongly advised against, if your application must use a custom session ID, make sure that the ID generation algorithm is sufficiently random to make it difficult to predict the IDs. The default ASP.NET session ID has 2^120 possible values. Using a custom ID generation algorithm, try to get at least as much entropy as the default ASP.NET algorithm."
        ]
      }
    ]
  }
}