{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000003087b2"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000003087b2,841de4b9-c473-40a4-ac23-aefb5190aa29,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Users Are Told to Clear the Cache After Browsing Through Untrusted Networks"
        ],
        "Category": [
          "Privacy"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Users Are Told to Clear the Cache After Browsing Through Untrusted Networks"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* HTML5\r\n\r\n==What to Check For==\r\n\r\nVerify that users are warned to clear the cache after browsing through untrusted networks.\r\n\r\n==Why==\r\n\r\nUsers should clear the cache after browsing through untrusted networks because the operator(s) of the untrusted network might have substituted legitimate content with malicious content. Malicious content may include attack code or deceptive information. Keeping malicious content in the cache presents a danger to the user. This danger may be mitigated by clearing the cache after browsing through untrusted networks.\r\n\r\n==How to Check==\r\n\r\nTo verify that users are warned to clear the cache after browsing through untrusted networks:\r\n# **Log in and use the application.** Log in to the application and use it in the way a regular user is likely to use it for the amount of time necessary to explore most of the application's important features. \r\n# **Note if there is a warning to clear the cache.** While using the application, note whether a warning is displayed about the importance of clearing the cache after browsing untrusted networks.\r\n\r\n==How to Fix==\r\n\r\nTo remind the users to to clear the cache after browsing through untrusted networks:\r\n\r\n# **Write a warning message.** Write a message to inform the users that, if they are browsing through untrusted networks, legitimate content might be substituted with malicious content, and that therefore they should clear their cache.\r\n# **Choose how to present the warning message.** Consider the best way to present the warning message to the user. One option is to place the warning message on the main page. Some other options are to place it on its own page, include it in the user agreement, or to display it as a popup.\r\n# **Present the warning message.** Add code that displays the warning message in the manner that has been decided upon.\r\n\r\n==Privacy and Trust Guidelines==\r\n\r\n* [[00000000-0000-0000-0000-0000001de66c|Ask User Permission Before Using Geopositioning]]\r\n* [[00000000-0000-0000-0000-000000364213|Ask User Permission Before Sending a Manifest]]\r\n* [[00000000-0000-0000-0000-0000003b92c3|Tell Users to Clear the Cache after Browsing Through Untrusted Networks]]\r\n\r\n==Privacy and Trust Checklist Items==\r\n\r\n* [[00000000-0000-0000-0000-0000006e3400|The User Is Asked for Permission Before Geopositioning]]\r\n* [[00000000-0000-0000-0000-00000085555d|The User Is Asked for Permission Before Sending a Manifest]]\r\n* [[00000000-0000-0000-0000-0000003087b2|Users Are Told to Clear the Cache After Browsing Through Untrusted Networks]]\r\n\r\n"
        ]
      }
    ]
  }
}