{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000008acc7f"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000008acc7f,f7ba3ee8-3f24-4fd7-9f58-371da6ec6fa2,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "All File Path and Name Input Is Canonicalized"
        ],
        "Category": [
          "Canonicalization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All File Path and Name Input Is Canonicalized"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET\r\n\r\n==What to Check For==\r\n\r\nVerify that all file paths and names obtained as user input are canonicalized before making security decisions on access to resources..\r\n\r\n==Why==\r\n\r\nWhen input validation is applied to file paths and names, it only works properly when file paths and names are canonicalized.  If file names and paths are not canonicalized\t before validation, a number of vulnerabilities may be introduced as a result. The possible vulnerabilities range from reading arbitrary files to uploading web shells.\r\n\r\n==How to Check==\r\n\r\nTo make sure that all file path and name input is canonicalized:\r\n\r\n# **Identify all file path and name input.** Examine the application and find all cases where the user may specify file names or paths.\r\n# **Find code that handles file path and name input.** Review application code and find all functions that handle user supplied file names or paths.\r\n# **Consider whether file name or path input is necessary.** Examine the code that accepts file name or path input from the user and consider other ways to do the same thing or removing this functionality altogether.\r\n# **Verify that file name and path input is canonicalized.** Examine each function that handles user supplied file names or paths. Make sure user supplied input is immediately canonicalized. Make sure you use ASP.NET standard libraries //Request.MapPath// or //Server.MapPath// to canonicalize file names and paths before validation. Use of standard canonicalization libraries yields in consistent results and ensures coverage of all cases.\r\n# **Verify that file name and path input is validated.** Examine each function that handles user supplied file names or paths. Make sure these functions use positive validation routines on file names and paths after canonicalization.\r\n\r\n==How to Fix==\r\n\r\nTo canonicalize all file path and name input:\r\n\r\n# **Identify all file path and name input.** Examine the application and find all cases where the user may specify file names or paths.\r\n# **Find code that handles file path and name input.** Review application code and find all functions that handle user supplied file names or paths.\r\n# **Avoid file path and name input if possible.** If possible, remove or replace the code that allows users to enter file names or paths.\r\n# **Canonicalize file path and name input.** Examine each function that handles user supplied file names or paths. Re-write these functions as necessary to use //System.IO.Path.GetFullPath// to canonicalize file names and paths.\r\n# **Validate file path and name input.** Examine each function that handles user supplied file names or paths. Re-write these functions as necessary to use positive validation on canonicalized file names and paths."
        ]
      }
    ]
  }
}