{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000035b501"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000035b501,e08130a9-735b-4528-a36a-cff60e36776b,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Log Error Information"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Log Error Information"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* ASP.NET\n\n==What to Do==\n\nLog error information - whenever an error condition is being handled, add a record to the log about it.\n\n==Why==\n\nLogging error information helps to debug errors. Logging error information may help find vulnerabilities during an audit. Logging error information may also help identify attacks as they are taking place or during a forensic investigation.\n\n==How==\n\nTo log error information:\n\n# **Identify the logging subsystem.** Logging is one of the essential security components of an application. Find the logging functions that are provided by the application. Review them briefly to figure out how they work and where they store the error files.\n# **Identify error handling code.** Enumerate all the code that handles application errors. There may be a considerable amount of this code, which is a good thing. It should be alarming if there is very little error handling code.\n# **Determine relevant error details.** For each block of error handling code, determine the information that should be logged to help debug the error. Make sure to include time-stamps. It may be helpful to log the active username and the accessed resources as applicable to help identify attacks.\n# **Add logging code to error handling routines.** Add code that records the relevant information to the error handlers. "
        ]
      }
    ]
  }
}