{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-000000467952"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-000000467952,20ed4af2-e529-4fcd-844b-ae13431de3fa,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Store Cached Authentication Data in the Keychain"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "iOS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Store Cached Authentication Data in the Keychain"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "==Applies To==\n\n* iOS applications that cache authentication data.\n\n==What to Do==\n\nStore sensitive data such as encryption keys and cached authentication credentials in the //keychain//.\n\n==Why==\n\nAuthentication credentials and encryption keys should be stored in the //keychain//, because the //keychain// encrypts data stored in it and is designed for storing such information. The //keychain// is also suitable for storing application configuration settings.\n\n==How==\n\nTo use the //keychain// to store cached authentication data and encryption keys:\n\n# **Identify cached authentication data.** Make a list of all cached authentication data used by your application. Some examples are:\n#* Passwords\n#* Certificates\n#* Encryption keys\n#* Authentication tokens\n# **Define encryption requirements for sensitive data stored in files.** Choose the level of protection that is most appropriate for each type of sensitive data that is stored in files and handled by the application. The iOS Data Protection API provides the following protection levels:\n#* //FileProtectionNone// - no encryption.\n#* //FileProtectionComplete// - encrypt the file and deny access when the device is locked.\n#* //FileProtectionCompleteUnlessOpen// - encrypt the file until it is open, leave it decrypted while it is open even if the device is locked.\n#* //FileProtectionCompleteUntilFirstUserAuthentication// - encrypt the file until the device is unlocked for the first time after a reboot.\n# **Define encryption requirements for sensitive data that is stored in the keychain.** Choose the level of protection that is the most appropriate for each type of sensitive data that is stored in the keychain and handled by the application. The keychain provides the following protection levels:\n#* //kSecAttrAccessibleAlways// - the item is always available.\n#* //kSecAttrAccessibleWhenUnlocked// - the item is only available when the device is unlocked.\n#* //kSecAttrAccessibleAfterFirstUnlock// - the item is only available after the device is unlocked for the first time after a reboot.\n#* //kSecAttrAccessibleAlwaysThisDeviceOnly// - the item is always available, but is not moved to other devices.\n#* //kSecAttrAccessibleWhenUnlockedThisDeviceOnly// - the item is only available when the device is unlocked and is not moved to other devices.\n#* //kSecAttrAccessibleAfterFirstUnlockThisDeviceOnly// - the item is only available after the device is unlocked for the first time after a reboot and is not moved to other devices.\n# **Identify the code that caches authenticaton data.** Find all application code that handles data that should be stored in the //keychain//.\n# **Store cached authentication credentials in the keychain.** Edit code that handles cached authentcation data to store such data in the keychain. \n\n==Cryptographic Storage Guidelines==\n* [[00000000-0000-0000-0000-0000002a5e0d|Encrypt Stored Sensitive Data]]\n* [[00000000-0000-0000-0000-000000467952|Store Cached Authentication Data in the Keychain]]\n\n==Cryptographic Storage Checklists==\n* [[00000000-0000-0000-0000-0000002bf00e|Stored Sensitive Data Is Encrypted]]\n* [[00000000-0000-0000-0000-0000004b75cb|Cached Authentication Data Is Stored in the Keychain]]\n\n"
        ]
      }
    ]
  }
}