{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000002f59fd"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000002f59fd,e2c96e49-ab00-4579-b1f8-5aa8b7cca0b3,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Data Received by Web Workers Is Validated"
        ],
        "Category": [
          "Web Workers"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Data Received by Web Workers Is Validated"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* HTML5\n\n==What to Check For==\n\nVerify that data exchanged between the server and the Web Workers is validated on the server.\n\n==Why==\n\nValidate data received by Web Workers to make it harder for an attacker to manipulate the Web Worker's activity via a Man-in-the-middle attack.\n\n==How to Check==\n\nTo verify that data exchanged between the server and the Web Workers is validated:\n\n# **Identify all code that exchanges data between Web Workers and the server.** Create a spreadsheet of all code that is used to exchange messages between the Web Worker and the server. This code will be within the script that is used by the Web Worker.\n# **Verify that validator functions are called before processing data.** Examine each piece of code that exchanges data between Web Workers and the server to make sure that validator functions are called before the received data is processed. Data that does not pass validation should not be processed. Create a spreadsheet to list the validator functions and the types of data that they validate.\n# **Examine validator functions.** Examine each validator function used by Web Workers and make sure that they effectively check whether data matches the expected length, characters (for text data), format (for formatted data), and range (for numerical data). \n\n==How to Fix==\n\nTo validate data exchanged between the Web Worker and the server:\n\n# **Identify all data types exchanged between the Web Workers and the server.** Create a spreadsheet of all data types that are exchanged between the Web Workers and the server.\n# **Define valid data formats.** For each type of data in the spreadsheet, define valid characters, length, format, and range (for numerical values).\n# **Define validator functions.** Define a set of validator functions that should be used to validate each type of data exchanged between the server and the Web Workers. Data should be validated on the server. \n# **Validate length.** Add code to check that the length of the data is valid.\n# **Validate characters.** Use regular expressions to restrict the acceptable range of characters in text data.\n# **Validate format.** If the data type has a specific pattern, such as a date or a phone number, add code to use regular expressions to make sure data matches the correct type. Use regular expressions to enforce strong password requirements.\n# **Validate range.** To restrict the acceptable range of numerical input, compare the data to maximum and minimum acceptable values.\n# **Find code that exchanges data between the server and the Web Workers.** Create a spreadsheet of all the code used by the Web Workers that receives data from the server.\n# **Use the validator functions.** Identify all code that handles messages received by Web Workers. Add code to use the validator functions before actually processing the messages. If data is not valid, it should not be processed. \n\n==Web Worker Guidelines==\n\n* [[00000000-0000-0000-0000-00000083c4cc|Do Not Pass Code to Web Workers to eval()]]\n* [[00000000-0000-0000-0000-00000006a783|Validate Data Received by Web Workers]]\n\n==Web Worker Checklist Items==\n\n* [[00000000-0000-0000-0000-000000392041|Web Workers Do Not eval() Data Pased to Them]]\n* [[00000000-0000-0000-0000-0000002f59fd|Data Received by Web Workers Is Validated]]\n"
        ]
      }
    ]
  }
}