{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000002d9dac"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000002d9dac,039b37ac-9147-428f-998a-3c01bd343aad,"
        ],
        "Library_Id": [
          "b6f408c5-6e6e-4bc0-90a5-0bb10becc2ce"
        ],
        "Title": [
          "Code Integrity Checks Are Implemented"
        ],
        "Category": [
          "Code Integrity"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "iOS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Code Integrity Checks Are Implemented"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "==Applies To==\r\n\r\n* All iOS applications.\r\n\r\n==What to Check For==\r\n\r\nVerify that code integrity checks are implemented.\r\n\r\n==Why==\r\n\r\nCode integrity checks help prevent software piracy and unauthorized modifications to the application. Code integrity checks do not provide 100% assurance of code integrity, but they make it harder for an attacker to modify the application binary code without breaking it.\r\n\r\n==How to Check==\r\n\r\nTo verify that code integrity checks are implemented:\r\n\r\n# **Identify piracy check functions.** It's best if someone knows whether piracy checks exist and where they are. Otherwise it might be necessary to examine each function individually to determine its purpose.\r\n# **Identify integrity check functions.** It's best if someone knows whether integrity checks exist and where they are. Otherwise it might be necessary to examine each function individually to determine its purpose.\r\n# **Verify that integrity check functions protect piracy check functions.** Find calls to the piracy check functions and make sure that integrity check functions are also called to verify that piracy check functions have not been tampered with.\r\n# **Verify that piracy check and integrity check functions are scattered throughout the application.** Find calls to the piracy and integrity check functions to make sure they are called multiple times throughout the application.\r\n\r\n\r\n==How to Fix==\r\n\r\nTo check code for integrity:\r\n\r\n# **Write piracy check functions.** Piracy check functions often try to determine whether the application is running on a jailbroken device. The application is not necessarily pirated if it is on a jailbroken device, but there are no foolproof anti-piracy or code integrity measures for jailbroken devices. Piracy checks can determine whether a device is jailbroken by checking for the existence of files that only appear on jailbroken devices, such as Cydia. If piracy is not a concern, this step may be omitted.\r\n# **Write integrity check functions.** The most common ways to implement code integrity checks is to check classes for expected addresses or checksums. The //class_getMethodImplementation// method returns a pointer to a method; checking the value of this pointer against the expected value provides reasonable assurance that the method has not been modified during runtime.\r\n# **Define integrity check functions as inline.** The integrity check functions written in the previous step should be defined as //inline// so that the compiler inserts the full integrity checking code wherever it is invoked.\r\n# **Scatter integrity check functions throughout the application.** Multiple integrity check function calls spread out throughout the application make it harder for an attacker to find them all and patch them.\r\n\r\n==Code Integrity Guidelines==\r\n* [[00000000-0000-0000-0000-0000002e3de4|Implement Code Integrity Checks]]\r\n* [[00000000-0000-0000-0000-000000470103|Sign iOS Application Updates]]\r\n* [[00000000-0000-0000-0000-000000986af1|Sign iOS Applications]]\r\n\r\n==Code Integrity Checklists==\r\n* [[00000000-0000-0000-0000-0000002d9dac|Code Integrity Checks Are Implemented]]\r\n* [[00000000-0000-0000-0000-000000892dc7|iOS Application Updates Are Signed]]\r\n* [[00000000-0000-0000-0000-00000039db6a|iOS Applications Are Signed]]\r\n\r\n==Additional Resources==\r\n\r\n* For more information about the //class_getMethodImplementation// method, please see https://developer.apple.com/library/mac/#documentation/Cocoa/Reference/ObjCRuntimeRef/Reference/reference.html"
        ]
      }
    ]
  }
}