{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000007cad1c"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000007cad1c,a44a146d-c33a-467b-be14-7c074a2007f1,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Do Not Store Sensitive Data in Persistent Cookies"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Store Sensitive Data in Persistent Cookies"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET \r\n\r\n==What to Do==\r\n\r\nExpire cookies with sensitive information when session ends.\r\n\r\n==Why==\r\n\r\nData stored in persistent cookies may be recovered by an attacker, if the attacker gets access to where the cookies are stored. Usually, this attack scenario means an attacker gaining access to the victim's computer and recovering all the cookies from it. At that point, any sensitive data in those cookies comes into the possession of the attacker. It is therefore not recommended to store sensitive data in persistent cookies. The most common type of sensitive data that is stored in persistent cookies is an authentication token or a session ID, which is used to keep a user logged on for an extended period of time. If this functionality is absolutely required, then storing such sensitive information in persistent cookies cannot be avoided. Overall, it is recommended not to implement that functionality and not to store any sensitive information in persistent cookies.\r\n\r\n==How==\r\n\r\nTo prevent storing sensitive data in persistent cookies:\r\n\r\n# **Identify all cookies used by the application.** Search application code for references to //HttpCookie//. This should help find all the cookies created by the application.\r\n# **Find code that handles sensitive cookies.** Examine code that handles each cookie and see if it stores sensitive information in the cookie. This include session identifiers.\r\n# **Don't make sensitive cookies persistent.** Review all code that handles sensitive cookies. Make sure that the //Expires// property of sensitive cookies is never set, because that makes them persistent. Remove code that sets the //Expires// property of sensitive cookies, if such code exists."
        ]
      }
    ]
  }
}