{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000061594a"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000061594a,75740340-947c-4634-9b52-c7a04051c962,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Use User Input in Connection Strings"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Do Not Use User Input in Connection Strings"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n*ASP.NET\n\n==What to Do==\n\nEnsure connection strings do not contain user supplied input. \n\n==Why==\n\nDon't include user-controlled data in connection strings to prevent connection string injection attacks. If user input is inserted into a connection string, an attacker may be able to control what database server the application connects to. Giving an attacker controls over what database the application connects to is known as connection string injection vulnerability. An attacker may leverage this vulnerability to bypass authentication or cause unexpected application behavior.\n\n==How==\n\nTo prevent user input from being used in connection strings:\n\n# **Identify all connection strings used by the application.** Search the code, configuration files and protected storage for connection strings. This is also a good opportunity to move any hard coded connection strings to protected storage. \n# **Identify connection strings that include user input.** Out of the identified connection strings, find ones that include user input. \n# **Replace connection strings that include user input.** Replace connection strings that include user input, but don't hard-code the connection strings. Store connection strings in protected storage using DPAPI.\n# **Validate all user input.** If the application absolutely must get connection string parameters from the user, the user input needs to be properly validated. One applicable scenario is for administrator to  enter connection string information during application configuration. In this case, user input should be thoroughly validated. The interface that is used to configure the application only be accessible by the administrator. Once the application is configured, connection strings should be stored in protected storage using DPAPI. "
        ]
      }
    ]
  }
}