{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000000d2743"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000000d2743,81de83bc-ffd6-4982-a501-9df292b3a4bd,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Use the Sandbox Attribute of Iframes"
        ],
        "Category": [
          "Frames"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use the Sandbox Attribute of Iframes"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* HTML5\r\n\r\n==What to Do==\r\n\r\nUse the sandbox attribute to apply restrictions to iframe elements.\r\n\r\n==Why==\r\n\r\nThe sandbox attribute can be used to prevent scripts from being executed from iframe elements, and to apply other restrictions to iframe elements. This reduces the risk that the content in that frame will be used maliciously. Iframe elements that load content from untrusted sites can be abused if the attacker replaces the legitimate content with malicious content. This functionality is commonly abused by attackers to run JavaScript that loads a sequence of exploits to try to compromise the user's system via the browser and plug-ins. \r\n\r\n==How==\r\n\r\nTo use the sandbox attribute to apply restrictions to iframe elements:\r\n\r\n# **Find all iframe elements.** Search the application code for \"iframe\" to find all iframe elements. Create a spreadsheet of all iframe elements used by the application.\r\n# **Determine acceptable restrictions that can be applied.** Review each iframe element and determine the maximum restrictions that can be applied to it without impacting application performance. To specify restrictions, explicitly grant permissions. The options are: \r\n## \"\" - This makes no explicit permissions, i.e., all restrictions are applied. Iframe content is treated as not from the same origin, the iframe cannot load content from the containing document, form submission is not allowed in the iframe, and scripts are not allowed to execute in the iframe.\r\n## **allow-same-origin** - Allows iframe content to be treated as coming from the same origin.\r\n## **allow-top-navigation** - Allows iframe to load content from the page that contains the iframe.\r\n## **allow-forms** - Allows form submission with the iframe.\r\n## **allow-scripts** - Allows scripts to execute within the iframe.\r\n# **Add sandbox attributes to iframe elements.** Add sandbox attributes to all iframe elements and apply the maximum applicable restrictions to each respective element.\r\n\r\n==Additional Resources==\r\n\r\n* For more information about iframe sandbox attributes, see http://www.w3schools.com/tags/att_iframe_sandbox.asp\r\n* For more information about sandboxed iframes, see http://www.html5rocks.com/en/tutorials/security/sandboxed-iframes/\r\n\r\n==Frames Guideline==\r\n\r\n* [[00000000-0000-0000-0000-0000000d2743|Use the Sandbox Attribute of Iframes]]\r\n\r\n==Frames Checklist Item==\r\n\r\n* [[00000000-0000-0000-0000-0000006ab208|The Sandbox Attribute of Iframes Is Used]]\r\n"
        ]
      }
    ]
  }
}