{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000077e316"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000077e316,73b1aece-2f13-44d9-b9d2-ffad6c99c0ff,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "The Origin Header in WebSocket Handshake is Checked"
        ],
        "Category": [
          "WebSockets"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Origin Header in WebSocket Handshake is Checked"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* HTML5\r\n\r\n==What to Check For==\r\n\r\nVerify that the origin header in WebSocket handshakes is checked.\r\n\r\n==Why==\r\n\r\nBy checking the origin, you can restrict access to the WebSocket server, allowing requests only from the same origin or specified domains. This prevents potentially malicious connections.\r\n\r\n\r\n==How To Check==\r\n\r\nTo verify that the origin header in WebSocket handshakes is checked:\r\n\r\n# **Examine the server configuration file.** Examine the server configuration file to make sure that the Origin header is checked. The exact details of configuring WebSocket servers to check Origin headers are different for different implementations.\r\n# **Review code that validates headers.** It might be the case that the WebSocket implementation that is used by the application does not have an option to check Origin headers automatically. In that case, custom code will be necessary to perform that functionality. Implementation details are platform-specific, so there are no clear keywords to search for to find this functionality. The Origin header should be validated before the WebSocket tunnel is established, so this code should be located or called at the beginning of the code that establishes the WebSocket connection, and this information should help find this code. If such code does not exist, it should be added. \r\n\r\n\r\n==How To Fix==\r\n\r\n\r\nTo check for origin:\r\n\r\n# **Configure the WebSocket server to check the Sec-WebSocket-Origin header value (for older WebSocket clients) or Origin header value (for newer clients).** Add code to the configuration file in accordance with your server language. For example, for PHP-WebSocket, which is an open source PHP implementation of a WebSocket server library, use the following method call to set origin checking: {{{$server->setCheckOrigin(true);}}}. This reads the value of  Sec-WebSocket-Origin  or  origin.\r\n# **Specify the allowed origins from which the server will accept connections.**  For example, to accept connections only from an HTML5 application residing on the same server, configure it to accept connections from the “same origin” only. If the WebSocket server and the application both reside on web.example.com, configure the WebSocket server to accept only from {{{Origin= web.example.com}}}.\r\n# **Iterate through the request headers to find the Origin or Sec-WebSocket-Origin header.** If the value is null or does not match the set of allowed origins, close the connection stream with a 401 response.\r\n\r\n{{{\r\n\r\n$example_origins = array('example.com',’web.example.com’);\r\n\r\nforeach ($example_origins as $origin) {\r\n    $server->setAllowedOrigin($origin);\r\n    $origin_ips[] = gethostbyname($origin);\r\n}\r\nif (!in_array($_SERVER[\"REMOTE_ADDR\"], $origin_ips)) {\r\n\r\n// send 401 response\r\n}\r\nelse {\r\n// begin tunnel\r\n}\r\n\r\n\r\n}}}\r\n\r\n\r\n==WebSocket Guidelines==\r\n\r\n* [[00000000-0000-0000-0000-000000869806|Validate Data Coming from WebSockets]]\r\n* [[00000000-0000-0000-0000-00000093dea4|Check the Origin Header in the WebSocket Handshake]]\r\n* [[00000000-0000-0000-0000-0000005f2e4a|Use TLS/SSL to Encrypt WebSocket Connections]]\r\n* [[00000000-0000-0000-0000-000000736a21|Check the Origin Attribute of WebSocket Messages]]\r\n* [[00000000-0000-0000-0000-0000005326a8|Use the Latest WebSocket RFC 6455 Standard]]\r\n* [[00000000-0000-0000-0000-00000085bc2f|Do Not Tunnel TCP via WebSockets]]\r\n\r\n==WebSocket Checklist Items==\r\n\r\n* [[00000000-0000-0000-0000-00000086537e|Data Coming from WebSockets Is Validated]]\r\n* [[00000000-0000-0000-0000-00000077e316|The Origin Header in WebSocket Handshake is Checked]]\r\n* [[bd870268-f104-4f6f-ba0d-6628dc34eb2a|TLS/SSL is Used to Encrypt WebSocket Connections]]\r\n* [[00000000-0000-0000-0000-0000002f39d7|The Origin Attribute of WebSocket Messages Is Checked]]\r\n* [[18d5564d-00a4-4afe-a853-707269df2566|Latest RFC 6455 Standard is Used]]\r\n* [[00000000-0000-0000-0000-00000091ce5a|TCP Is Not Tunneled via WebSockets]]\r\n\r\n"
        ]
      }
    ]
  }
}