{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000077a50c"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000077a50c,a42cc5d9-2981-490a-8c36-2a657a0dbae5,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Passwords Are Stored Securely"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Passwords Are Stored Securely"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Any\n\n==What to Check For==\n\nVerify that iterative hashing is used to protect stored passwords.\n\n==Why==\n\nStoring hashes instead of plain-text passwords assures that an attacker cannot easily recover the passwords if he gains access to the password files. Adding salt to hashed files makes hashes much harder to break with dictionary attacks. Hashing should be applied multiple times to make hashing take longer and thus increase the computational resources required to attack the hashes. Iterative hashing applies a hashing function multiple times to a password and a salt, drastically increasing the time required to perform dictionary attacks.\n\n==When==\n\nUse iterative hashing when storing passwords.\n\n==How to Check==\n\nUse the following steps to verify that stored passwords are salted and hashed:\n\n# **Identify code that stores passwords.**  Identify code that is responsible for storing passwords.\n# **Review code that stores passwords.** Review the code that stores passwords to verify that it hashes stored passwords using an iterative hashing algorithm such as PBKDF2 or bcrypt.\n# **Verify that the iterative hashing algorithm is implemented correctly.** Make sure that a trusted library, such as OpenSSL, is used as the implementation of the iterative hashing algorithm.\n\n==How to Fix==\n\nPerform the following actions to hash and salt stored passwords:\n\n# **Generate a random salt value.** Each bit of salt doubles the memory and computational requirements for dictionary attacks. Recommended salt lengths are 32-64bit. Use a random number generator of your choice to generate a random number of required size. Use this number as the salt.\n# **Concatenate the password and the salt.** Use string functions to concatenate the password and the salt. Make sure your buffer is large enough to store the concatenated string to prevent buffer overflows.\n# **Hash the password and the salt using multiple iterations.** Use an iterative hashing algorithm, such as PBKDF2 or bcrypt to hash the password and the salt at least ten times.  It is best to use a trusted library, such as OpenSSL, to make sure that the algorithm is implemented correctly.\n# **Store the hash and the salt.** Store the hash in the file or database of your choosing. It is important to store both the hash and the salt, because the salt will have to be used when comparing user entered passwords to the hashed value. Remember to keep track of the amount of iterations used by the hashing algorithm.\n# **Implement password verification.** During authentication, the password entered by the user should be checked against the hashed and salted value. To do this, retrieve the hash value and the salt from password storage. Concatenate user input with the stored salt, hash the resulting string iteratively using the same amount of rounds as was used to calculate the stored hash, and compare the resulting string against the stored hash. If the resulting hash is the same as the stored hash, the user has entered the correct password.\n"
        ]
      }
    ]
  }
}