{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000012cfad"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000012cfad,655df0c7-d458-4e6d-9285-426754f64b77,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Reflection Is Avoided"
        ],
        "Category": [
          "Dangerous APIs"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Reflection Is Avoided"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET\r\n\r\n==What to Check For==\r\n\r\nMake sure that reflection is avoided as much as possible.\r\n\r\n==Why==\r\n\r\nReflection allows executing data as code. If user-controlled data is executed as code, an attacker may be able to execute arbitrary code to take over the application.\r\n\r\n==How to Check==\r\n\r\nTo make sure that reflection is used as little as possible:\r\n\r\n# **Find all code that uses reflection.** Search the code for the use of //System.Reflection// namespace to find code that uses reflection.\r\n# **Determine if reflection is necessary.** Examine each case where reflection is used and determine whether it is possible to do the same thing without using reflection or to remove the code that uses reflection altogether.\r\n\r\n==How to Fix==\r\n\r\nTo avoid using reflection:\r\n\r\n# **Find all code that uses reflection.** Search the code for the use of //System.Reflection// namespace to find code that uses reflection.\r\n# **Remove code that uses reflection if possible.** Consider whether the code that uses reflection is absolutely necessary. Think of ways to replace the reflection code with something else that does the same thing.\r\n# **Don't pass user data to code that uses reflection.** Review code that uses reflection and make sure that it doesn't accept user data. The nature of reflection is that it allows passing code as data, so there isn't really a safe way to handle user input passed to reflection. \r\n# **Validate user data passed to code that uses reflection.** If it's absolutely necessary to use reflection with user data, then data passed to it must be rigorously validated. Use positive input validation to check the user supplied data.  Ensure that only valid input is accepted. Limit user data to as small data set as possible.    It is a good idea to include a highly visible warning in the application's documentation and code comments, precisely stating the conditions under which reflection with user data is necessary.  "
        ]
      }
    ]
  }
}