{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000000960a4"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000000960a4,b7d224f1-cefd-4ee7-bd5a-81b05ddeafd2,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encode Input Included in Output"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Encode Input Included in Output"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* PHP\r\n\r\n## What to Do ##\r\n\r\nEncode untrusted user data that is going to be included in HTML output. It is recommended to encode user data right before displaying it in HTML contexts. Another option is to encode user data when it is stored.\r\n\r\n## Why ##\r\n\r\nEncoding untrusted data before displaying it prevents Cross-Site Scripting vulnerabilities.\r\n\r\n## How ##\r\n\r\nTo encode PHP input included in output:\r\n\r\n1. **Identify all pages that display user entered data.** Enumerate all the pages used by the application. Make a list of all the pages that display data that comes from untrusted sources.\r\n2. **Identify all user input that is displayed in HTML contexts.** For each page that displays untrusted data, make a list of all untrusted data that is displayed and the context in which it is displayed. Most commonly, untrusted data is displayed as HTML. Other possibilities include displaying user input inside JavaScript or CSS.\r\n3. **Implement encoding functions for corresponding contexts.** PHP has a function for encoding HTML special characters, called `htmlspecialchars`. PHP does not have encoding functions for data being displayed inside JavaScript and CSS contexts. If your application displays data in contexts other than plain HTML, you will need to write your own encoding functions or use third-party ones. It is recommended to use a third-party encoding library, such as OWASP ESAPI.\r\n4. **Identify functions that display untrusted user data.** For each instance of untrusted data being displayed by your application, identify what function outputs that untrusted data. Make a list of these functions and note the code that is directly responsible for displaying untrusted data.\r\n5. **Add calls to encoding functions to functions that display untrusted data.** Add calls to encoding functions in a way that all untrusted data is encoded before being displayed. Make sure that output data is encoded correctly for its respective context.\r\n\r\n## Problem Example ##\r\n\r\nSimply rendering user data submitted as a post parameter is dangerous and will result in a reflected XSS vulnerability:\r\n\r\n\t<?php\r\n\techo $_REQUEST['data'];\r\n\t?>\t\r\n\r\n## Solution Example ##\r\n\r\nUse the htmlspecialchars() function to encode untrusted data before displaying it to prevent reflected XSS. Unfortunately, PHP has a limited built-in support for encoding functions, that essentially only support HTML and URL contexts. These are the two most common contexts, but it is a serious limitation that the developer has to be aware of. It is best to simply not include untrusted data in other contexts and that should be possible for most common applications.\r\n\r\n\t<?php\r\n\techo htmlspecialchars($_REQUEST['data']);\r\n\t?>\t\r\n\t\r\n## Additional Resources ##\r\n\r\n* For more information about `htmlspecialchars`, see [http://php.net/manual/en/function.htmlspecialchars.php](http://php.net/manual/en/function.htmlspecialchars.php)\r\n"
        ]
      }
    ]
  }
}