{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000016b3b2"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000016b3b2,0b3ddffc-d52b-43af-bcdb-09aeaa1495e9,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Scala Validate All Input Passed to the Database"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Code Example"
        ],
        "DirectLink": [
          "Validate All Input Passed to the Database"
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* Scala and Play Framework 2.1.0 \r\n* Database\r\n\r\n## Problem Example ##\r\n\r\nThe following code allows the user to query a database. Unfortunately, the application fails to validate the user's input. Therefore, an attacker can access the back-end database on behalf of the application through the use of SQL injection.\r\n\r\nFor example, say a MongoDB collection contains some documents that represent books, some that represent movies, and some that represent music albums. This JavaScript query function will select all the documents in the specified collection that were written, filmed, or recorded in the specified year:\r\n\r\nIf the developer were building this application using a given programming language, the source code might look like this:\r\n\r\n~~~~\r\n$query = 'function() {var search_year = \\'' .\r\n$_GET['year'] . '\\';' .\r\n'return this.publicationYear == search_year || ' .\r\n' this.filmingYear == search_year || ' .\r\n' this.recordingYear == search_year;}';\r\n$cursor = $collection->find(array('$where' => $query));\r\n~~~~\r\n\r\nThis code uses the value of the request parameter “year” as the search parameter. Just as in a traditional SQL injection attack, since the query syntax is being constructed in an ad-hoc fashion (i.e. query syntax concatenated along with user input), this code is vulnerable to a server-side JavaScript injection attack. For example, the following request would be an effective DoS attack against the system:\r\n\r\n~~~~\r\nhttp://server/app?year=1995';while(1);var%20foo='bar\r\n~~~~\r\n\r\n## Solution Example ##\r\n\r\nStrong input validation can be used to prevent SQL/NoSQL Injection attacks on an application. Prepared Statements must be used. Additionally, precompiled queries can also be used to prevent these attacks.\r\n\r\nCare should be taken while using precompiled queries to make sure that the internal queries do not contain dynamic content.\r\n\r\nBind parameters are the best way to pass data to the database. Instead of putting the values directly into the SQL statement, you just use a placeholder like ?, :name or @name and provide the actual values using a separate API call.\r\n\r\nBelow example shows a secure implementation of using Bind variable in Play Framework:\r\n\r\n~~~~\r\npublic static void searchString(String keyword) {\r\nString trimedkeyword = keyword.trim();\r\nString keypattern = \"%\"+trimedkeyword+\"%\";\r\nString query=\"select distinct item from Item where item.name like :keypattern\";\r\nList items = Item.find(query).bind(\"keypattern\", keypattern).fetch();\r\n...\r\n}\r\n~~~~\r\n\r\nPlay Framework supports “Anorm” to access database. According to the Play Framework source code here, Anorm builds only java.sql.PreparedStatements, which prevents SQL injection attack.\r\n\r\nBelow is an example of how Anorm can be used safely in Play Framework:\r\n\r\n~~~~\r\nobject Person {\r\ndef save(p:Person) {\r\nDB.withConnection (\"default\") { implicit connection =>\r\nSQL(\"\"\"\r\nINSERT INTO person(firstName,lastName)\r\nvalues ({firstName}, {lastName})\r\n\"\"\"\r\n).on(\r\n\"firstName\" -> p.firstName,\r\n\"lastName\" -> p.lastName\r\n).executeUpdate()\r\n}\r\n}\r\n}\r\n~~~~"
        ]
      }
    ]
  }
}