{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000003f9f92"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-0000003f9f92,598e5aba-cb44-4278-b5a5-cda7d688901e,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "External Commands Are Avoided"
        ],
        "Category": [
          "Dangerous APIs"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "External Commands Are Avoided"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET\r\n\r\n==What to Check For==\r\n\r\nVerify that calls to external commands are avoided as much as possible.\r\n\r\n==Why==\r\n\r\nApplications often use external commands to carry out some functionality. This helps programmers save time by having to write less code. Calling external commands is dangerous, as it creates the risk of introducing command injection vulnerabilities in your application. Command injection vulnerabilities allow attackers to execute external commands other than the ones intended by application. Most APIs used to execute external commands do not inherently provide protection against command injection. As a result, likelihood of introducing such vulnerability when calling external command is high. . It is recommended to avoid using external commands.\r\n\r\n==How to Check==\r\n\r\nTo verify that calls to external commands are avoided:\r\n\r\n# **Identify calls to external commands.** Search for the following APIs to find code that executes external commands: //AppCommandHandler.ExecuteCommand//, //System.Diagnostics.Process//.\r\n# **Identify all calls to external commands that include user input.** Narrow down the list of calls to external commands to those that include user data in parameters or, worse, specify the application to run. Pay particular attention to these calls, because they are extremely dangerous and error prone.\r\n# **Determine if calls to external commands can be replaced.** For each piece of code that executes external commands, consider if it can be replaced with code that does the same thing without external commands or whether this code can be removed altogether.\r\n\r\n==How to Fix==\r\n\r\nTo avoid using external commands:\r\n\r\n# **Identify calls to external commands.** Search for the following APIs to find code that executes external commands: //AppCommandHandler.ExecuteCommand//, //System.Diagnostics.Process//.\r\n# **Identify all calls to external commands that include user input.** Narrow down the list of calls to external commands to those that include user data in parameters or, worse, specify the application to run. \r\n# **Determine if calls to external commands can be replaced.** For each piece of code that executes external commands, consider if it can be replaced with code that does the same thing without external commands or whether this code can be removed altogether.\r\n# **Replace calls to external commands, if possible.** Rewrite each piece of code that executes external commands without calling external commands or remove such code altogether.\r\n\r\n"
        ]
      }
    ]
  }
}