{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-798027800",
      "Content_Hash": "-157355768"
    },
    "Metadata": [
      {
        "Id": [
          "03cb203d-a081-476b-87ac-84b81124f1b1"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Policy Requires Secure Media Destruction"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Policy Requires Secure Media Destruction"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 9.10 </li>\r\n    <li>PCI DSS Requirement 9.10.1.a </li>\r\n    <li>PCI DSS Requirement 9.10.1.b </li>\r\n    <li>PCI DSS Requirement 9.10.2</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Check that&amp;nbsp;a media destruction policy is defined and covers all media with cardholder data. Ensure that paper documents are destroyed in a way that provides reasonable assurance that the documents cannot be reconstructed. Verify that containers used to store\r\n media until it can be destroyed are physically secure.</p>\r\n  <h1>Why</h1>\r\n  <p>A media destruction policy should cover all media containing cardholder data to ensure that all such media is consistently destroyed. Paper documents should be thoroughly destroyed to prevent unauthorized information disclosure in the event that paper waste\r\n falls into the hands of an attacker. Containers used to store media until it can be destroyed should be secured to prevent an attacker from taking the media.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Review the media policy to verify that it covers destruction of all media containing cardholder data, including paper hard copies. Observe a paper document being destroyed to verify that it is destroyed in a way that ensures the document cannot be restored.\r\n Examine the containers used to store media until it can be destroyed to verify that the containers are secure.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Add a point to the media policy that requires all media containing cardholder data to be thoroughly destroyed, including paper hard copies. Acquire a shredder or incinerator for destroying paper hard copies or hire a company that specializes in media destruction.\r\n Acquire lockable trash bins to store sensitive hard-copy media before it is destroyed. Only place discarded sensitive hard-copy media in the lockable bins. Use the shredder or incinerator for destroying hard copies - do not throw them in the trash. Follow\r\n the instructions in the guideline article called \"Erase Files Securely\" to destroy physical media securely. It is sufficient to securely erase the files on digital storage media before discarding such media; however, it is recommended to physically destroy\r\n the digital storage media itself, using industrial equipment.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/ee48bbf8-53d9-4c4f-89db-2e94be25592e\">Formulate a Storage Media Policy</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/28ab3f5d-263e-4e1f-8c26-cef952f488f8\">Erase Files Securely</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}