{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-893061021",
      "Content_Hash": "2098210439"
    },
    "Metadata": [
      {
        "Id": [
          "072d0d9d-8bf6-43b1-b76e-d1eff103facd"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Lock Users Out After Six Failed Logon Attempts"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Lock Users Out After Six Failed Logon Attempts"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 8.5.13</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Lock user accounts if someone tries to guess passwords for them more than six times.</p>\n  <h1>Why</h1>\n  <p>Locking the terminal after repeated failed authentication attempts ensures that an attacker cannot guess the password in a timely manner.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to assure that user accounts are locked after six failed logon attempts:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Launch the \"Group Policy Management\" console. </strong>The \"Group Policy Management\" console is included in Windows 2008, but has to be downloaded and installed on Windows 2003 and 2000. The link to the download is available at the bottom of this\n page. To launch the \"Group Policy Management\" console, execute the \"gpmc.msc\" command.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Edit or create a Group Policy Object (GPO). </strong>To create and activate a new Group Policy Object (GPO), launch \"The Group Policy Management\" console, right click on the domain and select \"Create and Link a GPO Here.\" To edit an existing GPO,\n navigate to the \"Group Policy Objects\" folder under the current domain, right click on the GPO and select \"Edit\" - this will open the \"Group Policy Object Editor.\" To change the settings of a GPO using the \"Group Policy Object Editor, navigate the folders\n to find the setting of interest, double click on it, set the desired option(s).</p>\n    </li>\n    <li>\n      <p>\n        <strong>Enable the \"Account lockout threshold\" policy.</strong> The \"Account lockout threshold\" policy is located under \"Windows Settings\", \"Security Settings\", \"Account Policies\", “Account Lockout\", \"Account lockout threshold\". Set the \"Account lockout\n threshold\" setting to 6 failed attempts.</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about enforcing password policy in a Microsoft AD environment, please see \"Enforcing Strong Password Usage Throughout Your Organization\" at\n<a href=\"http://technet.microsoft.com/en-us/library/cc875814.aspx\">http://technet.microsoft.com/en-us/library/cc875814.aspx</a>.\n</li>\n    <li>To download the \"Group Policy Management Console,\" please see \"Group Policy Management Console with Service Pack 1\" at\n<a href=\"http://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887\">\nhttp://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887</a>.</li>\n  </ul>\n  <p />"
        ]
      }
    ]
  }
}