{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1574461588",
      "Content_Hash": "1445805268"
    },
    "Metadata": [
      {
        "Id": [
          "0c2b329e-f84e-4e5e-b416-1e2d53d1bdfe"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "File-integrity Monitoring Is Used"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "File-integrity Monitoring Is Used"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 11.5</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>File-integrity monitoring software should be used within the cardholder data environments.</p>\r\n  <h1>How to Check</h1>\r\n  <p>File-integrity monitoring may be included in the centralized log server solution, in the intrusion detection system, or in the intrusion prevention system. Identify which of these systems are deployed. Refer to the vendor's documentation or technical support\r\n of each deployed system&nbsp;for information about the file-integrity monitoring capabilities of their product. If these solutions do not provide file-monitoring capability, verify the existence of a file-integrity monitoring system by checking the logs at the\r\n centralized log server and asking the responsible staff to demonstrate the administration interface of the file-integrity monitoring solution. Verify that the locations of each of the following files are being monitored: system executables, application executables,\r\n configuration&nbsp;files,&nbsp;log files (the centralized log server should monitor its log files).</p>\r\n  <h1>How to Fix</h1>\r\n  <p>For any system that does not include file-integrity monitoring functionality, deploy a product that does. Configure the file-integrity monitoring software to watch the locations of the following files: system executables, application executables, configuration&nbsp;files,&nbsp;log\r\n files (the centralized log server should monitor its log files).</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>\r\n      <p>For information about TripWire, please see \"TripWire\" at <a href=\"http://www.tripwire.com/\">\r\nhttp://www.tripwire.com/</a>.</p>\r\n    </li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/47c3e227-0985-4a71-924b-2995fdb74aa3\">Deploy a File-integrity Monitoring Solution</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}