{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-2030010230",
      "Content_Hash": "2039055600"
    },
    "Metadata": [
      {
        "Id": [
          "101a5f93-cbae-4e29-804e-25a57b1011fa"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Formulate the User Authentication And Password Policies"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Formulate the User Authentication And Password Policies"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 8</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Formulate the PCI DSS compliant user authentication and password policies and attach them to the information security policy.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to formulate a PCI DSS compliant user authentication policy:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Require unique user IDs. </strong>Add a point that requires each authorized user&nbsp;to be assigned a unique user ID.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require user authentication. </strong>Add a point that requires all users to be authenticated before being granted access.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require two-factor authentication for remote access. </strong>Add a point that requires remote access to&nbsp;use two-factor authentication.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require passwords to be secured. </strong>Add a point that requires passwords to be encrypted or hashed when stored or sent.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require data access authorization. </strong>Add a point that requires access to be granted based on the access authorization forms. The access privileges should be explicitly stated by the authorization forms and implemented accordingly.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define password reset procedures. </strong>Add a point that requires user identity to be verified before performing a requested password reset. One way to verify the user's identity is by having a meeting in person between the user and the administrator\r\n performing the reset. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define handling of first-time passwords. </strong>Add a point that requires first-time passwords for new accounts to be unique and to be changed after first use.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define handling of terminated employee accounts. </strong>Add a point that requires the&nbsp;user account to be removed when an employee is terminated.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define handling of inactive accounts. </strong>Add a point that requires accounts that are not active for 90 days to be disabled or removed.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define handling of vendor remote access accounts. </strong>Add a point that requires accounts used by vendors for remote access to be disabled when not in use.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require user awareness of information security policies. </strong>Add a point that requires users to be familiar with user authentication and password policies and procedures. Users should know:</p>\r\n      <ul>\r\n        <li>How to have their password reset </li>\r\n        <li>How to change their password </li>\r\n        <li>How often they have to change their passwords </li>\r\n        <li>The password strength requirements</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Prohibit shared user accounts. </strong>Add a point that requires&nbsp;there to&nbsp;be no shared or generic IDs. Administrators should not create shared IDs, even if asked to.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require database authentication. </strong>Add a point that requires all database access to be authenticated. Other processes or individual users should not be able to use the authentication credentials used by any database application to access the\r\n database(s). </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require passwords to expire after 90 days. </strong>Add a point that requires passwords&nbsp;to be changed every 90 days.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define a password length requirement. </strong>Add a point that requires passwords&nbsp;to be at least 7 characters long.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define a password complexity requirement. </strong>Add a point that requires passwords to have both letters and numbers in them.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Forbid reusing previous passwords. </strong>Add a point that requires new passwords to not be the same as any of the four previous passwords for the same user.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require account lockouts. </strong>Add a point that requires&nbsp;user&nbsp;accounts to be locked after a maximum of six failed login attempts.&nbsp;</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define account lockout duration. </strong>Add a point that requires&nbsp;user&nbsp;accounts to be locked for at least 30 minutes or until an administrator unlocks it. It is acceptable for an administrator to unlock the account before the lockout time is over.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require idle session time-outs. </strong>Add a point that requires interactive sessions that are idle for 15 minutes to be locked automatically and require the user's password to unlock.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Update documentation.</strong> Attach the user authentication policy and the password policy to the information security policy. Instruct the responsible personnel to follow the stated policies. Implement the password policy by using Group Policy\r\n Objects in a Microsoft Active Directory environment. Please refer to the guidance article linked at the bottom of this page for more information about using GPOs to implement a PCI DSS compliant password policy.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/f604150f-8851-48bb-9537-2f08970dc3f5\">Implement the Password Policy Using Group Policy Objects</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/69a915e3-1b2a-4ec6-ab4f-57ee41255cf8\">Implement Two-factor Authentication for Remote Network Access</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}