{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1911011826",
      "Content_Hash": "1539813161"
    },
    "Metadata": [
      {
        "Id": [
          "13ddc313-d41b-426b-8e03-b03f936bd419"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Policy Requires Logs to Be Kept for at Least a Year"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Policy Requires Logs to Be Kept for at Least a Year"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 10.7</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that the information security policy requires all logs to be kept for at least a year. Check that at least the latest three months of logs are available for immediate review.\r\n</p>\r\n  <h1>How to Check</h1>\r\n  <p>Review the information security policy to verify that it includes a requirement for all logs in the PCI DSS scope to be kept for at least a year. Make sure the policy requires at least the latest three months of logs to be available for immediate review.\r\n Examine the centralized log server to verify that at least three months of logs are readily available and at least a year of logs is backed up.\r\n</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Add a point to the information security policy that requires all logs in the PCI DSS scope to be kept for at least a year. Configure the centralized log server to keep the logs for at least a year and to keep at least the latest three months of logs available\r\n for immediate review. The exact instructions for configuring a log server vary by solution. Please refer to vendor's documentation or technical support for more information about configuring your log server to retain the logs for at least a year. Most log\r\n servers will be able to make a year's worth of logs available for immediate review, thus satisfying both aspects of the PCI DSS log retention requirement.\r\n</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/7a956911-f547-4f65-88bb-f4a42ea349f3\">Implement Audit Trails for System Components</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}