{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "707464535",
      "Content_Hash": "1170263649"
    },
    "Metadata": [
      {
        "Id": [
          "19c8d409-b52c-44ac-b8d2-c668f32a5ec4"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Prepare the Network Documentation for PCI DSS Compliance"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Prepare the Network Documentation for PCI DSS Compliance"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 1.1</li>\n    <li>PCI DSS Requirement 1.1.1</li>\n    <li>PCI DSS Requirement 1.1.2</li>\n    <li>PCI DSS Requirement 1.1.2.a</li>\n    <li>PCI DSS Requirement 1.1.2.b</li>\n    <li>PCI DSS Requirement 1.1.3</li>\n    <li>PCI DSS Requirement 1.1.4</li>\n    <li>PCI DSS Requirement 1.1.5</li>\n    <li>PCI DSS Requirement 1.1.5.a</li>\n    <li>PCI DSS Requirement 1.1.5.b</li>\n    <li>PCI DSS Requirement 1.1.6</li>\n    <li>PCI DSS Requirement 1.1.6.a</li>\n    <li>PCI DSS Requirement 1.1.6.b</li>\n    <li>PCI DSS Requirement 1.3.5</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Document the network and prepare the documentation for PCI DSS compliance. PCI DSS refers to the network documentation as the \"firewall and router configuration standards.\"</p>\n  <h1>Why</h1>\n  <p>The network documentation is very important for designing and implementing information security procedures.&amp;nbsp;Because of&amp;nbsp;this, PCI requires the network documentation to include at least a functional minimum to achieve DSS compliance.</p>\n  <h1>When</h1>\n  <p>Ideally the network documentation should be prepared when the network infrastructure is being designed and&amp;nbsp;should be&amp;nbsp;updated whenever changes to the network are made.&amp;nbsp;What really matters is that the network documentation is available, current,&amp;nbsp;and includes\n relevant information.&amp;nbsp;The network documentation should be available to maintain PCI DSS compliance.</p>\n  <h1>How</h1>\n  <p>The network documentation is very important for network maintenance, security design and incident response tasks. Proper network documentation is required to achieve PCI DSS compliance. This guide will explain the minimum level of required documentation\n for PCI DSS compliance and is a good starting point for preparing documentation for your network. Once you have the required minimum, feel free to expand by including whatever information you think is important for network management and security tasks. While\n preparing the network documentation, it may be useful to have a copy of the company information security policy at hand to make suggestions for policy changes or to reflect the policy in the network documentation. Perform the following actions to prepare the\n network documentation for PCI DSS compliance:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Define&amp;nbsp;a formal testing process. </strong>The network documentation and the information security policy should include a formal testing process for any changes to the firewall and router settings. One way to test changes to the firewall configuration\n is by performing a detailed port scan of the host(s) protected by the firewall. One way to test changes to the router configuration is by using the ping and traceroute commands common to most network-capable operating systems.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Attach&amp;nbsp;a current network diagram. </strong>The network documentation should include an up-to-date network diagram, which shows all the network connections to the cardholder data, including any wireless connections. Acquire a proper diagramming tool.\n Microsoft Visio is perfectly usable for preparing a network diagram. Draw all network devices within the PCI DSS scope, especially those that store or transmit cardholder data. When all relevant network devices are mapped, draw the network connections between\n them, including any wireless connections. When the network devices and the connections between them are mapped, draw connections between them and external networks such as the Internet. To maintain the network diagram up-to-date, delegate the responsibility\n for maintaining the network documentation to a qualified staff member.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Add a requirement for&amp;nbsp;a firewall at each Internet connection and DMZ. </strong>\nThe network documentation should require a firewall at each Internet connection and between any DMZ and the internal network. This requirement can be satisfied by including a paragraph in the network documentation that states, \"A firewall should be installed\n at each Internet connection and between any DMZ and the internal network.\"&amp;nbsp;Start by installing firewalls at each Internet connection.&amp;nbsp;Install firewalls between each DMZ and the internal network.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Add descriptions of groups, roles, and&amp;nbsp;responsibilities. </strong>The network documentation should include the descriptions and responsibilities of network management roles. Designate network management roles, such as network administrators, systems\n administrators, and information security officers. Assign responsibilities to each network management role. Document the descriptions of network roles and their corresponding responsibilities.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Describe all protocols necessary for business.</strong> Identify all the protocols necessary for business. To identify the necessary protocols, it may be helpful to identify the network applications used by the business and include the corresponding\n protocols and ports used by the applications. A web search engine quickly yields typical ports and protocols used by most network applications. If custom port settings are used, which is a good practice to prevent automated attacks, the custom port settings\n should be documented.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify insecure protocols and explain why they are necessary. </strong>\nThe network documentation should include a list of all insecure network protocols and explanations of why each is necessary for business operations. Some common Internet protocols have been proven to be insecure, such as FTP, which sends authentication credentials\n in plain text. Some email protocols may also send authentication information in clear-text, which is often overlooked because email is such an integral part of many business environments. Security extensions are available for email protocols. Verify that each\n insecure service is necessary and cannot be easily replaced by a secure version, for example by replacing telnet with SSH. If possible, add security measures to each insecure service by using technologies such as VPN, white lists, or application-specific extensions.\n Make sure to document each insecure service thoroughly, including the nature of the vulnerability and the implemented mitigation measures.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Explicitly authorize the necessary outgoing connections from the cardholder data environment to the Internet.</strong>&amp;nbsp;Make a list of necessary outgoing connections from the carholder data environment. One example of important outgoing connections\n is downloading software updates. Specify local and remote hosts for each necessary outgoing connection. Specify local and remote ports for each necessary outgoing connection.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Document the firewall rule-set. </strong>The network documentation should include descriptions and explanations of the restrictions imposed by the firewalls. The firewalls should block all traffic that is not necessary for business operations. For\n each firewall, document the “deny” rules, including the \"deny all.\"</p>\n    </li>\n    <li>\n      <p>\n        <strong>Add a requirement to review firewall and router configurations at least every six months.\n</strong>The network documentation should include a requirement to review the firewall and router configurations at least every six months. To satisfy this requirement, the documentation may include a paragraph stating, \"The firewall and router configurations\n must be reviewed at least every six months.\" To make sure the review is performed, delegate responsibility for reviewing the router and firewall configurations to a qualified staff member.</p>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}