{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "2078444507",
      "Content_Hash": "-1954885213"
    },
    "Metadata": [
      {
        "Id": [
          "204c4dad-aa90-491f-ab60-c458edb07938"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Incident Response Plan Covers Unauthorized Wireless Devices"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Incident Response Plan Covers Unauthorized Wireless Devices"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 11.1.e </li>\r\n    <li>PCI DSS Requirement 12.9</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>The incident response plan should describe actions to take in the event of the discovery of unauthorized wireless devices.</p>\r\n  <h1>Why</h1>\r\n  <p>The presence of unauthorized wireless devices is a telltale sign of an attack. Wireless attacks are common, so it is recommended to have a plan ready to be able to coordinate a response in an efficient manner.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Examine the incident response plan in the security documentation to verify that it includes procedures for handling unauthorized wireless devices detected on the company network. Procedures may involve alerting the staff, deploying additional technology\r\n to locate any unauthorized wireless devices, shutting down the wireless network, and changing wireless access keys.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Decide the actions to take in the event of an unauthorized wireless device being detected on the company network. In the event of detecting an unauthorized wireless device, it is recommended to alert the staff, send personnel to look for the unauthorized\r\n wireless device (wireless devices have limited range, so it may be possible to physically locate the device), shut down the wireless network, change the wireless access keys after the staff has finished searching for the device, whether they find it or not.\r\n Express this action plan in writing and attach it as a point to the incident response plan in the security documentation.</p>"
        ]
      }
    ]
  }
}