{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1732632262",
      "Content_Hash": "1634629724"
    },
    "Metadata": [
      {
        "Id": [
          "235a3603-c797-46b2-92f3-5a35dfeafe5c"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Define Badge Management Procedures"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Define Badge Management Procedures"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 9.2 </li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Manage identification badges in compliance with PCI DSS.</p>\n  <h1>Why</h1>\n  <p>Badge management processes should be in place because new badges may be needed quickly for visitors or new employees, badge information may need to be changed, and old badges may need to be revoked. Access to the badge management system should be limited\n to prevent employees from tampering with their access privileges. The employee badges and the visitor badges should be different to prevent visitors from impersonating employees to gain unauthorized access.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to manage badges in compliance with PCI DSS:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Deploy a badge-management system.</strong> Acquire a badge management system. A badge management system typically includes badge-readers, a badge-issuing device, and a badge-management application. Deploy the badge management system by following\n the vendor's instructions. Limit access to the badge management system. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Secure the badge-management system.</strong> Most badge-management interfaces implement access control. Implement software access control by following the vendor's instructions. It may also be a good idea to physically secure the computer, which\n has the badge-management application installed, and the badge-issuing equipment, by locking them in a separate room. Allow only authorized personnel to access the badge-management application and badge-issuing equipment.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Design badges.</strong> Design at least two types of badges that are easily distinguishable at a distance. One will be issued to visitors and the other will be used by employees.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Issue badges.</strong> Issue badges to visitors when their access is authorized. Instruct visitors to display their badges prominently when inside the facility. Ask visitors to surrender their badges when they are leaving the facility.</p>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}