{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-735306620",
      "Content_Hash": "-1927100544"
    },
    "Metadata": [
      {
        "Id": [
          "26a36eea-426d-4891-ac46-fd07719b0a64"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "An Employee Security Awareness Program Is Conducted Properly"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "An Employee Security Awareness Program Is Conducted Properly"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 12.6 </li>\r\n    <li>PCI DSS Requirement 12.6.a </li>\r\n    <li>PCI DSS Requirement 12.6.b </li>\r\n    <li>PCI DSS Requirement 12.6.1 </li>\r\n    <li>PCI DSS Requirement 12.6.1.a </li>\r\n    <li>PCI DSS Requirement 12.6.1.b </li>\r\n    <li>PCI DSS Requirement 12.6.2</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>An employee security awareness program should be conducted.</p>\r\n  <h1>Why</h1>\r\n  <p>An employee security awareness program increases staff participation in maintaining a secure computing environment.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Make sure the employee security awareness program is conducted in compliance with PCI DSS by using the following steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify program existence. </strong>Verify that a security awareness program exists and is available to all employees by examining the documentation of the program.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Examine security awareness training materials.</strong> Verify that the security awareness program uses multiple communications media such as posters, letters, web sites, meetings, etc. by examining the program materials.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Examine records of security awareness training.</strong> Verify that all employees engage in security awareness training upon hire and at least once a year after that by interviewing a random sample of employees and examining records of conducted\r\n training. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check employee acknowledgement forms. </strong>Examine the information security documentation for the presence of a signed form for each employee that states that the employee has attended an information security awareness session and understands\r\n the company information security policy. </p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Establish and conduct a security awareness program by performing the following tasks:</p>\r\n  <ol>\r\n    <li>\r\n      <strong>Establish a security awareness training program.</strong> Delegate responsibility for the program to a qualified staff member. Develop training materials. Designate staff responsible for training. Schedule yearly training sessions. Train new employees\r\n upon hire. Make a spreadsheet with a list of all employees and the date of their most recent security awareness training to make sure all employees participate. Manage a portfolio of security training materials. Have the person responsible for training produce\r\n or procure these materials.&amp;nbsp; These materials should be in multiple formats such as presentations, letters, posters, videos, etc.</li>\r\n    <li>\r\n      <p>\r\n        <strong>Prepare employee acknowledgement forms.</strong> Prepare a form that states that the employee who signed understands the information security policy. Print this form and make it available during each training session. After each training session\r\n hand it out to the employees to sign. Collect the signed forms and attach them to the information security documentation. Discard the older sign-off forms if you have more than one for an employee.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Document the security training program.</strong> Keep records of conducted training. Keep the signed acknowledgment forms. Schedule presentations and/or annual training sessions. Maintain a spreadsheet of the most recent security awareness training\r\n for each employee.</p>\r\n      <ul>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/c153c8ea-f713-486d-8485-4bbbd0209ebf\">Manage a Formal Security Awareness Program</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}