{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "550081939",
      "Content_Hash": "-778270140"
    },
    "Metadata": [
      {
        "Id": [
          "27ed79ec-b692-4935-abce-0f2efac583b7"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Wireless Keys Are Changed When an Employee Leaves"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Wireless Keys Are Changed When an Employee Leaves"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 2.1.1.a</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Check that the wireless access keys are changed whenever an employee that has had access to the keys leaves the company. Verify that the information security policy states the requirement to change the keys when an employee that has had access to them leaves\r\n the company.</p>\r\n  <h1>Why</h1>\r\n  <p>Wireless keys should be changed when an employee leaves to prevent insider attacks or the former employee disclosing the key to a potential attacker.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Examine the information security policy to make sure it includes a requirement to change the wireless keys whenever an employee who has had access to the keys leaves the company. Interview the staff member(s) responsible for the security of the wireless\r\n network to make sure that the keys are changed when an employee leaves the company.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Add a statement to the information security policy that requires the wireless access keys to be changed whenever an employee that has had access to the keys leaves the company. If an employee that has had access to the wireless keys has left, change the\r\n wireless access keys.</p>"
        ]
      }
    ]
  }
}