{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1809032573",
      "Content_Hash": "1708895836"
    },
    "Metadata": [
      {
        "Id": [
          "2aae5ac3-e274-4cdf-a62c-67a75b3e8723"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Define a Media Distribution Policy"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Define a Media Distribution Policy"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 9.7 </li>\r\n    <li>PCI DSS Requirement 9.7.1 </li>\r\n    <li>PCI DSS Requirement 9.7.2</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Define a media distribution policy in accordance with PCI DSS. Classify sensitive media as \"confidential\". Log media distribution. Send sensitive media via secured courier or any other delivery method that can be tracked.</p>\r\n  <h1>Why</h1>\r\n  <p>A media distribution policy should be defined to facilitate the making of decisions in a timely and secure manner when media has to be distributed. The policy should cover all types of media storage to ensure that the policy provides adequate guidance for\r\n all likely situations. Sensitive media should be classified to make it clear to the recipient that it should not be disclosed. Media distribution should be logged to help audit media distribution events if needed. Media should be sent via secured courier or\r\n any other delivery method that can be tracked to assure that the media reaches its recipient, to assist with locating it if it is somehow lost, and to have greater control of the delivery process by being able to monitor it and make calls.</p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps to update policy with secure media distribution requirements:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify media distribution requirements.</strong> Identify the possible scenarios which would require media containing sensitive information to be distributed, for example, an external audit.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Document media distribution procedures.</strong> Write down the correct procedures for handling each scenario and add them to the media policy.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Update the policy. </strong>Update the information security policy with the media distribution requirements. Add a point to the media policy that requires sensitive media to be classified as \"confidential.\" Add a point to the media policy that requires\r\n keeping a log of distributed media. Add a point to the media policy that requires sending sensitive media via secured courier or some other shipping method that can be tracked. Attach the media policy to the information security policy.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Keep a log.</strong> Start a log of distributed media that includes the following information: the name of the person authorizing distribution, the name of the intended recipient, the contents of the media, the date, and any other relevant information.\r\n Attach the media distribution log to the network documentation. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Comply with the policy.</strong> Follow the media distribution policy when distributing sensitive media.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}