{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "257856122",
      "Content_Hash": "-451212756"
    },
    "Metadata": [
      {
        "Id": [
          "2ee98216-fc7c-4598-816b-7c470d747346"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Review Web Applications"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Review Web Applications"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 6.6</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Review public-facing web applications regularly.</p>\r\n  <h1>Why</h1>\r\n  <p>Reviewing public-facing web applications may help discover and fix vulnerabilities before they are discovered and exploited by attackers.</p>\r\n  <h1>When</h1>\r\n  <p>Public-facing web applications should be reviewed at least annually and after any changes if a web application firewall is not deployed.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following tasks to review public-facing web applications in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Choose a team to conduct the web application security review. </strong>\r\nHave an organization or department that specializes in application security perform the review. If you have an in-house department that specializes in application security, then it is natural to assign this duty to them. Most likely, though, you will need to\r\n look for an outside company to do the review. <em>Security Innovation specializes in application security and can assist your company with reviewing your web application(s) for PCI DSS compliance.</em></p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Fix discovered vulnerabilities.</strong> Correct all discovered vulnerabilities. The organization that does the review should provide guidance on fixing any discovered vulnerabilities. Fix all the discovered vulnerabilities and document the changes\r\n in accordance with&amp;nbsp;the change-control procedures. </p>\r\n    </li>\r\n    <li>\r\n      <strong>Re-evaluate the web application after any corrections.</strong>\r\n      <span>\r\nIf any vulnerabilities are found and fixed, re-evaluate the application by having the selected organization or department that specializes in application security review it again.</span>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>\r\n      <p>For a list of software review services offered by Security Innovation, please see&amp;nbsp;\"Security Services Overview\" at\r\n<a href=\"http://securityinnovation.com/services/index.shtml\">http://securityinnovation.com/services/index.shtml</a>.</p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}