{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "772821689",
      "Content_Hash": "2077850915"
    },
    "Metadata": [
      {
        "Id": [
          "34bdf8c4-7bdb-4d60-88be-8c969b825242"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Administrator Actions Should Be Logged"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Administrator Actions Should Be Logged"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 10.2.2</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Actions performed by a user with root or administrator privileges should be logged.</p>\r\n  <h1>Why</h1>\r\n  <p>All actions performed by an administrator or another privileged user should be logged to assist with investigations in the event of a compromise or some other situation.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Interview the person who is responsible for reviewing the logs to verify that there is a solution in place that records all actions taken by users with Administrator privileges on Windows systems. Windows does not have built-in facilities for this, so the\r\n solution should be in the form of a third-party product. Examine the logs produced by the user-monitoring solution to verify that they are current and provide a sufficient level of detail.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Logging administrator actions on Windows is difficult, because the Windows interface is mostly graphical. There is no built-in functionality in Windows that allows recording Administrator activity to the extent required by PCI DSS. The functionality for\r\n satisfying Requirement 10.2.2 should be implemented by your centralized log server solution. Please refer to the vendor's documentation or technical support for more information about the capabilities of the product. Install and configure your Administrator\r\n logging solution of choice by following the vendor's directions.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/7a956911-f547-4f65-88bb-f4a42ea349f3\">Implement Audit Trails for System Components</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}