{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1582508689",
      "Content_Hash": "1873833990"
    },
    "Metadata": [
      {
        "Id": [
          "381fb020-ca2f-4374-8086-ad46d468ffa1"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "A Wireless Analyzer Is Used Regularly"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "A Wireless Analyzer Is Used Regularly"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* PCI DSS Requirement 11.1\r\n\r\n\r\n## What to Check For ##\r\n\r\nA wireless analyzer should be used at least quarterly to identify all wireless devices in use, or a wireless IDS/IPS should be implemented.\r\n\r\n\r\n## Why ##\r\n\r\nA wireless analyzer can detect unauthorized wireless devices on the network. Detecting such devices clearly indicate the presence of an attack.\r\n\r\n\r\n## How to Check ##\r\n\r\nInterview the responsible staff to verify that a wireless analyzer is used to identify all wireless devices at least quarterly. Ask them to demonstrate the wireless analyzer that is used.\r\n\r\n\r\n## How to Fix ##\r\n\r\nAcquire a wireless analyzer. Train a staff member to use it by having them read the vendor's documentation and practice using the analyzer. Use of the analyzer varies by vendor, but detecting all active devices should not be difficult, and the technical support should be able to assist with this task if necessary. Schedule the dates for the quarterly scans. Have the trained staff member scan for all active wireless network devices with the analyzer and document the results. Compare the results of the scan to the list of authorized wireless network devices in the network documentation. If an unauthorized device is detected, alert the responsible staff and execute the incident response plan."
        ]
      }
    ]
  }
}