{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-594588070",
      "Content_Hash": "1678009726"
    },
    "Metadata": [
      {
        "Id": [
          "47c3e227-0985-4a71-924b-2995fdb74aa3"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Deploy a File-integrity Monitoring Solution"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Deploy a File-integrity Monitoring Solution"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 11.5</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Deploy a file-integrity monitoring solution.</p>\n  <h1>Why</h1>\n  <p>A file-integrity monitoring solution may be able to detect a compromise and prevent an attacker from gaining a foothold on the company network.</p>\n  <h1>How</h1>\n  <p>Use the following steps to deploy a file-integrity monitoring solution:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Establish&amp;nbsp;file-integrity monitoring capabilities. </strong>File-integrity monitoring may be included in the centralized log server solution, in the intrusion detection system, or in the intrusion prevention system. Identify the vendors of each of\n these systems that are deployed.&amp;nbsp;Refer to the vendor's documentation or technical support for information about the file-integrity monitoring capabilities of their product and configuring them. If these solutions do not provide file-integrity monitoring functionality,\n deploy a product that does.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Setup file-integrity monitoring.</strong> Configure the file-integrity monitoring software to watch system executables, application executables, configuration files, and log files</p>\n    </li>\n    <li>\n      <p>\n        <strong>Integrate the file-integrity monitoring solution with the centralized log server.</strong> Ideally, the file-integrity monitoring solution should be compatible with your log server. Refer to vendor's documentation for information about integrating\n your file-integrity monitoring solution with your log server.</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For information about TripWire, please see \"Tripwire, Inc\" at <a href=\"http://www.tripwire.com/\">\nhttp://www.tripwire.com/</a>.</li>\n  </ul>"
        ]
      }
    ]
  }
}