{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1310003836",
      "Content_Hash": "-235636536"
    },
    "Metadata": [
      {
        "Id": [
          "4a758f7a-7d1d-4c2e-9fb5-04e1e43db169"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Default Usernames And Passwords Are Not Used"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Default Usernames And Passwords Are Not Used"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 2.1</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Network devices should not be using the manufacturer's default usernames and passwords for administration.</p>\r\n  <h1>Why</h1>\r\n  <p>The default usernames and passwords for network devices are publicly available. An attacker may be able to use the default authentication credentials to change the configurations of the network devices to an insecure state. This vulnerability is especially\r\n relevant to potential insider attacks.</p>\r\n  <h1>How to Check</h1>\r\n  <p>For each network device, obtain the default administrator username and password by using the Internet or the vendor's documentation. Try to log in to each device using the default administrator credentials.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>If it is possible to log in to a network device using the default administrator credentials, then change the password&amp;nbsp;and change the username of the administrator account, if possible. The exact procedure for changing the administrator username and/or password\r\n varies by device. For detailed instructions on changing the username and password on your hardware, please refer to the vendor's documentation or contact technical support.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/b3096d5e-1147-4919-9e09-c7675a19df37\">Change System Default Settings on Network Devices.</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}