{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-143417194",
      "Content_Hash": "1082970542"
    },
    "Metadata": [
      {
        "Id": [
          "4f3287a7-aafd-4d85-8387-ec24e2bdd656"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encrypt Remote Administrator Access"
        ],
        "Category": [
          "Networking"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Encrypt Remote Administrator Access"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Use an encryption tunnel to secure remote administrator access.</p>\r\n  <h1>Why</h1>\r\n  <p>Encrypting remote administrative access makes sure that a potential attacker cannot get administrative authentication credentials or other information about the network by eavesdropping.</p>\r\n  <h1>When</h1>\r\n  <p>An encryption tunnel should be installed and configured when setting up remote administrator access.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following tasks to assure that remote administrator access is encrypted:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Use&amp;nbsp;an encryption tunnel for interactive remote administration. </strong>\r\nThere are basically two options for encrypting interactive remote administration: VPN and SSH. VPN is the more versatile and practical option. VPN is recommended for most applications. VPN and SSH may be used in parallel.\r\n</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>VPN</strong> is a general purpose, encrypted IP tunnel. There are many different VPN implementations, offering various degrees of security. Microsoft Windows Operating Systems have built-in PPTP VPN functionality. Many routers and firewalls also\r\n have built-in VPN functionality. The exact procedure for implementing VPN varies by configuration. VPN is recommended for remote administration using remote desktop (RDP) or other visual administration protocols (VNC).\r\n</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>SSH</strong> works best for UNIX-style systems when only a command-line interface to a single system is necessary. SSH may be used for backup tasks on the web server in the DMZ, for example. While general purpose SSH tunnels are possible, they offer\r\n no advantage over VPN and should be avoided because of maintenance overhead. Because of its inherent limitations, SSH is not likely to be sufficient to accommodate the needs of anything but the smallest businesses. Using SSH is recommended for remote administration\r\n of UNIX-style systems in the DMZ, but for all other interactive remote administration, VPN is recommended.\r\n</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Disable insecure remote&amp;nbsp;administration services on the internal network.\r\n</strong>Insecure remote command services are old UNIX-style services that used plain-text authentication, including telnet, rcp, rexec, etc. They really have no place in a modern, secure, computing environment. Most modern systems don't have them installed\r\n or running by default, although some Linux distributions might still have telnet enabled. These services should not be installed, and if they have been somehow installed, they should be disabled and/or removed.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use&amp;nbsp;TLS for&amp;nbsp;web-based remote administration. </strong>TLS is recommended for encrypting web-based remote administration. To use TLS for encrypting a remote web administration session, the server hosting the web administration interface should be using TLS.\r\n Configuring TLS on a web server varies by server, so you will need to refer to the vendor's manual or technical support for detailed instructions for implementing TLS on your web server. TLS will be enabled by default for many web administration\r\n interfaces. If TLS is not implemented, the procedure to implement it may be complex. In that case, it may be possible to use VPN instead. The key to securely using VPN instead of TLS is to make the web administration interface available only through\r\n the VPN and not over the Internet.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>\r\n      <p>For information on setting up Virtual Private Networks in a Windows environment, please see \"Virtual Private Networks\" at\r\n<a href=\"http://technet.microsoft.com/en-us/network/bb545442.aspx\">http://technet.microsoft.com/en-us/network/bb545442.aspx</a>.</p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}