{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-411253373",
      "Content_Hash": "1072049091"
    },
    "Metadata": [
      {
        "Id": [
          "4f4b41ef-7b23-4de6-837d-5d052c328432"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Define Daily Security Operational Procedures"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Define Daily Security Operational Procedures"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 12.2 </li>\r\n    <li>PCI DSS Requirement 12.2.a</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Define daily information security operational procedures.</p>\r\n  <h1>Why</h1>\r\n  <p>Daily procedures should be clearly defined so that people can carry them out consistently and in a timely fashion.</p>\r\n  <h1>How</h1>\r\n  <p>Define daily operational security procedures and include the documentation in the information security documentation. The exact definitions and procedures will be specific to your company, and not all PCI DSS requirements dictate daily procedures. Use the\r\n following steps to define the daily operational procedures:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures&amp;nbsp;for updating&amp;nbsp;the anti-virus. </strong>The anti-virus should be updated on a daily basis. Most commercial anti-viruses can update themselves automatically from the Internet, but the cardholder data environment should not have direct\r\n Internet access, so updating the anti-virus in it may be a manual task that needs to be performed daily. Describe the procedures for updating the anti-virus.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures&amp;nbsp;for updating software. </strong>Software should be updated regularly. PCI DSS specifies that it is acceptable to update software within a month of a critical patch being released, but it is recommended to apply vendor security patches\r\n as soon as possible. Since computers in the cardholder data environment should not have direct Internet access, updating them may be a manual task that needs to be performed regularly. Describe the procedures for updating software.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to identify new vulnerabilities.&amp;nbsp;</strong>New vulnerabilities are discovered daily, which makes it necessary to track new vulnerabilities daily. Describe the procedures for checking Internet resources for information about new vulnerabilities.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to manage physical access. </strong>All physical entrances and exits should be monitored using video surveillance cameras. Someone should review the footage daily, ideally in real-time. Describe the procedures for monitoring and\r\n reviewing the video surveillance footage. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to secure logs. </strong>Logs should be backed up to a secure location daily. Ideally, logs should be sent to the centralized log server in real time. Describe the procedures for backing up logs, if needed.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to review Logs. </strong>Logs should be reviewed daily. Someone should be monitoring the log server for signs of unauthorized activity at any time. Describe the procedures for monitoring and reviewing logs, including any not sent\r\n to the centralized log server. Ideally, logs should be sent to the centralized log server in real time, including logs for:\r\n</p>\r\n      <ul>\r\n        <li>A wireless IDS or IPS used to monitor the airwaves for unauthorized wireless devices. Ideally, the IDS/IPS should send alerts to the centralized log server.\r\n</li>\r\n        <li>File-integrity monitoring system. Ideally, the file-integrity monitoring system should send alerts to the centralized log server.\r\n</li>\r\n        <li>If a web application firewall is deployed, it should send alerts of suspected attacks to the centralized log server.\r\n</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define the incident response plan. </strong>The incident response team should provide 24/7 monitoring of logs and response capabilities. The tasks for managing this should be defined as a part of the incident response plan and may also be included\r\n in the daily operational procedures.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define the key management procedures. </strong>Key management procedures involve generation and distribution of secure encryption keys. Describe the procedures for generating and distributing encryption keys.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define user management procedures.</strong> The following user management tasks may need to be performed any day:\r\n</p>\r\n      <ul>\r\n        <li>Users should be assigned unique user IDs. Describe the procedures for creating new user IDs.\r\n</li>\r\n        <li>Describe the procedures for assigning new passwords and resetting passwords when requested.\r\n</li>\r\n        <li>Describe the procedures for additions, deletions and modifications of user accounts.\r\n</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Define procedures to handle visitors.</strong> The following procedures for handling visitors may have to be performed any day when there are visitors:\r\n<ul><li>Visitors should be escorted when inside the facility. Describe the procedures for escorting visitors.\r\n</li><li>Visitors may need to be issued special badges that distinguish them from employees and authorize their access. Describe the procedures for issuing visitor badges.\r\n</li><li>Visitors should be logged when entering and exiting the facility. Describe the procedures for logging visitors.\r\n</li></ul></li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures for managing media containing sensitive data.</strong> The following storage media management tasks may need to be performed any day:</p>\r\n      <ul>\r\n        <li>Media containing sensitive information should be labeled as \"confidential,\" logged, and management should authorize the transfer. Describe the procedures for labeling, logging, and authorizing the transfer of media containing sensitive information.\r\n</li>\r\n        <li>Media containing sensitive information should be sent by secure courier, tracked when outside the facility ,and management should authorize the transfer. Describe the procedures for acquiring management authorization for transferring media containing sensitive\r\n data. </li>\r\n        <li>Media containing cardholder data should be destroyed once it is no longer needed for business or legal reasons. This includes hardcopy materials and digital media.\r\n</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to perform background checks. </strong>Background checks should be performed on new employees. Describe the procedures for performing background checks on new employees.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to&amp;nbsp;educate staff on security policies. </strong>New employees should be trained on the company security policies and practices upon hire, and all employees should undergo a review of these policies and practices at least annually.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define procedures to manage service providers. </strong>The PCI DSS compliance status of contracted service providers should be monitored.</p>\r\n    </li>\r\n  </ol>\r\n  <p>More information about defining these procedures may be found in respective TeamMentor PCI DSS articles.</p>"
        ]
      }
    ]
  }
}