{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-572511161",
      "Content_Hash": "1494443218"
    },
    "Metadata": [
      {
        "Id": [
          "524359f0-e51a-4280-998b-cd2171d31918"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Implement Change Control Procedures"
        ],
        "Category": [
          "Development"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Implement Change Control Procedures"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 6.4</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Test and document all changes, including updates, made to software code and applications.</p>\r\n  <h1>Why</h1>\r\n  <p>Testing helps ensure that patches do not introduce new vulnerabilities or break functionality. Changes should be documented to help find the cause of a vulnerability if one is introduced by the changes.</p>\r\n  <h1>When</h1>\r\n  <p>All changes to software code, including patches, should be tested and documented before being deployed.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to implement change control procedures in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <strong>Test all changes. </strong>Do not use production data for testing, especially live PANs. Test all changes, including updates and significant configuration changes. Set up a test environment to closely simulate the production environment. Test all\r\n changes for the following:\r\n<ul><li>Validation of all input </li><li>Validation of error handling </li><li>Validation of secure cryptographic storage </li><li>Validation of secure communications </li><li>Validation of proper role-based access control</li></ul></li>\r\n    <li>\r\n      <p>\r\n        <strong>Define change-control procedures. </strong>PCI DSS requires following change control procedures for all changes to system components. These procedures may be stated explicitly in a separate document or included in the information security policy.\r\n The procedures are the ones described in this article and include documentation of impact, management sign-off, functionality testing and back-out procedures.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Designate a testing environment. </strong>Design a simulated&nbsp;test environment that uses hardware and software similar to that used in the production environment. If possible, set up the test environment like a scaled-down version of the production\r\n environment. Identify the components of the production environment that will be affected by the change being tested. Install and configure hardware and software similar to the affected components in the test environment. Install and review changes in the test\r\n environment before deploying them in the production environment. Staff working in the production environment should not be working in the test environment</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Include customer impact considerations. </strong>While testing changes, consider and document the possible customer impact of each change. Things to consider are the effect the change would have on the user experience and the functionality that may\r\n be added or removed. Attach the customer impact considerations to the change-control documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Require a management sign-off. </strong>The management should sign off on each change before it is deployed. The signed documents should be included in the change-control documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Document the test results. </strong>The objective of testing is to make sure that the change to the code produces only the desirable behavior. The results of how well the code changes have achieved these objectives&nbsp;should be noted. These results\r\n should be included in the change-control documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define back-out procedures. </strong>Design and document back-out procedures for each change. Include the descriptions of the back-out procedures in the change-control documentation. Typically, the back-out procedures should describe how to uninstall\r\n the patch or how to reinstall the earlier, stable version of the software.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}