{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-822284338",
      "Content_Hash": "1957781013"
    },
    "Metadata": [
      {
        "Id": [
          "5e1355fd-05bf-46fb-a3e9-4aeb4a900c42"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Development And Production Environments Are Separate"
        ],
        "Category": [
          "Development"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Development And Production Environments Are Separate"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 6.3</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>The development and the production environments should be separated by access control and staff assignments.</p>\r\n  <h1>Why</h1>\r\n  <p>Keeping the development and the production environments separate ensures that vulnerabilities that may be found during development will be fixed before the application enters production.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Interview the development staff to verify that the development and production environments are separate. Interview the staff assigned to the development environment to make sure their environment is separate from the production environment. Interview the\r\n staff assigned to the production environment to make sure that their environment is separate from the development environment. Examine the actual production and development environments to make sure they are separate.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>If a development environment does not exist already, create it. If a development environment has been a part of the production environment, remove all development elements from the production environment. The development staff should be separate from the\r\n people working in the production environment. The personnel working in the production environment should not be concerned with development tasks.</p>"
        ]
      }
    ]
  }
}