{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "194749120",
      "Content_Hash": "680833240"
    },
    "Metadata": [
      {
        "Id": [
          "5e9d3a71-27fb-4751-9740-34af3ed05295"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Vulnerability Scans Are Documented"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Vulnerability Scans Are Documented"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 11.2</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>Vulnerability scans should be documented.</p>\n  <h1>Why</h1>\n  <p>Vulnerability scans should be documented to prove that they took place and to show what vulnerabilities may have already been found and fixed.</p>\n  <h1>How to Check</h1>\n  <p>Perform the following steps to verify that vulnerability scans are documented in compliance with PCI DSS:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Verify that vulnerability scans have been documented.</strong> Examine the security documentation to verify that it includes the results of the previous vulnerability scans.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that scans have been performed regularly.</strong> Inspect documentation to verify that scans&amp;nbsp;have been&amp;nbsp;performed after changes to the network. It is acceptable to perform an internal scan after network changes. An internal scan is typically\n less expensive than an external scan. The scan results include rescans until no more serious vulnerabilities are found.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that a qualified scanning vendor has performed quarterly scans.</strong> An Approved Scanning Vendor (ASV) should perform the mandatory quarterly scans. Review documentation to verify that an ASV has performed the quarterly scans.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that vulnerabilities have been fixed.&amp;nbsp;</strong>If vulnerabilities are found during scanning, they should be fixed and the scan should be repeated. The final results of the scan should not include any serious vulnerabilities. Review documentation\n to make sure that all found vulnerabilities have been fixed.</p>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Use the following steps to assure that vulnerability scans are performed and documented in compliance with PCI DSS:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Conduct vulnerability scans.</strong> Schedule quarterly internal and external vulnerability scans. Perform&amp;nbsp;the vulnerability scans. If&amp;nbsp;a scan is being performed as a result of network changes, it is acceptable to have qualified internal staff perform\n the scan.Required quarterly scans should be performed by a PCI DSS qualified ASV. It may be prudent to conduct a preliminary internal test with the available resources to eliminate the most obvious vulnerabilities, if any, before the ASV comes in.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Fix detected vulnerabilities.</strong> If vulnerabilities are found, fix them and perform the scan again. Repeat scanning and fixing vulnerabilities until the scan returns acceptable results.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Update documentation.</strong> Record the results. Attach them to the security documentation.\n</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>\n      <p>For a list of PCI DSS qualified ASVs, please see \"Approved Scanning Vendors\" at\n<a href=\"https://www.pcisecuritystandards.org/pdfs/asv_report.html\">https://www.pcisecuritystandards.org/pdfs/asv_report.html</a>.</p>\n    </li>\n  </ul>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/77ba62e2-8d03-4d84-b7dc-2a34f718d994\">Perform Network Vulnerability Scans</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}