{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-2026844618",
      "Content_Hash": "75990558"
    },
    "Metadata": [
      {
        "Id": [
          "64aec92b-cad9-41e9-81a4-c984aa2a8099"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Penetration Tests Are Documented"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Penetration Tests Are Documented"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 11.3</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Penetration tests should be documented.</p>\r\n  <h1>Why</h1>\r\n  <p>Penetration tests should be documented to prove that they took place and to show what vulnerabilities may have already been found and fixed.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to verify that penetration tests are performed and documented in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify the qualifications of the penetration testing team. </strong>Identify the penetration testing party and verify that their credentials qualify them for the task.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that a penetration test has been performed within&nbsp;a year.</strong> Check the results of the last penetration test in the security documentation to make sure that at least one has been performed in the past year.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Confirm that penetration tests included network and application layer tests.</strong> Examine the results of the previous penetration test to make sure it includes network layer attacks, which include both operating system and network protocol attacks.\r\n Examine the results of the previous penetration test to make sure it includes application layer attacks. The application layer attacks may include attacks on client applications. For web applications, the penetration tests should include the attacks in the\r\n OWASP Top 10.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Confirm that all discovered vulnerabilities have been fixed.</strong> Review documentation for information about discovered vulnerabilities and steps taken to eliminate them.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to assure that penetration tests are performed and documented in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Choose a penetration testing team.</strong> Qualified professionals should perform penetration testing. It is acceptable to have the company staff perform the test if internal talent is readily available, but it is recommended to leave it to companies\r\n who specialize in security services. Security Innovation offers penetration-testing services.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Perform&nbsp;penetration tests.</strong>&nbsp;Schedule yearly penetration tests. Perform network layer attacks, which include operating system and network protocol attacks. Perform application layer attacks. For web applications, have them tested for all the\r\n vulnerability types in the OWASP Top 10.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Document fixed vulnerabilities.</strong> If vulnerabilities are found, fix them and perform another penetration test.&nbsp;Document all fixed vulnerabilities.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Document&nbsp;the repeated&nbsp;tests. </strong>Continue testing until no more vulnerabilities are found. Document the results of each test.&nbsp;</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/c2328961-f3ed-4db8-baa1-d58406947cf5\">Perform Penetration Tests</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}