{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-973444423",
      "Content_Hash": "475623037"
    },
    "Metadata": [
      {
        "Id": [
          "69a915e3-1b2a-4ec6-ab4f-57ee41255cf8"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Implement Two-factor Authentication for Remote Network Access"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Implement Two-factor Authentication for Remote Network Access"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 8.3</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Implement a two-factor authentication system for remote network access.</p>\n  <h1>Why</h1>\n  <p>Two-factor authentication ensures that an attacker cannot use compromised credentials to access the network remotely.</p>\n  <h1>How</h1>\n  <p>Two-factor authentication requires the use of a password and an additional form of authentication for remote network access. Remote network access typically means VPN, and the VPN server itself commonly implements password-based authentication. The additional\n form of authentication is the challenge of this requirement. </p>\n  <p>There are multiple products available that satisfy the PCI DSS Requirement 8.3. Two solutions that have positive user feedback are\n<strong>RSA SecurID </strong>tokens, which uses physical tokens and <strong>Securenvoy</strong> cell-phone based authentication, which sends text messages as an additional form of authentication. It may be helpful to contact the vendors when choosing to make\n sure the solution is compatible with your environment. Either of the above solutions is capable of satisfying the PCI DSS Requirement 8.3. For detailed instructions on implementing either solution, please refer to the vendor's documentation or technical support.</p>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about Securenvoy, please see \"Securenvoy\" at <a href=\"http://www.securenvoy.com/\">\nhttp://www.securenvoy.com/</a>. </li>\n    <li>For more information about the RSA SecurID, please see \"RSA SecurID\" at&amp;nbsp;<a href=\"http://www.rsa.com/node.aspx?id=1156\">http://www.rsa.com/node.aspx?id=1156</a>.</li>\n  </ul>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/101a5f93-cbae-4e29-804e-25a57b1011fa\">Formulate the User Authentication and Password Policies</a>\n    </li>\n    <li>ASP.NET3.5: <a href=\"/article/b37c3c66-f503-4695-b93d-f50a20915e7d\">Consider using Two Factor Authentication</a></li>\n  </ul>"
        ]
      }
    ]
  }
}