{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-552444486",
      "Content_Hash": "-270224782"
    },
    "Metadata": [
      {
        "Id": [
          "6ca82a01-c409-47b2-847c-32350b35837b"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Access Control Systems Enforce Privileges"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Access Control Systems Enforce Privileges"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 7.2.2</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Access control systems should enforce the access privileges, which should be assigned based on job function.</p>\r\n  <h1>Why</h1>\r\n  <p>Access control privileges should reflect job requirements in order to allow the employees to perform their duties but prevent them from waging insider attacks.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Review the access authorization documents to make sure access privileges are explicitly defined. Verify that the access privileges are granted based on job functions. For a sample of users, verify that the defined access privileges match the implementation.</p>\r\n  <p>To check the access control settings on Windows, right click on the drive or folder that you are auditing and select \"Properties\" then go to the “Security” tab. Verify that only the needed access privileges are granted. To check access control settings on\r\n UNIX-type systems, issue the \"ls -Al\" command to view a listing of files in the current folder, or the \"ls -ld .\" command to view the access control settings of the current folder.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Identify the job functions of each employee. Identify the data access required for each employee. Define the data access privileges for each employee based on job responsibilities. Have the management review and authorize the data access privilege specifications.\r\n Once approved, implement the data access control systems. Attach the access authorization documents to the network documentation.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/c267e066-0c13-4331-bf58-81b6ea9580cf\">Formulate a Data Access Control Policy</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/a91aa3d6-f7a1-4293-809d-2fd0177a1762\">Configure the Windows Access Control System</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}