{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "783412153",
      "Content_Hash": "1167637725"
    },
    "Metadata": [
      {
        "Id": [
          "77ba62e2-8d03-4d84-b7dc-2a34f718d994"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Perform Network Vulnerability Scans"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Perform Network Vulnerability Scans"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 11.2 </li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Regularly perform network vulnerability scans.</p>\r\n  <h1>Why</h1>\r\n  <p>Automated vulnerability scans require relatively little effort and may detect security holes and misconfiguration.</p>\r\n  <h1>When</h1>\r\n  <p>Vulnerability scans should be performed at least quarterly by a PCI DSS qualified ASV. Qualified staff can perform vulnerability scans after any significant changes to the network.</p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps to conduct network vulnerability scans:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Perform internal network vulnerability scans.</strong> Choose a vulnerability scanner to fit your needs and budget. Some vendors offer demo versions that can give a preview of the functionality and ease of use. A vulnerability scanner is usually\r\n a Windows-based application. Choose a workstation to use for carrying out vulnerability scans. Install the vulnerability scanner software on the workstation. Delegate responsibility for performing internal network vulnerability scans to a qualified staff member.\r\n Have the responsible staff practice with the vulnerability scanner. Vulnerability scans should be performed after any major changes to the network by qualified internal staff.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Perform external network vulnerability scans. </strong>Schedule the quarterly external scans with a PCI DSS qualified ASV. See the list of Approved Scanning Vendors linked at the bottom of this page. If vulnerabilities are found during scanning,\r\n fix them and repeat the scan. Document each iteration and vulnerabilities that are fixed. The final iteration should not discover any serious vulnerabilities.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For a list of PCI SSC qualified ASVs, please see \"Approved Scanning Vendors\" at\r\n<a href=\"https://www.pcisecuritystandards.org/pdfs/asv_report.html\">https://www.pcisecuritystandards.org/pdfs/asv_report.html</a>.\r\n</li>\r\n    <li>For information about Retina, please see \"Retina\" at <a href=\"http://www.eeye.com/Products/Retina.aspx\">\r\nhttp://www.eeye.com/Products/Retina.aspx</a>. </li>\r\n    <li>For information about Nessus, please see \"Tenable Network Security\" at <a href=\"http://www.nessus.org/nessus/\">\r\nhttp://www.nessus.org/nessus/</a>. </li>\r\n    <li>For information about GFILANguard, please see \"Network Security Scanner and Vulnerability Management Tool\" at h<a href=\"http://www.gfi.com/lannetscan\">ttp://www.gfi.com/lannetscan</a>.\r\n</li>\r\n    <li>For information about NeXpose, please see \"Free Vulnerability Scanner Download\" at\r\n<a href=\"http://www.rapid7.com/vulnerability-scanner.jsp\">http://www.rapid7.com/vulnerability-scanner.jsp</a>.</li>\r\n  </ul>"
        ]
      }
    ]
  }
}