{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1337951728",
      "Content_Hash": "-1451855040"
    },
    "Metadata": [
      {
        "Id": [
          "793bb351-b0c7-4465-8841-0ab19375cb99"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Test Changes to the Firewall Configuration"
        ],
        "Category": [
          "Networking"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Test Changes to the Firewall Configuration"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 1.1.1</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>The network documentation and the information security policy should include a formal testing and approval&amp;nbsp;process for changes made to the firewall settings. The exact nature of any test depends on the change that has been made, but most tests should involve\r\n the same common network diagnostic tools. One way to test the changes to the firewall configuration is by performing a detailed port scan of the host(s) protected by the firewall. The nmap port scanner is the industry standard and is available for many common\r\n platforms. </p>\r\n  <h1>Why</h1>\r\n  <p>Testing the firewall configuration after an update makes sure that the firewall behaves as intended.</p>\r\n  <h1>When</h1>\r\n  <p>The firewall configuration should be tested after changes to the configuration have been made.</p>\r\n  <h1>How</h1>\r\n  <p>Test changes to the firewall configuration and update documentation in compliance with PCI DSS by performing the following actions:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Define a test of the firewall configuration. </strong>Write down the steps required to execute it in the network documentation. A test description may look like this: \"Use a computer across the network link secured by the firewall from the target\r\n network to execute a port scan using nmap. Use the command \"nmap -v&amp;nbsp;-PN -n -p 1-65535 TARGETIP,\" where TARGETIP is the target IP to execute the port scan. Save the port scan report and compare it to the expected firewall behavior based on the changes made\r\n to the firewall configuration. If the port scan produces expected results, then the firewall is believed to be configured correctly.\"</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Conduct a test of the firewall configuration.</strong> A typical test may consist of scanning the target host with a port scanner over a network link secured by the firewall. The results of the port scan will indicate whether the firewall configuration\r\n is working correctly.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Update documentation.</strong> The network documentation should also include a formal process for approving changes to the firewall configuration. Designate a person responsible for the changes to the firewall configuration and decide on the process\r\n for approving the changes to the firewall configuration. An approval process can be something like this, \"When changes to the firewall configuration are required, contact the person responsible for the firewall configuration. After changes are made, perform\r\n a port scan to make sure that the changes are implemented correctly. If the test shows that the changes are correct, the staff member responsible for the firewall configuration may approve them by signing off on the test results. Include the test results in\r\n the network documentation, together with the description of the changes that are made.”</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}