{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1406512019",
      "Content_Hash": "940896554"
    },
    "Metadata": [
      {
        "Id": [
          "798bca8f-cb6d-4ce6-b985-041d393f5b50"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Passwords Have a Minimum Length Requirement"
        ],
        "Category": [
          "Configuration"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Passwords Have a Minimum Length Requirement"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 8.5.10 </li>\r\n    <li>Microsoft Active Directory </li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Only passwords that are at least seven characters long should be allowed.</p>\r\n  <h1>Why</h1>\r\n  <p>Using long passwords ensures that the passwords are hard to crack.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Verify that the password length requirement is enforced by performing the following steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Launch the \"Group Policy Management\" console. </strong>The \"Group Policy Management\" console is included in Windows 2008, but has to be downloaded and installed on Windows 2003 and 2000. The link to the download is available at the bottom of this\r\n page. To launch the \"Group Policy Management\" console, execute the \"gpmc.msc\" command.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Launch the Group Policy Object Editor.</strong>&amp;nbsp;Navigate to the \"Group Policy Objects\" folder under the current domain, right click on the GPO and select \"Edit\".</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that the \"Minimum password length\" policy is used.</strong> For each relevant domain, check that there is a linked group policy object that enables the \"Minimum password length\" policy. The \"Minimum password length\" policy is enabled by default\r\n on Windows 2003 and 2008 and is configured to require passwords to be at least 7 characters long. Verify that it has not been changed. The \"Minimum password length\" policy is included in the default GPO called “Default Domain Policy.” The \"Minimum password\r\n length\" policy&amp;nbsp;can be&amp;nbsp;found under “Windows Settings”, “Security Settings”, “Account Policies”, “Password Policy”, “Password must meet complexity requirements”.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Use the following steps to configure the Active Directory to enforce the minimum password length requirement:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Launch the \"Group Policy Management\" console. </strong>The \"Group Policy Management\" console is included in Windows 2008, but has to be downloaded and installed on Windows 2003 and 2000. The link to the download is available at the bottom of this\r\n page. To launch the \"Group Policy Management\" console, execute the \"gpmc.msc\" command.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Edit or create a Group Policy Object (GPO).</strong> To create and activate a new Group Policy Object (GPO), launch \"The Group Policy Management\" console, right click on the domain and select \"Create and Link a GPO Here.\"&amp;nbsp;To edit an existing GPO,\r\n navigate to the \"Group Policy Objects\" folder under the current domain, right click on the GPO and select \"Edit\" - this will open the \"Group Policy Object Editor.\"</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Configure the “Minimum password length” policy.</strong> Set the “Minimum password length” policy requirement to 7 characters or more. This setting is included in the default GPO called \"Default Domain Policy.\" It is found under “Windows Settings”,\r\n “Security Settings”, “Account Policies”, “Password Policy”, “Password must meet complexity requirements”. The \"Minimum password length\" policy is enabled on Windows 2003 and 2008 by default and is configured to require passwords to be at least 7 characters\r\n long.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Link the GPO to the domain.</strong> Link an active group policy object that enables the \"Minimum password length\" policy to each relevant domain .</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about enforcing password policy in a Microsoft AD environment, please see \"Enforcing Strong Password Usage Throughout Your Organization\" at\r\n<a href=\"http://technet.microsoft.com/en-us/library/cc875814.aspx\">http://technet.microsoft.com/en-us/library/cc875814.aspx</a></li>\r\n    <li>To download the \"Group Policy Management Console,\" please see \"Group Policy Management Console with Service Pack 1\" at\r\n<a href=\"http://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887\">\r\nhttp://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887</a></li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/101a5f93-cbae-4e29-804e-25a57b1011fa\">Formulate the User Authentication and Password Policies</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/f604150f-8851-48bb-9537-2f08970dc3f5\">Implement the Password Policy Using Group Policy Objects</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}