{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1619881197",
      "Content_Hash": "-791168023"
    },
    "Metadata": [
      {
        "Id": [
          "7aae3bae-c0a8-438c-afeb-e7804e177186"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Back-up Storage Is Secure"
        ],
        "Category": [
          "Physical Security"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Back-up Storage Is Secure"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 9.5</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>The back-up storage facility should be reviewed at least once a year to make sure it is secure. Ideally, an off-site back-up storage facility should be used.</p>\r\n  <h1>Why</h1>\r\n  <p>An off-site back-up storage facility ensures that the back-ups will be available in the event the company experiences a fire or some other physical disaster. The back-up storage facility should be secure to ensure that back-ups are available in the event\r\n of a disaster and that the back-ups are not compromised.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Check the report(s) from the back-up storage review(s) to make sure that reviews are performed at least once a year. Examine the results of the review to make sure the facility is secure. Visit the actual facility to verify that it matches the description\r\n if necessary. A back-up storage location may be considered secure if it has the same or greater level of security as your company.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Choose a secure off-site back-up storage facility. One example of such a facility is a bank. Place the back-ups in the secure off-site storage facility. Delegate responsibility for reviewing the back-up storage facility's security at least once a year. A\r\n back-up storage location may be considered secure if it has the same or greater level of security as your company.</p>"
        ]
      }
    ]
  }
}