{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1234424323",
      "Content_Hash": "71008741"
    },
    "Metadata": [
      {
        "Id": [
          "806bf97c-a749-4ad5-8e21-ec33bc377dc8"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Implement Physical Security Controls"
        ],
        "Category": [
          "Physical Security"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Implement Physical Security Controls"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 9.1 </li>\n    <li>PCI DSS Requirement 9.1.1 </li>\n    <li>PCI DSS Requirement 9.1.2 </li>\n    <li>PCI DSS Requirement 9.1.3</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Deploy badge-readers and locks and design. Lock idle terminals. Deploy video cameras. Monitor video cameras. Secure network jacks. Escort visitors. Design identification badges. Secure&amp;nbsp;wireless devices physically.</p>\n  <h1>Why</h1>\n  <p>Physical security should be in place to ensure that information storage media containing sensitive information cannot be easily accessed and physically stolen. Locking idle terminals ensures that a passer-by cannot gain unauthorized access. Securing physical\n network jacks ensures that an attacker cannot install rogue network devices. Visitors should be identified and escorted to assure that they do not gain unauthorized access. Wireless devices should be physically secured to prevent tampering with wireless settings\n or otherwise gaining unauthorized access to the network.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to implement physical security controls in compliance with PCI DSS:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Deploy badge-readers and locks. </strong>Acquire a badge management system. A badge management system typically includes badge-readers, a badge-issuing device, and a badge-management application. Deploy the badge management system by following the\n vendor's instructions. Limit access to the badge management system. Most badge-management interfaces implement access control. Implement software access control by following the vendor's instructions. It may be a good idea to physically secure the computer,\n which has the badge-management application installed, and the badge-issuing equipment, by locking them in a separate room. Allow only authorized personnel to access the badge-management application and badge-issuing equipment.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Design identification badges.</strong> Design at least two types of badges that are easily distinguishable at a distance. One will be issued to visitors and the other will be used by employees. Issue badges to visitors when their access is authorized.\n Instruct visitors to display their badges prominently when inside the facility. Ask visitors to surrender their badges when they are leaving the facility.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Lock idle terminals. </strong>Configure workstations to lock after being idle for 15 minutes or less. For instructions on how to enforce automatic terminal locking policy, please see the guidance article called \"Implement the Password Policy Using\n Group Policy Objects,\" linked at the bottom of this page. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Deploy video cameras. </strong>Install video cameras to monitor all entries and exits to the facility. Install additional cameras, as you deem necessary. Physically secure the cameras to prevent tampering by installing them in a way that makes it\n difficult to move them or obstruct their view. Wire the cameras to feed the video to a surveillance center. Acquire, install, and configure additional equipment as necessary to make it possible to view and record all camera feeds. Such additional equipment\n may include monitors, computers, storage media, and analog or digital video recorders.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Monitor video cameras. </strong>Hire or designate someone to watch and review the camera feeds. Instruct the security guard(s) about the available technology and adequate responses as appropriate for your environment.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Secure network jacks. </strong>Identify all the physical network jacks. Identify all the network jacks that are not used. Disconnect all the unused network jacks from the network. There is typically a room where the wires from all the network jacks\n are hooked up to a switch. Unplug the wires that correspond to the unused jacks from the switch.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Escort visitors.</strong> Instruct the receptionist and the employees to not allow any visitors to move about the facility without an escort. It may be prudent to have the employee who authorized the visitor's access escort the visitor. Another,\n less practical, option may be to have a security guard escort the visitor. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Secure&amp;nbsp;wireless devices physically. </strong>Identify all the wireless network devices. Place all the wireless routers in a locked room. Place all the portable wireless devices where it is difficult to steal them, such as in rooms that are not accessible\n to visitors, or directly in the users' possession.</p>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>For information about using Group Policy Objects to configure Windows terminals to lock the screen after 15 minutes, please see\n<a href=\"/article/f604150f-8851-48bb-9537-2f08970dc3f5\">Implement the Password Policy Using Group Policy Objects</a></li>\n  </ul>"
        ]
      }
    ]
  }
}