{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "130190114",
      "Content_Hash": "-2046913800"
    },
    "Metadata": [
      {
        "Id": [
          "8149cce1-c4dd-43a1-9a62-d0fb8271ee4f"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "A Web Application Firewall Is Used"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "A Web Application Firewall Is Used"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 6.6</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>Public-facing web applications should be protected by a web application firewall or be reviewed periodically. This checklist item refers to using a web application firewall.</p>\n  <h1>Why</h1>\n  <p>A web application firewall may prevent an attacker from successfully exploiting a vulnerability in a public-facing web application.</p>\n  <h1>How to Check</h1>\n  <p>Refer to the network documentation and interview the staff to identify if and how a web application firewall is installed. Examine the web application firewall and its administration interface to make sure its configuration matches the documentation. Review\n the web application firewall configuration to make sure that it is installed in front of a public-facing web application, and that it detects and prevents web-based attacks.</p>\n  <h1>How to Fix</h1>\n  <p>Choose whether to conduct regular reviews of the web application or to install a web application firewall. If you choose to install a web application firewall, choose a web application firewall that is compatible with your environment. Please refer to the\n vendor's documentation for detailed instructions on how to install and configure your web application firewall of choice.</p>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>\n      <p>For a list of Web Application Firewall vendors, please see the OWASP \"Web Application Firewall\" page at\n<a href=\"http://www.owasp.org/index.php/Web_Application_Firewall\">http://www.owasp.org/index.php/Web_Application_Firewall</a>.</p>\n    </li>\n  </ul>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <p>\n        <a href=\"/article/115660d2-1992-4212-a0f0-c9865dc4fc1b\">Deploy a Web Application Firewall</a>\n      </p>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}