{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1992236361",
      "Content_Hash": "-144738706"
    },
    "Metadata": [
      {
        "Id": [
          "88013f01-e0c4-4e47-90b1-aeeecb323bdf"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "The Incident Response Plan Satisfies PCI DSS Requirements"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Incident Response Plan Satisfies PCI DSS Requirements"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 12.9 </li>\n    <li>PCI DSS Requirement 12.9.1.a</li>\n    <li>PCI DSS Requirement 12.9.1.b</li>\n    <li>PCI DSS Requirement 12.9.2 </li>\n    <li>PCI DSS Requirement 12.9.3 </li>\n    <li>PCI DSS Requirement 12.9.4 </li>\n    <li>PCI DSS Requirement 12.9.5 </li>\n    <li>PCI DSS Requirement 12.9.6</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>The incident response plan should be documented and should satisfy PCI DSS requirements.</p>\n  <h1>Why</h1>\n  <p>A well thought-out incident response plan is important for being able to respond to attacks in a timely and coordinated manner.</p>\n  <h1>How to Check</h1>\n  <p>Perform the following steps to verify that the incident response plan satisfies PCI DSS requirements:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Review the incident response plan.</strong> Examine the information security documentation to make sure it includes an incident response plan and that the plan has the following information:</p>\n      <ul>\n        <li>Definitions of roles, responsibilities, and communications strategies in the event of a suspected compromise.\n</li>\n        <li>Procedures for notifying payment brands and possibly customers in the event of a&amp;nbsp;suspected compromise.\n</li>\n        <li>Incident response procedures. </li>\n        <li>Business recovery and continuity procedures. </li>\n        <li>Definitions of data back-up processes. </li>\n        <li>Analysis of legal requirements for reporting compromises. </li>\n        <li>Coverage of all critical system components. </li>\n        <li>Provisions for accommodating the incident response from the payment brands. </li>\n        <li>Results of previous incident response plan testing. </li>\n        <li>Definitions of processes for monitoring and responding to alerts including detection of unauthorized wireless access points.\n</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Observe the incident response team. </strong>Observe the daily operations to verify that the processes are implemented.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Conduct interviews. </strong>Interview the incident response team and verify the following:</p>\n      <ul>\n        <li>They are available and are monitoring the systems for any signs of unauthorized activity, including unauthorized wireless devices, IDS alerts, malicious software, and unauthorized changes.\n</li>\n        <li>They are periodically trained. </li>\n        <li>The incident response plan is evolving according to lessons learnt, in response to testing, and to adjust for technological advances.</li>\n      </ul>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Define the incident response plan to satisfy PCI DSS requirements by using the following steps:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Define responsibilities of team members.</strong> Each member of the incident response team should have clearly defined responsibilities. Define communication strategies to be used by team members to talk to each other and for other employees to\n contact the incident response team. The communication strategies may involve cell phones, e-mail, instant messaging, etc. Consider communications security and do not disclose sensitive information over public networks. Define procedures and delegate responsibilities\n for notifying payment brands and customers in the event of a suspected compromise. It may not always be required to notify the customers, but it is good to have procedures for this in place in advance.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Define specific incident response procedures. </strong>The incident response&amp;nbsp;procedures should reflect your computing environment and involve the technologies you use. A good start for a plan is to place the entire company on full alert and isolate\n the system component, which is considered to be compromised. The incident response team should investigate the quarantined component and examine the logs. If malicious software is detected or there are signs of unauthorized changes to the system, payment brands\n and possibly customers should be notified. At this point, the investigation could be escalated to potentially use external resources, such as federal investigators or investigators sent by the payment brands. Predicting the course of a large-scale investigation\n is difficult, especially when external parties that are not under the command of the company are involved, therefore this stage of incident response does not need to be explicitly defined, but it may be helpful to mention the capability for this course of\n action. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Define procedures for recovery and business continuity. </strong>These procedures should be specific to your environment and technologies. Considerations include:\n</p>\n      <ul>\n        <li>It is important to fix the vulnerability that made the compromise possible before resuming business operations.\n</li>\n        <li>In the event that some component part was compromised, such as wireless for example, it may be possible to shut off the affected component and carry on business operations. In the event of a serious compromise this may not be an option.\n</li>\n        <li>The recovery and continuity plans should include the worst-case scenarios. </li>\n        <li>One method for ensuring continuity is to have a small-scale duplicate infrastructure that includes additional security features available for use while the main system is investigated. A smaller scale infrastructure is easier to secure - it should not be\n merely a clone of the main system, but a significantly hardened system that includes only the minimum features to assure business continuity.</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Test the plan. </strong>Test the incident response plan when performing the annual penetration test. Include this fact when documenting the penetration test.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Monitor the log server. </strong>Organize the incident response team to monitor the centralized log center 24/7 and to have the capability to react to suspected compromises. That is, organize them in shifts so that at least one person is monitoring\n the log server at any time. Make sure the rest of the team is easy to reach, so that the monitoring team can summon others quickly.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Train the incident response team. </strong>Enroll the members of the incident response team in an information security training program. Security Innovation offers information security training services.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Monitor alerts.</strong> Configure the log server and/or the IDS/IPS to send alerts to the incident response team and other responsible team members. Alerts may be sent via e-mail or sms. Instruct employees to monitor their e-mail and/or cell phones\n for alerts. At least some members of the incident response team should be in the office 24/7 to monitor the log server, so these same members should be able to respond to alerts quickly. Provide the incident response team with contact information of all responsible\n parties and people who may be helpful in the event of having to escalate the response. Provide the incident response team with copies of the incident response plan and tools for carrying out the incident response.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Evolve the incident response plan.</strong> Update the incident response plan as needed.&amp;nbsp;&amp;nbsp;Update the incident response plan when fixing vulnerabilities found during penetration testing or suspected compromises. Update the incident response plan if\n advances in information security technologies demand it. Add a point to the incident response plan that requires the plan to be updated as a reaction to a suspected compromise or penetration testing. Add this same requirement to the information security policy.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Update the documentation. </strong>Add the incident response plan to the information security documentation.</p>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <p>\n        <a href=\"/article/25aa672c-8112-4407-a6ce-8506b7a7d00a\">Prepare an Incident Response Plan</a>\n      </p>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}