{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-132718535",
      "Content_Hash": "13563228"
    },
    "Metadata": [
      {
        "Id": [
          "8f8be257-3e7f-4aa2-8973-aabb8e77df1c"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Secure the Logs"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Secure the Logs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 10.5</li>\n    <li>PCI DSS Requirement 10.5.1</li>\n    <li>PCI DSS Requirement 10.5.2</li>\n    <li>PCI DSS Requirement 10.5.3</li>\n    <li>PCI DSS Requirement 10.5.4</li>\n    <li>PCI DSS Requirement 10.5.5</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Secure the log server.</p>\n  <h1>Why</h1>\n  <p>Only authorized staff should have access to the log server to prevent an unauthorized disclosure of information.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to secure the log files:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Secure the log server. </strong>All the functionality to comply with this requirement should be provided by the centralized log server. Ask the vendor for information about securing the log server.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Only allow access to users with job-related needs. </strong>Most centralized log servers have built-in access control. The flexibility of this access control is different for different solutions. To satisfy this requirement, it is sufficient to only\n create access accounts for authorized employees who have a legitimate job-related need to view the logs. Ideally, the authentication mechanism on the log server should be integrated with the rest of the network.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Prevent tampering. </strong>Most centralized log server solutions have built-in controls to prevent tampering. The exact controls vary, but they typically include an access control list and some means of preventing privileged users or users with\n physical access from altering the log files. The latter typically does not need to be configured. It is recommended to segregate the log server physically by placing it in a locked room.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Configure all network devices to send logs to the log server. </strong>\nForward the logs from all compatible devices to the log server. For detailed instructions on sending the logs to the log server, please refer to the vendor's documentation or technical support.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Configure file-integrity monitoring. </strong>This feature should be implemented by the log server solution itself. It should not require configuration on the part of the staff. Please refer to the vendor's documentation or technical support to make\n sure that your log server is compliant with this requirement.</p>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/7a956911-f547-4f65-88bb-f4a42ea349f3\">Implement Audit Trails for System Components</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}