{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1183016045",
      "Content_Hash": "-1488491512"
    },
    "Metadata": [
      {
        "Id": [
          "912cc14f-ce55-4961-bd10-dedabb144194"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Each Change to the Software Code Is Tested"
        ],
        "Category": [
          "Development"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Each Change to the Software Code Is Tested"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 6.3</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>All changes, including patches, should be tested before being deployed. Each change should be tested for validation of all input, error handling, secure cryptographic storage, secure communications, and proper role-based access control.</p>\r\n  <h1>Why</h1>\r\n  <p>Testing helps ensure that changes do not introduce new vulnerabilities or break functionality.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Review the change control documentation to make sure that each change, including patches,&amp;nbsp;is tested for validation of all&amp;nbsp;input, proper error handling, secure cryptographic storage, secure communications and proper role-based access control. While reviewing&amp;nbsp;the\r\n documentation, verify that&amp;nbsp;changes are applied only if the tests are successful.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Create a testing environment that simulates the environment where changes are to be applied. Apply changes in the testing environment. Test each change for validation of all input, error handling, secure cryptographic storage, secure communications, and\r\n proper role-based access control. Document the results of the tests.&amp;nbsp;If the tests are successful, apply the changes to the production environment.</p>\r\n  <h1>Related Items</h1>\r\n  <p>For more information about validation of all input, error handling, cryptographic storage, secure communications, and access control, please see the TeamMentor folder \"PCI DSS Code Review.\"</p>"
        ]
      }
    ]
  }
}