{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1107452303",
      "Content_Hash": "136879802"
    },
    "Metadata": [
      {
        "Id": [
          "966464bc-0408-4550-8d1f-af545e460fa8"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Strong Cryptography Is Used to Secure Network Traffic"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Strong Cryptography Is Used to Secure Network Traffic"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Strong cryptography should be used whenever cardholder data is being transmitted over open, public networks.</p>\r\n  <h1>Why</h1>\r\n  <p>Encrypt the cardholder data when transmitting to prevent it from being read if intercepted by an attacker.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Identify if and how the cardholder data is transmitted over open, public networks, such as the Internet. Identify all the computers that are involved in the transmission. Make sure that a strong encryption solution is used on each involved computer to secure\r\n the transmission. Some acceptable network encryption solutions are IPsec and TLS.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Identify if and how the cardholder data is transmitted over open, public networks, such as the Internet. Identify all the computers that are involved in the transmission. Choose a strong encryption solution to secure the transmission. Some acceptable encryption\r\n solutions are IPsec and&amp;nbsp;TLS: </p>\r\n  <ul>\r\n    <li>\r\n      <strong>IPsec</strong> is best used with VPN. IPSec is only an option when all hosts involved have static IPs.</li>\r\n    <li>\r\n      <strong>TLS </strong>is best used for transmitting data between a web client and a web server.\r\n</li>\r\n  </ul>\r\n  <p>Install and configure a strong encryption solution on each involved computer to secure the transmission.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/de1299b9-854b-4479-9f26-bbc9df38af29\">Use TLS or IPSec for Secure Communication Between Entities</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}