{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-923721796",
      "Content_Hash": "-678804916"
    },
    "Metadata": [
      {
        "Id": [
          "96e4cf26-9409-4fb4-9d46-63cc926b27a6"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Service Providers Are Managed in Compliance with PCI DSS"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Service Providers Are Managed in Compliance with PCI DSS"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 12.8 </li>\r\n    <li>PCI DSS Requirement 12.8.1 </li>\r\n    <li>PCI DSS Requirement 12.8.2 </li>\r\n    <li>PCI DSS Requirement 12.8.3 </li>\r\n    <li>PCI DSS Requirement 12.8.4</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>If the company shares cardholder data with service providers, make sure that relationships with the service providers are managed in compliance with PCI DSS.</p>\r\n  <h1>Why</h1>\r\n  <p>When cardholder data is shared with service providers, the service providers have to take responsibility for keeping that data secure. To ensure that this is taking place, relationships with service providers should be managed in compliance with PCI DSS.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Perform the following steps to verify that service providers are managed in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Examine the list of providers.</strong> A list of service providers that cardholder data is shared with should be maintained. Examine the list of providers to make sure that it exists.&nbsp;</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Confirm due diligence.</strong> Due diligence should be&nbsp;performed and documented&nbsp;before engaging any service provider. Examine documentation to verify that due diligence has been performed before engaging service providers.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that service providers acknowledge responsibility for security.\r\n</strong>Written agreements for all service providers, acknowledging their responsibility for securing the data should be included in&nbsp;documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that the PCI DSS compliance status of the service providers is monitored.\r\n</strong>Examine the list of service providers and documentation to verify that the PCI DSS compliance status of service providers is being monitored.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Manage service providers in compliance with PCI DSS by performing the following steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify applicability.</strong> Make sure&nbsp;that&nbsp;the company shares cardholder data with service providers for such purposes as backups or analysis.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Perform due dilligence.</strong> Perform due diligence before engaging any service provider. Document the due diligence process and attach this information to the information security documentation.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Make a list of providers.</strong> Make a list of all service providers sharing cardholder data. Attach the list to the information security documentation. It is a good idea to keep this list together with information about&nbsp;due diligence, service\r\n provider responsibility acknowledgement, and information about their PCI DSS compliance.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify provider responsibility. </strong>Have each service provider that shares cardholder data sign a form stating that the provider takes responsibility for securing cardholder data.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Monitor&nbsp;provider compliance status. </strong>Check the PCI DSS compliance status of each service provider and attach this information to the information security policy. Delegate responsibility for monitoring PCI DSS compliance of service providers\r\n to a qualified staff member.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/4c2201ed-ce8d-408d-9f12-2462aff3c0dd\">Manage Service Providers</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}