{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "849698991",
      "Content_Hash": "1430489088"
    },
    "Metadata": [
      {
        "Id": [
          "98708b61-807d-4f8c-b8dc-d10e35cd27bf"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "NAT Is Used to Masquerade Local IPs"
        ],
        "Category": [
          "Networking"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "NAT Is Used to Masquerade Local IPs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 1.3.8.a</li>\r\n    <li>PCI DSS Requirement 1.3.8.b</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that the company network is using only RFC 1918 addresses, which are not routable from the Internet. Ensure that the internal IP addresses are hidden from the Internet by using Network Address Translation (NAT).</p>\r\n  <h1>Why</h1>\r\n  <p>Leaking IP addresses from the local network to the Internet may provide information to potential attackers that could help them carry out an attack.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Check the router and firewall configurations to make sure that NAT is being used. Check that all computers on all internal networks, including the DMZ, are assigned only RFC 1918 IP addresses. Connect to an Internet web site that displays the IP address\r\n of the browser from the DMZ. Make sure the web site shows the external IP address of the Internet router or firewall to verify that NAT is working.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Assign RFC 1918 IP addresses to all network devices on all internal networks. Configure the Internet firewall or router to use NAT for Internet access to the DMZ. Configure port forwarding on the Internet firewall or router to handle incoming connections\r\n from the Internet. Computers in the cardholder data segment should not have Internet access.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/6b2b4e47-bd4e-4f94-88a4-bf5e0afa96ee\">Configure the Routers for PCI DSS Compliance</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}