{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1801398056",
      "Content_Hash": "-1325760836"
    },
    "Metadata": [
      {
        "Id": [
          "9bb67e82-ea00-4a56-95fd-67720041afe6"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Prepare the Key Management Procedures"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Prepare the Key Management Procedures"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 3.6 </li>\n    <li>PCI DSS Requirement 3.6.a </li>\n    <li>PCI DSS Requirement 3.6.c </li>\n    <li>PCI DSS Requirement 3.6.1 </li>\n    <li>PCI DSS Requirement 3.6.2 </li>\n    <li>PCI DSS Requirement 3.6.3 </li>\n    <li>PCI DSS Requirement 3.6.4 </li>\n    <li>PCI DSS Requirement 3.6.5 </li>\n    <li>PCI DSS Requirement 3.6.5.a </li>\n    <li>PCI DSS Requirement 3.6.5.b </li>\n    <li>PCI DSS Requirement 3.6.6 </li>\n    <li>PCI DSS Requirement 3.6.7 </li>\n    <li>PCI DSS Requirement 3.6.8</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Design and implement key management procedures. Document the key management procedures and include the documentation in the information security policy.</p>\n  <h1>Why</h1>\n  <p>Proper key management procedures are required to apply cryptography securely.</p>\n  <h1>When</h1>\n  <p>Key management procedures should be put in place before deploying an encryption solution.</p>\n  <h1>How</h1>\n  <p>Key management procedures are a part of the information security policy.&amp;nbsp;Key management procedures should be formulated, included in the information security policy, and implemented. The implementation is often not technological but a matter of following\n the outlined policies. Perform the following actions to prepare key management procedures in compliance with PCI DSS.</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Require&amp;nbsp;strong encryption&amp;nbsp;keys. </strong>Pick a method for generating strong encryption keys. Typically strong encryption keys include lower- and upper-case alphanumeric characters. The common key lengths that are considered secure are: 128-bit or\n 256-bit for AES, 1024-bit or 2048-bit for RSA. More bits means more secure. Many encryption suites include a suitable key generator. One encryption suite that includes an acceptable key generator is KeePass. Implement the chosen method of strong key generation.\n Document the chosen key generation method and include the documentation in the information security policy. Make sure the documentation describes how to use the key generator.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Document secure key distribution. </strong>Include a point in the key management procedures requiring secure key distribution. Secure key distribution means preventing disclosure of the encryption keys during transmission. One way to prevent disclosure\n is to make sure the keys never leave the application server by design. If the keys have to be communicated, they should be secured by cryptography. Public key cryptography is suitable for this task. Document the key distribution method suitable for your environment\n and include the documentation in the key management procedures.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Define secure key storage. </strong>Encrypt the data-encrypting keys using the master key whenever the data-encrypting keys are stored.&amp;nbsp;Give fractions of the master key to the key custodians and provide them with a mechanism of assembling the complete\n master key. Have the key custodians sign a form acknowledging their responsibilities. Include a point that describes the mechanism used to encrypt the data-encrypting keys in the key management procedures and mention that this provides secure key storage.\n Document the mechanism used to decrypt the data-encrypting keys for use during business operations and include this documentation in the key management procedures. Diagrams may help explain the key management procedures.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Require regular key changes. </strong>Include a point in the key management procedures requiring that the encryption keys be changed at least annually. Designate staff responsible for changing the encryption keys and instruct them to change keys\n at least annually. Whenever changing keys, review the network documentation to make sure that the new keys have not been used in the past. Whenever the keys are changed, record the changes, including the old keys, and attach this record to the network documentation.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Require retirement of old keys. </strong>Include a point in the key management procedures&amp;nbsp;requiring that keys that have been used previously are never used again. Whenever changing keys, review the network documentation to make sure that the new\n keys have not been used in the past. Whenever the keys are changed, record the changes, including the old keys, and attach this record to the network documentation.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Requre replacement of compromised keys. </strong>Include a point in the key management procedures requiring the suspected or known compromised keys are replaced as soon as possible. Whenever changing keys, review the network documentation to make\n sure that the new keys have not been used in the past. Whenever the keys are changed, record the changes, including the old keys, and attach this record to the network documentation; add a note that the key is considered compromised.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Require split knowledge of keys. </strong>Include a point in the key management procedures requiring that no single person knows the master key (a key used to encrypt other keys). Designate two or three staff members as the key custodians and give\n each one a fraction of the master key. Have the key custodians sign a form acknowledging their responsibilities. Document the split knowledge mechanism, including how the key custodians assemble the entire key, and attach the documentation to the key management\n procedures.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Prevent unauthorized substitution of keys. </strong>Make a list of authorized encryption keys and encrypt these keys using the master key. Include a point in the key management procedures requiring that only the authorized keys from the list be used\n to encrypt the cardholder data, mentioning that this prevents unauthorized substitution of keys. This technology is known as a \"keystore.\" Implementing a keystore varies by platform and applications. Please consult a qualified engineer or expert on how to\n implement a keystore in your environment. This requirement is aimed mostly at preventing insiders from maliciously substituting keys, so implementing this requirement is specific to your application(s) and business process(es). One example of a keystore application\n is KeePass - it's probably too basic to accommodate the needs of your organization, but it demonstrates the idea of a keystore well.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Attach&amp;nbsp;the key custodian responsibility-acknowledgement form. </strong>\nWrite a form stating that the custodian understands his responsibilities and the list of these responsibilities. Have them sign it. Include the signed form in the network documentation. Typically, the responsibilities are to control a fraction of the master\n key and to maintain its integrity by not disclosing it to anyone, except for explicitly authorized parties.</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about key management procedures, please see <a href=\"http://csrc.nist.gov/\">\nhttp://csrc.nist.gov</a> &amp;nbsp;</li>\n    <li>For more information about designing and documenting key management procedures, please see&amp;nbsp;<a href=\"http://www.net-security.org/article.php?id=1185\">http://www.net-security.org/article.php?id=1185</a></li>\n    <li>For an example of a keystore application, please see <a href=\"http://keepass.info\">\nhttp://keepass.info</a></li>\n  </ul>"
        ]
      }
    ]
  }
}