{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1743182883",
      "Content_Hash": "-2145638063"
    },
    "Metadata": [
      {
        "Id": [
          "9cc00334-c041-489d-be5c-b9dfae78d085"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Few People Have Access to Encryption Keys"
        ],
        "Category": [
          "Cryptographic Storage"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Few People Have Access to Encryption Keys"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 3.5</li>\r\n    <li>PCI DSS Requirement 3.5.1</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>As few people as possible should have access to the encryption keys.</p>\r\n  <h1>Why</h1>\r\n  <p>The fewer people with access to the encryption keys, the less likely it is that the encryption keys are disclosed (\"leak out\") or that an insider attack is conducted successfully.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Identify where and how the encryption keys are stored. Identify who has access to the encryption keys. The language of PCI DSS implies that the keys are likely to be stored in a file somewhere and that only a few designated key custodians should have access\r\n to that file. Make sure that only the people who absolutely need access to the keys have it. Ideally, only one or two people should have access to the keys.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Identify the people with access to the encryption keys. Identify the access control mechanism that limits access to the encryption keys. If there is no access control mechanism, implement one. Take away the access permissions from the people who do not need\r\n access to the encryption keys. Change the encryption keys if it was necessary to rescind access from anyone.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/9bb67e82-ea00-4a56-95fd-67720041afe6\">Prepare the Key Management Procedures</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}