{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1291752109",
      "Content_Hash": "-147370363"
    },
    "Metadata": [
      {
        "Id": [
          "a6fd7041-0d43-4574-b67e-dc5105d07c02"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Current Router Configuration Matches the Start-up Settings"
        ],
        "Category": [
          "Networking"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Current Router Configuration Matches the Start-up Settings"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 1.2.2</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>The current router configuration should match the start-up settings. The router settings should be the same if the router is reset.</p>\r\n  <h1>Why</h1>\r\n  <p>If changes were made to the router configuration but were not saved in the router configuration files, then these changes will be lost after the router is powered off or reset. If the changes to the router configuration are lost, then the router may revert\r\n to an earlier, insecure state.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Compare the current configuration to the start-up settings for each router to make sure they are the same. On Cisco IOS, the command to show the running configuration is \"sh run\"; the command to show the start-up configuration is \"sh start.\"</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Refer to the vendor's documentation or tech support for detailed instructions on how to sync the current configuration with the start-up settings on your hardware. This should be very simple. Most routers configured with a web interface feature a button\r\n that saves the current settings as the start-up configuration, and some do it automatically when new settings are applied. This rule is really for routers configured using terminal commands, which may require a special command to save the current settings.\r\n Cisco IOS command for this is \"copy running-configuration startup-configuration\" or \"copy run start.\" Most routers that use web administration interfaces save the configuration as the start-up settings automatically.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/6b2b4e47-bd4e-4f94-88a4-bf5e0afa96ee\">Configure the Routers for PCI DSS Compliance</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}