{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-779459468",
      "Content_Hash": "1591382709"
    },
    "Metadata": [
      {
        "Id": [
          "a8a3af26-1c37-4af0-a480-19604515116e"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "System Configuration Standards Match Industry Standards"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "System Configuration Standards Match Industry Standards"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 2.2.a</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>The system configuration standards should be available for each type of system on the network and should be consistent with industry-accepted standards. Industry-accepted standards include the hardening guides published by SANS, NIST, CIS and NSA.</p>\r\n  <h1>Why</h1>\r\n  <p>It is prudent to use configuration standards that have been subject to peer-review and have been proven effective by information security professionals who have already faced the challenges of standardizing system configurations.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Procure copies of the relevant hardening guides from SANS, NIST, CIS, and NSA. Compare the company system configuration standards to the industry-accepted standards. Make sure that the company system configuration standards are similar or identical to the\r\n industry-accepted standards.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Procure copies of the relevant hardening guides from SANS, NIST, CIS, and NSA. Use these industry-accepted configuration guides as the foundation for the company's configuration standards. Prepare configuration standards for each type of system used on the\r\n network. Use the configuration standards when setting up new systems. When changes are made to the configuration standards, apply the corresponding changes to the existing systems.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/8e658b87-be17-4a53-8453-566e6a678c8b\">Prepare System Configuration Standards Using Industry Standards</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}