{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1439858123",
      "Content_Hash": "-47637320"
    },
    "Metadata": [
      {
        "Id": [
          "ab57ba93-d81a-48e5-80db-83f531025276"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Review the Router Configuration"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Review the Router Configuration"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 1.1.6 </li>\n    <li>PCI DSS Requirement 1.1.6.a </li>\n    <li>PCI DSS Requirement 1.1.6.b</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Review the router configuration periodically to make sure that it is secure and matches business needs.</p>\n  <h1>Why</h1>\n  <p>The purpose of the review is to make sure that the router configurations are secure and to make corrections if they are necessary. The business needs of a company may change over time, resulting in a different network configuration, which&amp;nbsp;may require a change\n in the router configuration. A periodic review process helps ensure that changes to the router configuration have been made successfully.&amp;nbsp;\n</p>\n  <h1>When</h1>\n  <p>The PCI DSS requires the router configuration to be reviewed at least every six months.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to review the router configurations in compliance with PCI DSS:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Designate a&amp;nbsp;DMZ. </strong>The purpose of the DMZ is to mediate the network access between the secure internal environment and the dangerous Internet. The cardholder data servers have to be separated from the DMZ.&amp;nbsp;Make sure that all computers that\n handle incoming connections from the Internet are located in the DMZ. Computers that need Internet access may have to be placed in the DMZ as well. Record any changes that need to be made, or state that the DMZ has been reviewed and does not require any changes.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Inbound IP Traffic Limited to the DMZ. </strong>The inbound Internet traffic should be limited to the DMZ. Verify that the router does not use NAT to translate the ports on external IP(s) to the internal IP(s) that are not in the DMZ. Verify that\n the router does not route inbound IP addresses to internal hosts that are not in the DMZ. Record any changes that need to be made, or state that the port forwarding settings have been reviewed and do not require any changes.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Limit outbound traffic from the cardholder data environment&amp;nbsp;to only access IPs in the DMZ.\n</strong>The network devices in the cardholder data environment should not have Internet access. Verify that the network devices in the cardholder data environment are not able to make any outgoing Internet connections to any network device that is not in the\n DMZ. Record any changes that need to be made, or state that the routing tables have been reviewed and do not require any changes.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Place the database server on an internal network separate from the DMZ.\n</strong>The database server that stores cardholder information is an integral part of the cardholder data environment and therefore must be separate from the DMZ. Verify that any database server that stores cardholder data does not have Internet access. Record\n any changes that need to be made, or state that the database servers are on an internal network separate from the DMZ.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Use NAT to hide internal IPs from the Internet. </strong>The network devices in the PCI DSS scope should only use RFC 1918 IP addresses. Verify that all network devices on the company networks that are in the PCI DSS scope are assigned RFC 1918 addresses\n only. Verify that NAT is enabled on the Internet router or firewall. Record any changes that need to be made, or state that the NAT settings have been reviewed and do not require any changes. RFC 1918 IP addresses are addresses in the following IP ranges:\n</p>\n      <ol>\n        <li>10.0.0.0 - 10.255.255.255 </li>\n        <li>172.16.0.0 - 172.31.255.255 </li>\n        <li>192.168.0.0 - 192.168.255.255</li>\n      </ol>\n    </li>\n    <li>\n      <p>\n        <strong>Review changes to the network. </strong>Review any changes that have been made to the network since the last review, such as addition of any new network devices. Make sure that the router configurations accommodate the changes that have been made\n to the network. The changes that have been made should have been documented when they were made and included in the network documentation.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Update documentation. </strong>The staff member(s) responsible for the review should sign off on the results of the review. The results of the review should be included in the network documentation.</p>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}