{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1821886273",
      "Content_Hash": "862744813"
    },
    "Metadata": [
      {
        "Id": [
          "b01167a3-95a9-4172-b366-d905ac2ac21e"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Configure the Firewalls for PCI DSS Compliance"
        ],
        "Category": [
          "Networking"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Configure the Firewalls for PCI DSS Compliance"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 1</li>\r\n    <li>PCI DSS Requirement 1.2</li>\r\n    <li>PCI DSS Requirement 1.2.1</li>\r\n    <li>PCI DSS Requirement 1.2.1.a</li>\r\n    <li>PCI DSS Requirement 1.2.1.b</li>\r\n    <li>PCI DSS Requirement 1.2.3</li>\r\n    <li>PCI DSS Requirement 1.4</li>\r\n    <li>PCI DSS Requirement 1.3.5</li>\r\n    <li>PCI DSS Requirement 1.3.6</li>\r\n    <li>PCI DSS Requirement 1.4.a</li>\r\n    <li>PCI DSS Requirement 1.4.b</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Install firewalls on all Internet connections. Install firewalls between the cardholder data environment and any DMZs. Install firewalls between any wireless networks and the cardholder data segment. Configure the firewalls to limit inbound and outbound\r\n traffic. Configure the firewalls to block packets with internal IP addresses originating on the Internet. Enable \"dynamic packet filtering\" on the firewalls. Install and configure personal firewalls on all mobile and/or employee-owned computers that are used\r\n to access the company network remotely.</p>\r\n  <p />\r\n  <h1>Why</h1>\r\n  <p>Firewalls offer a layer of protection from attacks originating on the Internet. Properly configured firewalls make it harder to extract sensitive data in the event of a compromise.</p>\r\n  <h1>When</h1>\r\n  <p>Firewall configurations should be planned in the design stage, and installed and configured while the network is being deployed. Firewall configurations may need to be updated to achieve PCI DSS compliance.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to configure the firewalls for PCI DSS compliance:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Strategically deploy the firewalls.</strong> Install firewalls at each Internet connection. Install firewalls between each DMZ and the internal network. Install firewalls between any wireless networks and the cardholder data environment.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Limit inbound and outbound traffic.</strong> Usually the firewall rule-set is stored as a list of rules. The rules at the top of the list usually have the highest priority. To filter traffic, the firewall goes down the list and checks the traffic\r\n to see if it matches a rule. If there is a match, then the firewall takes action based on the rule and stops processing the rest of the rules. If the firewall goes down the list and doesn't find a match, the default action takes place. Some firewalls have\r\n an option to implicitly \"deny after allow\" if there is no explicit \"ALLOW\" match that does the same thing as an explicit \"DENY ALL\" statement. The explicit \"DENY ALL\" statement is recommended because it is less ambiguous. Write rules that allow access only\r\n to the network services that are necessary for business operations. Identify the services necessary for business operations. Identify the ports and protocols used by these services. Make a list of these services and their settings and include it in the network\r\n documentation. Write a rule for each port and protocol that is required by each necessary service. The exact procedure for implementing firewall rules varies by firewall. Please refer to the vendor's documentation or tech support for instructions on how to\r\n implement rules on your firewall. To maintain PCI DSS compliance, the default rule should be \"DENY ALL\" and should be at the bottom of the rule-set. The network documentation should include the descriptions of the restrictions imposed by the firewalls. For\r\n each firewall, document the \"DENY\" rules, including the default \"DENY ALL\" rule. Include an explanation of why each restriction is necessary. It is acceptable if the only \"DENY\" rule is the default \"DENY ALL\" rule.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Only allow explicitly authorized network traffic from the cardholder data environment to the Internet.</strong> After setting a \"DENY ALL\" default, configure the firewalls to only allow explicitly authorized outgoing network connections, by adding\r\n rules for each authorized remote and local host and port. Make these rules as restrictive as possible. Get the list of explicitly authorized local and remote hosts and ports from the network documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Don't allow internal IP addresses from the Internet.</strong> The firewall should not allow packets with internal IP addresses to enter from the Internet. An attacker may be sending packets that appear to come from the local network to perform network-layer\r\n attacks. Configure the firewall to block packets with internal IP addresses coming from the Internet by writing a corresponding DENY rule. Write a rule that blocks all IP address ranges that are used on the internal networks inbound from the Internet facing\r\n interface. The exact procedure for implementing a rule varies by firewall. Please refer to the vendor's documentation or tech support for instructions on how to write a rule for your firewall.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Enable dynamic packet filtering.</strong> Enable \"dynamic packet filtering\" (also known as “stateful inspection”) to prevent network layer attacks that originate on the Internet.&amp;nbsp;The exact procedure to enable \"dynamic packet filtering\" varies by\r\n firewall. Refer to the vendor's documentation or technical support for detailed instructions on how to enable \"dynamic packet filtering\" on your firewall.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Install and configure personal firewalls.</strong> Install and configure a personal firewall for each mobile and/or employee-owned computer that is used to access the company network. For instructions on how to install and configure a personal firewall,\r\n please refer to the article \"Install and Configure a Personal Firewall.\"</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/59a5dab8-8cf9-48bd-809c-e4d43e2a261a\">Install and Configure a Personal Firewall</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}