{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1674170669",
      "Content_Hash": "-2101739466"
    },
    "Metadata": [
      {
        "Id": [
          "b0c6d549-d86a-453a-87cf-76a450c293d3"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Maintain a PCI DSS Compliant Information Security Policy"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Maintain a PCI DSS Compliant Information Security Policy"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 12.1</li>\r\n    <li>PCI DSS Requirement 12.1.1</li>\r\n    <li>PCI DSS Requirement 12.1.2</li>\r\n    <li>PCI DSS Requirement 12.1.3</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Maintain a PCI DSS compliant information security policy.</p>\r\n  <h1>How</h1>\r\n  <p>To prepare and maintain a PCI DSS compliant information security policy,&amp;nbsp;perform the following tasks:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the correlation between your company's information security policy and PCI DSS requirements.\r\n</strong>Print a copy of the \"PCI DSS Requirements and Security Assessment Procedures\" document. Go through your company's information security policy and identify which points correspond to which PCI DSS requirements. You may mention the corresponding PCI\r\n DSS requirement in each related point of the information security policy to speed up the assessment process. Cross out the PCI DSS requirements in the printed copy of the document to mark that they are addressed by your company's information security policy.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Add points to your company's information security policy to make sure it is compliant with PCI DSS.</strong> Follow the instructions in the related items linked below to add more points to the information security policy. You may mention the corresponding\r\n PCI DSS requirement in each related point of the information security policy to speed up the assessment process. Cross out the requirements in the printed copy of the document corresponding to the items that have been addressed by following the suggestions\r\n in the linked items below. Go through the document and add a point to the information security policy for each requirement that is not already addressed. You may mention the corresponding PCI DSS requirement in each related point of the information security\r\n policy to speed up the assessment process. You may paraphrase the language of the PCI DSS document to use as points in your information security policy.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that all PCI DSS requirements are covered. </strong>Go through the printed document one more time and compare it with the company's information security policy to verify that all PCI DSS requirements are addressed.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Publish and disseminate.</strong> Publish the information security policy and distribute it to all users. Delegate responsibility for maintaining the information security policy to qualified staff.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Schedule annual policy review. </strong>Delegate responsibility for maintaining the information security policy up-to-date to qualified&amp;nbsp;staff and instruct them to review the information security policy annually and to update it as needed. Schedule\r\n the annual information security policy review.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/4f4b41ef-7b23-4de6-837d-5d052c328432\">Define Daily Security Operational Procedures</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/a5487579-7d49-4645-b287-5acc05913f5a\">Define Acceptable Technology Usage Policies</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/c267e066-0c13-4331-bf58-81b6ea9580cf\">Formulate a Data Access Control Policy</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/ee48bbf8-53d9-4c4f-89db-2e94be25592e\">Formulate a Storage Media Policy</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/101a5f93-cbae-4e29-804e-25a57b1011fa\">Formulate the User Authentication and Password Policies</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/25aa672c-8112-4407-a6ce-8506b7a7d00a\">Prepare an Incident Response Plan</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/40de7c85-0fdd-4894-a3a1-943d4316fb12\">Prepare the Data Retention and Disposal Policies</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/9bb67e82-ea00-4a56-95fd-67720041afe6\">Prepare the Key Management Procedures</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/19c8d409-b52c-44ac-b8d2-c668f32a5ec4\">Prepare the Network Documentation for PCI DSS Compliance</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/0ca62288-978f-4885-af68-cd2d59fb1a6e\">Protect the Cardholder Data</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}