{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-948628900",
      "Content_Hash": "1679628714"
    },
    "Metadata": [
      {
        "Id": [
          "b3096d5e-1147-4919-9e09-c7675a19df37"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Change System Default Settings on Network Devices"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Change System Default Settings on Network Devices"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 2.1</li>\r\n    <li>PCI DSS Requirement 2.1.1.b</li>\r\n    <li>PCI DSS Requirement 2.1.1.c</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Change the vendor default passwords on network devices.</p>\r\n  <h1>Why</h1>\r\n  <p>Vendor default passwords are public knowledge and, therefore, insecure. To secure a network configuration, the vendor default settings of network components must be changed.</p>\r\n  <h1>When</h1>\r\n  <p>Change the vendor defaults before deploying new system components.</p>\r\n  <h1>How</h1>\r\n  <p>Change the vendor defaults for security settings&amp;nbsp;before deploying new system components by performing the following tasks:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Secure the administrator account. </strong>Log into the new network device as an administrator using the vendor default password. Find the page or command that changes the administrator password, using vendor manuals, the Internet, or intuition.\r\n Change the administrator password to a password that is consistent with the company password policy. If possible, rename the administrator account.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Secure or remove other default accounts. </strong>Identify all other default usernames and passwords by using the vendor’s manuals, commands on the network device, or the Internet; there may be none. If there are other default user accounts, change\r\n the passwords for them, using the same procedure used for changing the administrator password. If there are default user accounts that are not needed, remove them.The exact procedure to remove a user account varies by network device. Please refer to the vendor’s\r\n manual or technical support for detailed instructions on how to remove a user account on your network device.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Secure SNMP settings. </strong>If the network device supports SNMP, verify that SNMP is necessary for network operations. If SNMP is not necessary, disable it. If SNMP is necessary, change the community string from the vendor default. The exact procedure\r\n for changing the SNMP settings varies by network device. Please refer to the vendor’s manual or technical support for detailed instructions on how to configure the&amp;nbsp;SNMP settings on your network device.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For a list of default usernames and passwords, please see \"Default Password List\" at\r\n<a href=\"http://www.phenoelit-us.org/dpl/dpl.html\">http://www.phenoelit-us.org/dpl/dpl.html</a>.</li>\r\n    <li>For a list of default usernames and passwords, please see \"Default Passwords\" at\r\n<a href=\"http://cirt.net/passwords\">http://cirt.net/passwords</a>.</li>\r\n  </ul>"
        ]
      }
    ]
  }
}