{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-581728936",
      "Content_Hash": "-742573100"
    },
    "Metadata": [
      {
        "Id": [
          "b528492e-41ed-4645-97c6-8b78fb3f53ed"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Keep Track of New Security Vulnerabilities"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Keep Track of New Security Vulnerabilities"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 6.2 </li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Use on-line resources to stay informed about the latest security vulnerabilities.</p>\n  <h1>Why</h1>\n  <p>The information security community is very active online and provides many valuable resources that track the latest discovered vulnerabilities. Potential attackers monitor these resources as well, so it is important to mitigate new threats before they are\n exploited.</p>\n  <h1>When</h1>\n  <p>The responsible staff should be monitoring online resources to stay informed about the latest threats continually.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to keep track of new security vulnerabilities:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Update policy. </strong>Add a requirement to the information security policy for the responsible staff members to use outside resources to stay informed about the latest discovered security vulnerabilities. This requirement may be expressed along\n the lines of \"The responsible staff shall regularly review online security vulnerability tracking resources to check whether the software on the company network is vulnerable. \"Including a list of the online information security resources in the policy may\n be helpful. Recommended resources are: BugTraq, PacketStorm, SecurityFocus, Exploit-DB.\"</p>\n    </li>\n    <li>\n      <p>\n        <strong>Monitor&amp;nbsp;information security&amp;nbsp;web sites. </strong>Instruct the staff to review online security vulnerability tracking resources periodically to check whether the software you are using in your environment is susceptible to known vulnerabilities. Recommended\n web sites are: PacketStorm, SecurityFocus, Exploit-DBThe links to these resources are at the bottom of this article.\n</p>\n    </li>\n    <li>\n      <p>\n        <strong>Subscribe to information security mailing lists. </strong>Instruct at least one staff member to sign up for the BugTraq mailing list and other similar mailing lists as appropriate. The link to the BugTraq mailing list is at the bottom of this article</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>To sign up for the BugTraq mailing list, please visit \"Security Focus\" at <a href=\"http://www.securityfocus.com/\">\nhttp://www.securityfocus.com</a>. </li>\n    <li>For a list of recently discovered vulnerabilities, please see \"Security Focus Vulnerabilities\" at\n<a href=\"http://www.securityfocus.com/vulnerabilities\">http://www.securityfocus.com/vulnerabilities</a>.\n</li>\n    <li>To check the latest public exploits, please see \"Last 100 Exploit Files\" at <a href=\"http://www.packetstormsecurity.org/exploits100.html\">\nhttp://www.packetstormsecurity.org/exploits100.html</a>. </li>\n    <li>For an archive of exploits and vulnerabilities, please see “Exploit Database” at\n<a href=\"http://www.exploit-db.com/\">http://www.exploit-db.com/</a>.</li>\n  </ul>"
        ]
      }
    ]
  }
}