{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-626627370",
      "Content_Hash": "284008197"
    },
    "Metadata": [
      {
        "Id": [
          "c153c8ea-f713-486d-8485-4bbbd0209ebf"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Manage a Formal Security Awareness Program"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Manage a Formal Security Awareness Program"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 12.6 </li>\r\n    <li>PCI DSS Requirement 12.6.a </li>\r\n    <li>PCI DSS Requirement 12.6.b </li>\r\n    <li>PCI DSS Requirement 12.6.1 </li>\r\n    <li>PCI DSS Requirement 12.6.1.a </li>\r\n    <li>PCI DSS Requirement 12.6.1.b</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Manage a formal security awareness program.</p>\r\n  <h1>Why</h1>\r\n  <p>An employee security awareness program increases staff participation in maintaining a secure computing environment.</p>\r\n  <h1>When</h1>\r\n  <p>All employees should receive information security awareness training upon hire and annually thereafter.</p>\r\n  <h1>How</h1>\r\n  <p>To conduct a security awareness program in compliance with PCI DSS,&amp;nbsp;perform the following tasks:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Establish&amp;nbsp;a security awareness program. </strong>Develop training materials. Designate staff responsible for training. Schedule annual training sessions. Train new employees upon hire. Make a spreadsheet with a list of all employees and the date\r\n of their most recent security awareness training to make sure all employees participate.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Prepare security awareness training&amp;nbsp;media. </strong>Manage a portfolio of security training materials. Have the person responsible for the training produce or procure these materials. These materials should be in multiple formats, such as:</p>\r\n      <ul>\r\n        <li>presentations </li>\r\n        <li>letters </li>\r\n        <li>posters </li>\r\n        <li>videos </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Schedule&amp;nbsp;training. </strong>Schedule sessions to take place at least once a year. Have the training staff available throughout the year to accommodate new employees.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Have the employees sign acknowledgement forms. </strong>Prepare a form that states that the signatory understands the information security policy.&amp;nbsp;Print these forms to make them available during each training session. After each training session,\r\n distribute them for the employees to sign. Collect the signed forms and attach them to the information security documentation. Discard the older sign-off forms if you have more than one for an employee.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Update documentation. </strong>Maintain a portfolio of security awareness training materials. Schedule presentations and/or annual training sessions. Keep records of conducted training. After each training session, have each employee sign a form\r\n that says they understand the information security policies and procedures. You may discard the older employee acknowledgement sign-offs if you have more than one for each. Attach these documents to the information security documentation.\r\n</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}