{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1193106355",
      "Content_Hash": "1039438676"
    },
    "Metadata": [
      {
        "Id": [
          "c2328961-f3ed-4db8-baa1-d58406947cf5"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Perform Penetration Tests"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Perform Penetration Tests"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 11.3 </li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>\r\n    <span>Hire a qualified information security company to perform penetration tests for you.</span>\r\n  </p>\r\n  <h1>Why</h1>\r\n  <p>\r\n    <span>Penetration tests may expose security vulnerabilities and misconfigurations. Penetration tests also exercise the response capabilities of the company to verify that they are sufficient for handling an actual attack.</span>\r\n  </p>\r\n  <h1>When</h1>\r\n  <p>\r\n    <span>Penetration tests should be performed at least annually and after any significant changes to the environment.</span>\r\n  </p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps to perform penetration tests in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Schedule annual penetration tests. </strong>Hire a qualified information security company to perform penetration tests for you.\r\n<em>Security Innovation offers penetration-testing services.</em> Perform penetration tests at least annually and after any major changes to the network. Express this as a requirement in the information security policy.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify penetration tester qualifications. </strong>Verify the credentials of the penetration testers to make sure they are qualified. Things to look for are:\r\n</p>\r\n      <ul>\r\n        <li>Independent projects </li>\r\n        <li>Previous penetration testing experience </li>\r\n        <li>Experience with penetration testing in the context of PCI DSS </li>\r\n        <li>Higher education should be a given. </li>\r\n        <li>Certifications are ok, but they may not accurately reflect the skill of the individual - individuals with vastly different skill levels may have similar certifications.\r\n</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Perform network layer penetration tests. </strong>Make sure the penetration testers perform and document network layer attacks. Negotiate this in advance.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Perform application layer penetration tests. </strong>Make sure the penetration testers perform and document application layer attacks. Have them test all web applications for the OWASP Top 10 types of web application vulnerabilities. Negotiate this\r\n in advance. </p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}