{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "553932745",
      "Content_Hash": "1836020402"
    },
    "Metadata": [
      {
        "Id": [
          "c3d8ad00-de1d-4938-a4cf-0cd8b71fef36"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Use a Wireless Analyzer"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use a Wireless Analyzer"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 11.1</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Use a wireless analyzer to enumerate all wireless devices in use and to alert the appropriate staff in the event that&nbsp;unauthorized devices are detected.</p>\r\n  <h1>Why</h1>\r\n  <p>An unauthorized wireless device on the company network is a telltale sign of an attack.</p>\r\n  <h1>When</h1>\r\n  <p>Use a wireless analyzer to enumerate all active wireless devices in the PCI scope at least quarterly.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to use a wireless analyzer to scan for unauthorized wireless devices in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Get the tools.</strong> Acquire a wireless analyzer. Train a staff member to use it by having him or her read the vendor's documentation and practice using the analyzer. Using the analyzer varies by vendor. Refer to the vendor's documentation or\r\n technical support for specific instructions. Detecting all active devices should be easy and technical support should be able to assist with this task. Most commercial wireless network analyzers feature a graphical user interface that makes reasonable attempts\r\n at being intuitive. The more advanced and complicated features are not necessary for detecting all active wireless devices.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Schedule the scans.</strong> Schedule the dates for the quarterly scans. Have the trained staff member scan for all active wireless network devices with the analyzer and document the results.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Perform&nbsp;a scan.</strong> Compare the results of the scan to the list of authorized wireless network devices in the network documentation. If an unauthorized device is detected, alert the responsible staff&nbsp;and execute the incident response plan.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For a list of many wireless security tools, please see \"Wireless Security Tools\" at\r\n<a href=\"http://www.corecom.com/html/wlan_tools.html\">http://www.corecom.com/html/wlan_tools.html</a>.\r\n</li>\r\n    <li>For information about AirMagnet WiFi Analyzer, please see \"AirMagnet WiFi Analyzer\" at\r\n<a href=\"http://www.airmagnet.com/products/wifi_analyzer/\">http://www.airmagnet.com/products/wifi_analyzer/</a>.\r\n</li>\r\n    <li>For information about YellowJacket WiFi Analyzer, please see \"Yellowjacket\" at\r\n<a href=\"http://www.bvsystems.com/Products/WLAN/YJ-BAG/YJ-BAG.htm\">http://www.bvsystems.com/Products/WLAN/YJ-BAG/YJ-BAG.htm</a>.\r\n</li>\r\n    <li>For information about Fluke Networks OptiView, please see \"OptiView Portable&nbsp;Network Analyzer\" at\r\n<a href=\"http://www.flukenetworks.com/fnet/en-us/products/OptiView&#43;Series&#43;III&#43;Integrated&#43;Network&#43;Analyzer/Overview.htm\">\r\nhttp://www.flukenetworks.com/fnet/en-us/products/OptiView&#43;Series&#43;III&#43;Integrated&#43;Network&#43;Analyzer/Overview.htm</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}