{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1975707433",
      "Content_Hash": "-1032826733"
    },
    "Metadata": [
      {
        "Id": [
          "c57eaf7a-f02e-4172-8221-38fb47dbf402"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Keep Anti-Virus Logs"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Keep Anti-Virus Logs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 5.2.d </li>\r\n    <li>PCI DSS Requirement 10.7</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Keep logs generated by anti-virus software for a year or more.</p>\r\n  <h1>Why</h1>\r\n  <p>Keeping anti-virus logs helps investigate security incidents. One of the biggest questions that may be answered by reviewing anti-virus logs is whether the compromise was due to a non-specific automated threat or due to a targeted attack.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to assure that the anti-virus keeps logs in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Enable logging.</strong> Locate the anti-virus administration interface. Some anti-virus packages have a control panel on the systems where they are deployed and some anti-virus suites offer a centralized control panel. The number of options offered\r\n by the anti-virus interface is usually small enough that a person with an IT background can figure out what all of them are and how to use them. The administration interface should offer an option to maintain anti-virus logs. If this option is not available,\r\n please consider installing and configuring a different anti-virus. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Configure the anti-virus to retain logs for a year or more.</strong> If the software does not support storing logs for a year, configure it to store logs for at least three months. If the software does not allow storing the logs for at least three\r\n months, please consider installing and configuring a different anti-virus. If the anti-virus supports storing logs for at least three months, but not for a year, implement backup procedures to keep the anti-virus logs for at least a year.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Integrate the anti-virus with the centralized log server. </strong>Ideally, the anti-virus should be integrated with the centralized log server, and the log server should keep the logs for at least a year. Ask the anti-virus vendor about integration\r\n with your log server. Configure the anti-virus to send logs to the centralized log server by following the vendor's instructions. Consider using a different anti-virus if yours is not compatible with your log server.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}