{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-709101390",
      "Content_Hash": "-1989457428"
    },
    "Metadata": [
      {
        "Id": [
          "c690409b-83f1-4566-96da-5d81bd7ea80a"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Test Dynamic Packet Filtering with a Port Scanner"
        ],
        "Category": [
          "Networking"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Test Dynamic Packet Filtering with a Port Scanner"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 1.3.6<br /></li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Check whether \"dynamic packet filtering\" is working by performing a custom port scan using nmap.\r\n</p>\r\n  <h1>Why</h1>\r\n  <p>Dynamic packet filtering makes sure that only packets that are a part of an actual transmission can pass through the firewall. Dynamic packet filtering prevents a potential attacker from sending custom packets to scan the network or to perform network layer\r\n attacks.</p>\r\n  <h1>When</h1>\r\n  <p>Test whether \"dynamic packet filtering\" is enabled when testing the firewall configuration.</p>\r\n  <h1>How</h1>\r\n  <p>Perform a port scan with SYNACK or SYNRST flags set and watch the responses with a packet analyzer. Use a packet analyzer, such as Wireshark, on the computer performing the scan to make sure that the target host doesn't send any responses back. If the target\r\n host sends responses, that means that the invalid packets are getting through the firewall and \"dynamic packet filtering\" is not working. Use the following steps to conduct this test:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Deploy Wireshark and nmap.</strong> Make sure that you have a computer available that has Wireshark and nmap tools installed. Make sure that this computer is connected to the Internet outside of the company network.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Start packet capture.</strong> Run Wireshark. Select \"Capture\" from the application menu. Press the \"Start\" button next to the network interface, which is connected to the Internet.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use nmap to send packets with SYNACK or SYNRST flags set.</strong>&amp;nbsp; Execute either of these commands: \"nmap -PN -n -p 1-65535 -v --scanflags SYNACK TARGETIP\" or \"nmap -PN -n -p 1-65535 -v --scanflags SYNRST TARGETIP” where TARGETIP is the IP of a\r\n computer inside the DMZ or an external IP that has ports forwarded to the DMZ. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Analyze the packet capture.</strong> Watch the Wireshark window. You can stop the Wireshark capture after a couple of minutes even if the port scan did not finish yet. Examine the Wireshark capture. If any packets have been received from the target\r\n IP in response to the port scan, then \"dynamic packet filtering\" is not working. If you can see the packets sent by the port scanner, but there have been no replies from the target, then \"dynamic packet filtering\" is working correctly.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}