{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1968896875",
      "Content_Hash": "695834790"
    },
    "Metadata": [
      {
        "Id": [
          "c6c551a1-e766-4aff-88d7-edd87077e95c"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Review Logs Regularly"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Review Logs Regularly"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 10.6 </li>\r\n    <li>PCI DSS Requirement 10.6.a </li>\r\n    <li>PCI DSS Requirement 10.6.b</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Review all logs in the cardholder data environment daily. Establish policy that requires staff to respond to exceptions.</p>\r\n  <h1>Why</h1>\r\n  <p>Logs should be reviewed daily to ensure that appropriate measures are taken in a timely manner to respond to an attack or some other exception.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to assure that logs are reviewed regularly:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Update policy. </strong>Add a point to the information security policy that requires all the logs to be reviewed at least once a day. Follow the guidelines for the PCI DSS Requirement 12 to add incident response definitions to the information security\r\n policy. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Send logs to the log server.</strong> Get the list of network devices from the network documentation and configure each network device to send logs to the centralized log server if possible. The exact instructions for this vary by device and log\r\n server. Typically, there are two approaches: syslogd and agent software for windows. Syslogd is a UNIX standard for centralized logs and is implemented by many network devices and log servers, especially UNIX-style ones. To configure syslogd, it is typically\r\n sufficient to specify the hostname or IP address of the log server on the network device in the administration interface. Another approach is to use agent software. Typically, agents are made available by the log server vendor for many common platforms. An\r\n agent is installed on the network device or computer as an application. When correctly configured, the agent forwards the logs from the host to the centralized log server. For detailed instructions on configuring the devices to send information to the log\r\n server, please refer to the log server's vendor documentation or technical support.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Mitigate devices incompatible with the log server.</strong> Make a list of devices that are not compatible with the log server. Use this list to check the logs on each device daily individually. Consider replacing them with devices that are compatible\r\n with the centralized log server. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Designate staff responsible for monitoring logs.</strong> Delegate responsibility for reviewing the logs daily to a qualified staff member or team. Instruct the team in the appropriate responses to exceptions based on the definitions in the information\r\n security policy.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}