{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-2017384930",
      "Content_Hash": "-1297966375"
    },
    "Metadata": [
      {
        "Id": [
          "cbc4c17c-52a1-4690-be7f-b34227b8d529"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Logging Is Enabled"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Logging Is Enabled"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 10.1</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Logging should be enabled. A centralized log server should be deployed.</p>\r\n  <h1>Why</h1>\r\n  <p>Logging helps detect an attack in progress, coordinate a response, and investigate the attack afterwards.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Locate and examine the centralized log server to verify that it is operational. Examine the logs to verify that they are current.&amp;nbsp;Interview the system administrator to verify that all system components are included in the logs.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Choose a centralized log server solution. When choosing a centralized log server solution, it may be helpful to verify that it is explicitly designed to satisfy PCI DSS Requirement 10.2.2 - logging all activity by the administrator and the other privileged\r\n users - because this functionality is difficult to implement otherwise. Install and configure a centralized log server by following the vendor's instructions. Configure all network devices that are compatible with the log server to send logs to the log server.\r\n Make a list of the incompatible devices and use this list daily to manually check and backup the corresponding logs. Consider replacing the devices that are not compatible with ones that are.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/7a956911-f547-4f65-88bb-f4a42ea349f3\">Implement Audit Trails for System Components</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}