{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "767329760",
      "Content_Hash": "986509620"
    },
    "Metadata": [
      {
        "Id": [
          "ce320eca-f474-415b-8d55-db0c62ef7d95"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Visitors Are Assigned Badges"
        ],
        "Category": [
          "Physical Security"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Visitors Are Assigned Badges"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 9.3 </li>\r\n    <li>PCI DSS Requirement 9.3.1 </li>\r\n    <li>PCI DSS Requirement 9.3.2 </li>\r\n    <li>PCI DSS Requirement 9.3.3</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Visitors should be issued badges that are clearly distinct from employee badges and are returned when visitors leave the facility.</p>\r\n  <h1>Why</h1>\r\n  <p>Visitors should be issued badges to show that their access has been authorized and to distinguish them from employees. Visitor badges should be different from employee badges so that a visitor cannot impersonate an employee. Visitors should turn in their\r\n badges so that they cannot return and gain unauthorized access.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Observe a visitor to verify the use of badges when their access is authorized. Examine the visitor and employee badges to verify that they are easily distinguishable from a distance and that badges expire. Observe departing visitors to verify that visitors\r\n return their badges upon leaving.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Acquire a badge management system. A badge management system typically includes card-readers, a card-issuing device, and a card-management application. Deploy the badge management system by following the vendor's instructions. Design at least two types of\r\n badges, one to be issued to visitors and the other to be used by employees. </p>\r\n  <p>Authorize visitors' access before issuing badges. Instruct visitors to display their badges prominently when inside the facility. Ask visitors to return their badges when they are leaving the facility.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/806bf97c-a749-4ad5-8e21-ec33bc377dc8\">Implement Physical Security Controls</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}