{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1412606619",
      "Content_Hash": "-1841461910"
    },
    "Metadata": [
      {
        "Id": [
          "d33ca494-ab75-45f8-b417-2d5bf40623d0"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Badge Management Procedures Are Defined"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Badge Management Procedures Are Defined"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 9.2 </li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that processes&nbsp;are in place for managing badges. Ensure&nbsp;that access to the badge management system is restricted. Check that employee badges are easily distinguishable from visitor badges.</p>\r\n  <h1>Why</h1>\r\n  <p>Badge management processes should be in place because new badges may be needed quickly for visitors or new employees, badge information may need to be changed, and old badges may need to be revoked. Access to the badge management system should be limited\r\n to prevent employees from tampering with their access privileges. The employee badges and the visitor badges should be different to prevent visitors from impersonating employees to gain unauthorized access.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to verify that badges are managed in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Check if a badge-management system is deployed.</strong> Verify that badge management processes are in place by interviewing the responsible staff about how to create a new employee badge, how to create a new visitor badge, how to change badge information,\r\n and how to revoke a badge. Inspect the equipment used to implement these processes to make sure that it is operational.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Make sure the badge-management system is secure.</strong> Ask the responsible staff to demonstrate the badge management interface to make sure that access to the management interface is restricted by physical security and software access controls.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Examine the identification badges.</strong>&nbsp;Visually compare the employee and visitor badges to make sure it is easy to tell them apart from a distance.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to manage badges in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Deploy a badge-management system.</strong> Acquire a badge management system. A badge management system typically includes badge-readers, a badge-issuing device, and a badge-management application. Deploy the badge management system by following\r\n the vendor's instructions. Limit access to the badge management system. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Secure the badge-management system.</strong> Most badge-management interfaces implement access control. Implement software access control by following the vendor's instructions. It may also be a good idea to physically secure the computer, which\r\n has the badge-management application installed, and the badge-issuing equipment, by locking them in a separate room. Allow only authorized personnel to access the badge-management application and badge-issuing equipment.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Design badges.</strong> Design at least two types of badges that are easily distinguishable at a distance. One will be issued to visitors and the other will be used by employees.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Issue badges.</strong> Issue badges to visitors when their access is authorized. Instruct visitors to display their badges prominently when inside the facility. Ask visitors to surrender their badges when they are leaving the facility.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/806bf97c-a749-4ad5-8e21-ec33bc377dc8\">Implement Physical Security Controls</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}