{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-935223550",
      "Content_Hash": "185060149"
    },
    "Metadata": [
      {
        "Id": [
          "d530bf4b-7b06-4c1b-858a-72293e237081"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Organize the Software Development Processes for PCI DSS Compliance"
        ],
        "Category": [
          "Development"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Organize the Software Development Processes for PCI DSS Compliance"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 6.3</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Design and document the software development processes to comply with PCI DSS.</p>\r\n  <h1>How</h1>\r\n  <p>Design and document the software development processes in compliance with PCI DSS by performing the following actions:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Develop code in compliance with PCI DSS. </strong>Be aware of the PCI DSS requirements through-out the development process to make sure that the resulting application is PCI DSS compliant. It may be helpful to review the PCI DSS requirements to see\r\n which ones apply to the application(s) you are developing. Links to the PCI DSS requirements to consider when organizing software development are listed at the end of the article under Related Items.</p>\r\n    </li>\r\n    <li>\r\n      <strong>Test all changes. </strong>Do not use production data for testing, especially live PANs. Test all changes, including updates and significant configuration changes. Set up a test environment to closely simulate the production environment.\r\n</li>\r\n    <li>\r\n      <p>\r\n        <strong>Separate&amp;nbsp;the development and production environments. </strong>Designate a separate development environment. Remove all development elements from the production environment.&amp;nbsp;Assign different staff to the development and the production environments.</p>\r\n    </li>\r\n    <li>\r\n      <strong>Remove test data. </strong>Do not use production data for testing, especially live PANs. Remove test data and test accounts before the production system becomes active or is released to customers.</li>\r\n    <li>\r\n      <p>\r\n        <strong>Review custom code. </strong>Review all custom application code. Have someone other than the author of the code do the review. Have someone who is knowledgeable about securing coding practices do the review. Security Innovation can assist you with\r\n the code review process. Correct all the discovered bugs and vulnerabilities. Have the management evaluate the review results and approve them before releasing the code.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}