{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1473166491",
      "Content_Hash": "-1730880874"
    },
    "Metadata": [
      {
        "Id": [
          "e0e1e06b-51cf-47ae-ad7f-0cff6ff4f683"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "The Anti-virus Keeps Logs"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Anti-virus Keeps Logs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 5.2.d </li>\r\n    <li>PCI DSS Requirement 10.7</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Check that the anti-virus software keeps logs. Verify that the anti-virus logs&amp;nbsp;are kept for at least one year. Ensure&amp;nbsp;that there are&amp;nbsp;processes in place to restore at least the last three months' logs for immediate review.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to check if the anti-virus keeps logs in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Check that logging is enabled. </strong>Locate the anti-virus administration interface. Some anti-virus packages have a control panel on the systems where they are deployed and some anti-virus suites offer a centralized control panel. The number\r\n of options offered by the anti-virus interface is usually small enough that a person with an IT background can figure out what all of them are and how to use them in very short time.&amp;nbsp;The administration interface should offer an option to maintain anti-virus\r\n logs. Verify that this option is enabled. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check how long logs are kept. </strong>Check the anti-virus options to see how long the logs are kept. Ideally, the current log should be kept for at least a year by the anti-virus itself. If the anti-virus does not keep logs for at least a year,\r\n make sure there are procedures in places to keep the anti-virus logs for at least a year. If the anti-virus does not keep logs for at least three months, make sure there are processes to make at least the last three months' logs available for immediate review.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Examine&amp;nbsp;logs. </strong>Check the anti-virus logs to make sure they exist.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check centralized log server integration.</strong> Ideally, the anti-virus should be integrated with the centralized log server, and the log server should keep the logs for at least a year. Ask the anti-virus vendor about integration with your log\r\n server. Check the log server to see if it receives logs from the anti-virus.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to assure that the anti-virus keeps logs in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Enable logging.</strong> Locate the anti-virus administration interface. Some anti-virus packages have a control panel on the systems where they are deployed and some anti-virus suites offer a centralized control panel. The number of options offered\r\n by the anti-virus interface is usually small enough that a person with an IT background can figure out what all of them are and how to use them. The administration interface should offer an option to maintain anti-virus logs. If this option is not available,\r\n please consider installing and configuring a different anti-virus. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Configure the anti-virus&amp;nbsp;to retain logs for a year or more.</strong> If the software does not support storing logs for a year, configure it to store logs for at least three months. If the software does not allow storing the logs for at least three\r\n months, please consider installing and configuring a different anti-virus. If the anti-virus supports storing logs for at least three months, but not for a year, implement backup procedures to keep the anti-virus logs for at least a year.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Integrate the anti-virus with the centralized log server. </strong>Ideally, the anti-virus should be integrated with the centralized log server, and the log server should keep the logs for at least a year. Ask the anti-virus vendor about integration\r\n with your log server. Configure the anti-virus to send logs to the centralized log server by following the vendor's instructions. Consider using a different anti-virus if yours is not compatible with your log server.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/6a12327a-3bc3-4acc-af65-9145046280b9\">Deploy an Anti-Virus</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}