{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "989329577",
      "Content_Hash": "-926313140"
    },
    "Metadata": [
      {
        "Id": [
          "e4b0a063-fcc2-4e46-88a2-2f3e2ef4358d"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "System Configuration Standards Are Applied to New Systems"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "System Configuration Standards Are Applied to New Systems"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 2.2.c</li>\r\n    <li>PCI DSS Requirement 2.2.3.c</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>The system configuration standards should be applied when new systems are configured.</p>\r\n  <h1>Why</h1>\r\n  <p>The purpose of having system configuration standards is to make sure that all systems have secure configurations from the time they are deployed. To fulfill the purpose of the system configuration standards, they should be applied when new systems are being\r\n configured.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Find the staff members responsible for configuring new systems and interview them to make sure that system configuration standards are applied when new systems are configured. Examine the information security policy and verify that it states that the system\r\n configuration standards must be applied when new systems are configured. Examine a sample of system components to verify that the security standards have been applied to them during configuration.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Make sure that system configuration standards are available for all network device types.&amp;nbsp;Designate staff to be responsible for configuring new systems. Instruct the staff responsible for configuring new systems to apply the system configuration standards\r\n when new systems are configured. Add a point to the information security policy stating that the system configuration standards must be applied when new systems are configured.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/8e658b87-be17-4a53-8453-566e6a678c8b\">Prepare System Configuration Standards Using Industry Standards</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}