{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "125996469",
      "Content_Hash": "692104938"
    },
    "Metadata": [
      {
        "Id": [
          "e5e623c0-8776-4053-bba1-ac848a9327cb"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Previously Used Passwords Are Forbidden"
        ],
        "Category": [
          "Configuration"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Previously Used Passwords Are Forbidden"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 8.2.5</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>A user should not be able to use a password that is the same as any of the four previous ones when choosing a new password. This functionality is commonly known as \"password history.\"</p>\r\n  <h1>Why</h1>\r\n  <p>Not allowing old passwords to be recycled ensures that the old passwords cannot be used if they have been compromised.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to check that previously used passwords are forbidden:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Launch the \"Group Policy Management\" console. </strong>The \"Group Policy Management\" console is included in Windows 2008, but has to be downloaded and installed on Windows 2003 and 2000. The link to the download is available at the bottom of this\r\n page. To launch the \"Group Policy Management\" console, execute the \"gpmc.msc\" command.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Launch the Group Policy Object Editor.</strong>&nbsp;Navigate to the \"Group Policy Objects\" folder under the current domain, right click on the GPO and select \"Edit\".</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that the \"Password history\" policy is used.</strong> For each relevant domain, check that there is a linked group policy object that enables the \"Password History\" policy. Password history is enabled on Windows 2003 and 2008 by default and\r\n is configured to remember the last 24 passwords. The default GPO that includes this setting is called \"Default Domain Policy.\" The \"Password History\" option is located under \"Windows Settings\", \"Security Settings\", \"Account Policies\", \"Password Policy\", “Enforce\r\n password history\". Make sure that it is configured to remember at least the last four passwords.\r\n</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to assure that previously used passwords are forbidden in an Active Directory environment:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Launch the \"Group Policy Management\" console. </strong>The \"Group Policy Management\" console is included in Windows 2008, but has to be downloaded and installed on Windows 2003 and 2000. The link to the download is available at the bottom of this\r\n page. To launch the \"Group Policy Management\" console, execute the \"gpmc.msc\" command.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Edit or create a Group Policy Object (GPO).</strong> To create and activate a new Group Policy Object (GPO), launch \"The Group Policy Management\" console, right click on the domain and select \"Create and Link a GPO Here.\" To edit an existing GPO,\r\n navigate to the \"Group Policy Objects\" folder under the current domain, right click on the GPO and select \"Edit\" - this will open the \"Group Policy Object Editor.\" To change the settings of a GPO using the \"Group Policy Object Editor, navigate the folders\r\n to find the setting of interest, double click on it, set the desired option(s).</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Enable&nbsp;the \"Password history\" policy.</strong>&nbsp;The \"Password History\" option is located under \"Windows Settings\", \"Security Settings\", \"Account Policies\", \"Password Policy\", “Enforce password history\". Set the \"Enforce password history\" policy to\r\n remember at least the last four passwords.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about enforcing password policy in a Microsoft AD environment, please see \"Enforcing Strong Password Usage Througout Your Organization\" at\r\n<a href=\"http://technet.microsoft.com/en-us/library/cc875814.aspx\">http://technet.microsoft.com/en-us/library/cc875814.aspx</a> .\r\n</li>\r\n    <li>To download the \"Group Policy Management Console,\" please see \"Group Policy Management Console with Service Pack 1\" at\r\n<a href=\"http://www.microsoft.com/downloads/details.aspx?displaylang=en&FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887\">\r\nhttp://www.microsoft.com/downloads/details.aspx?displaylang=en&FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887</a>.</li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/101a5f93-cbae-4e29-804e-25a57b1011fa\">Formulate the User Authentication and Password Policies</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/f604150f-8851-48bb-9537-2f08970dc3f5\">Implement the Password Policy Using Group Policy Objects</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}