{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-916059819",
      "Content_Hash": "-1249641000"
    },
    "Metadata": [
      {
        "Id": [
          "e64a0f16-7a4f-4864-bb43-cfc86019c09b"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "An Access Control System Is Implemented"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "An Access Control System Is Implemented"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 7.2.1 </li>\r\n    <li>PCI DSS Requirement 7.2.2 </li>\r\n    <li>PCI DSS Requirement 7.2.3</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>An access control system should be implemented and it should cover all system components,&nbsp;enforce the data control policy and individual privileges, and have a default \"deny all\" setting.</p>\r\n  <p />\r\n  <h1>Why</h1>\r\n  <p>A properly configured access control system helps prevent unauthorized access.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to check if the access control system: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Check that ACLs are supported. </strong>Identify all computers and other system components that store sensitive information. Examine each system component to make sure it implements an access control system and that the access control systems are\r\n properly configured. Most modern Operating Systems and network devices implement access control systems.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Review&nbsp;data access requirements. </strong>Review the access authorization documents to make sure access privileges are explicitly defined. Verify that the data access privileges are granted based on job functions.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check the data access permissions.</strong> Verify that all the access control system implementations have a \"deny-all\" default. For a sample of users, verify that the defined access privileges match the implementation.\r\n</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to implement an access control system:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Deploy ACLs.</strong> Implement an access control system. Most modern Operating Systems and network devices implement access control systems.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Set a \"deny-all\" default.</strong> Enable the \"deny-all\" default setting on all access control systems.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Configure ACLs.</strong> Identify the access privileges for each user, using the data access authorization documents. Implement the correct data access privileges for each user.\r\n</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/a91aa3d6-f7a1-4293-809d-2fd0177a1762\">Configure the Windows Access Control System</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}