{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "637507002",
      "Content_Hash": "-141962097"
    },
    "Metadata": [
      {
        "Id": [
          "ee48bbf8-53d9-4c4f-89db-2e94be25592e"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Formulate a Storage Media Policy"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Formulate a Storage Media Policy"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 9.7 </li>\r\n    <li>PCI DSS Requirement 9.7.1</li>\r\n    <li>PCI DSS Requirement 9.7.2</li>\r\n    <li>PCI DSS Requirement 9.9</li>\r\n    <li>PCI DSS Requirement 9.9.1</li>\r\n    <li>PCI DSS Requirement 9.10</li>\r\n    <li>PCI DSS Requirement 9.10.1</li>\r\n    <li>PCI DSS Requirement 9.10.1.a</li>\r\n    <li>PCI DSS Requirement 9.10.1.b</li>\r\n    <li>PCI DSS Requirement 9.10.2</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Formulate a storage media policy to comply with PCI DSS and provide guidelines for handling storage media that&nbsp;contains sensitive information.</p>\r\n  <h1>Why</h1>\r\n  <p>A storage media policy defines procedures for secure handling of physical storage media that contains or may contain cardholder information.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to formulate a storage media policy in compliance with PCI DSS:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Require a review of the back-up storage location. </strong>Add a point to the storage media policy to require the back-up storage location to be reviewed for security at least annually.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define a media distribution policy. </strong>Identify possible scenarios that&nbsp;would require media containing sensitive information to be distributed, such as an external audit.&nbsp;Write down the correct procedures for handling each scenario and add\r\n them to the media policy. Add a point to the media policy that requires sensitive media to be classified as \"confidential.\" Add a point to the media policy that requires keeping a log of distributed media. Add a point to the media policy that requires sensitive\r\n media&nbsp;sent outside the facility to be shipped via secured courier or some other shipping method that can be tracked. Add a point to the media policy that requires sensitive media&nbsp;sent outside the facility&nbsp;to be authorized by management. Attach the media policy\r\n to the information security policy. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Keep a log of distributed media.</strong> Start a log of distributed media that includes the following information: the name of the person authorizing distribution, the name of the intended recepient, the contents of the media, the date, and any\r\n other information you consider relevant. Attach the media distribution log to the network documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define a media inventory policy. </strong>Add a point to the media policy that requires media inventory to be performed at least once a year.&nbsp;Identify all media storage devices in the cardholder data environment. Number each storage media device.\r\n For each storage device in the cardholder data environment, record its number, its location, and its description in the media inventory. Attach the media inventory to the network documentation.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define a media destruction policy. </strong>Add a point to the media policy that requires all media containing cardholder data to be thoroughly destroyed, including paper hard-copies. Acquire a shredder or an incinerator for destroying paper hard-copies\r\n or hire a company that specializes in media destruction. Acquire lockable trash bins to store sensitive media before it is destroyed. Only place discarded sensitive hard-copy media in the lockable bins. Follow the instructions in the guideline article called\r\n \"Erase Files Securely\" to destroy physical media securely. It is sufficient to erase the files on digital storage media securely before discarding such media; however, it is recommended to physically destroy the digital storage media itself with a piece of\r\n industrial equipment. Number the paragraphs and combine them into a single document. Call the document \"The Storage Media Policy,\" and add it to the information security policy.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/28ab3f5d-263e-4e1f-8c26-cef952f488f8\">Erase Files Securely</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}