{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1014774959",
      "Content_Hash": "880238433"
    },
    "Metadata": [
      {
        "Id": [
          "f41bd73a-8411-44d6-a1fa-d396a1093fea"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "New Passwords Are Unique"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "New Passwords Are Unique"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 8.2.6</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Passwords for new user accounts should be unique and changed after first use.</p>\r\n  <h1>Why</h1>\r\n  <p>Passwords for new user accounts should be unique and changed after first use to ensure that strong passwords are used and that as few people as possible know the passwords.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to check that passwords for new users accounts are unique and have to be changed after first use:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Review policy. </strong>Review the user authentication policy to make sure that it includes a requirement for the passwords for the new accounts to be unique and changed on first use.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Conduct interviews.</strong> Interview the responsible personnel to verify that procedures are in place to generate unique passwords and that the passwords must be changed after first use.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Examine the Active Directory configuration.</strong> In a Microsoft Active Directory environment, verify that when a new account is created, the box, \"User must change password at next logon,\" is checked.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to assure that passwords for new user accounts are unique and have to be changed after first use.</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Update policy.</strong> Formulate the user authentication policy based on the guideline article linked at the bottom of this page.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Generate unique passwords.</strong> Use a random password generator to generate new unique passwords. The probability of the same strong password being generated twice is so low that it is negligible.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Configure&nbsp;Microsoft Active Directory.</strong> When creating a new account, check the box that says, \"User must change password at next logon.\" If there has been no dialog that has presented such option, this option may be found by following these\r\n directions: Click on \"Start\", \"Programs\", \"Administrative Tools\", \"Active Directory Users and Computers\", navigate to the user list, right click on the new user account, select \"Properties\", select the \"Account\" tab, the \"User must change password at next\r\n logon\" checkbox will be there.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>\r\n      <p>For a random password generator, please see \"Random Password Generator\" at <a href=\"http://www.pctools.com/guides/password/\">\r\nhttp://www.pctools.com/guides/password/</a></p>\r\n    </li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <a href=\"/article/101a5f93-cbae-4e29-804e-25a57b1011fa\">Formulate the User Authentication and Password Policies</a>\r\n      </p>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}