{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1698141735",
      "Content_Hash": "529737353"
    },
    "Metadata": [
      {
        "Id": [
          "f604150f-8851-48bb-9537-2f08970dc3f5"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Implement the Password Policy Using Group Policy Objects"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Implement the Password Policy Using Group Policy Objects"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 8.5 </li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Use Group Policy Objects to implement the following password policies in a Microsoft Active Directory environment:</p>\n  <ul>\n    <li>Passwords Expire After 90 Days </li>\n    <li>Password Length </li>\n    <li>Password Complexity </li>\n    <li>Password History </li>\n    <li>Account Lockout Threshold </li>\n    <li>Account Lockout Duration </li>\n    <li>Session Time-out</li>\n  </ul>\n  <h1>Why</h1>\n  <p>Microsoft Active Directory is one of the most cost-effective ways of implementing the PCI DSS password requirements.</p>\n  <h1>How</h1>\n  <p>The password policy aspects of PCI DSS are best implemented using Microsoft Active Directory. Microsoft Active Directory allows implementing policy using Group Policy Objects.&amp;nbsp;Follow these steps to configure a PCI DSS compliant password policy using Group\n Policy Objects in an Active Directory environment:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Launch the \"Group Policy Management\" console. </strong>The \"Group Policy Management\" console is included in Windows 2008, but has to be downloaded and installed on Windows 2003 and 2000. The link to the download is available at the bottom of this\n page. To launch the \"Group Policy Management\" console, execute the \"gpmc.msc\" command.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Edit or create a Group Policy Object (GPO).</strong> To create and activate a new Group Policy Object (GPO), launch \"The Group Policy Management\" console, right click on the domain and select \"Create and Link a GPO Here.\" To edit an existing GPO,\n navigate to the \"Group Policy Objects\" folder under the current domain, right click on the GPO and select \"Edit\" - this will open the \"Group Policy Object Editor.\" To change the settings of a GPO using the \"Group Policy Object Editor, navigate the folders\n to find the setting of interest, double click on it, set the desired option(s).</p>\n    </li>\n    <li>\n      <p>\n        <strong>Implement&amp;nbsp;password strength&amp;nbsp;policies using Group Policy Objects.</strong> The default GPO that includes these settings is called \"Default Domain Policy.\" Go to \"Windows Settings\", \"Security Settings\", \"Account Policies\", \"Password Policy\".\n</p>\n      <ul>\n        <li>Under “Maximum password age,\" set the \"Maximum password age\" to 90 days or fewer.&amp;nbsp;The \"Maximum password age\" policy is set by default to 42 days on Windows 2003 and 2008.\n</li>\n        <li>Under \"Password must meet complexity requirements,\" set the \"Minimum password length\" policy requirement to 7 characters or more. The \"Minimum password length\" policy is enabled by default on Windows 2003 and 2008 and is configured to require passwords\n to be at least 7 characters long. Set the \"Password must meet complexity requirements\" setting to \"Enabled\".&amp;nbsp;The \"Password must meet complexity requirements\" policy is enabled by default on Windows 2003 and 2008 and is configured to require both letters and\n numbers in passwords. </li>\n        <li>Under “Enforce password history,” set the \"Enforce password history\" policy to remember at least the last four passwords. Password history is enabled by default on Windows 2003 and 2008 and is configured to remember the last 24 passwords.</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Implement account lockout policies. </strong>For&amp;nbsp;Account Lockout Threshold and Account Lockout Duration go to \"Windows Settings\", \"Security Settings\", \"Account Policies\", “Account Lockout\".</p>\n      <ul>\n        <li>Under \"Account lockout threshold,\" set the \"Account lockout threshold\" setting to no more than 6 failed attempts. The \"Account lockout threshold\" is not enabled by default on Windows 2003 and 2008.</li>\n        <li>Under “Account lockout duration,\" set the \"Account lockout duration\" setting to 30 minutes or more. The \"Account lockout duration\" is not enabled by default on Windows 2003 and 2008.</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Implement idle terminal locking policy.</strong> For Session Time-out create a new GPO or edit an existing one to configure these policies, which are located under \"User Configuration\", \"Administrative Templates\", \"Control Panel\", \"Display\". Set\n \"Password protect the screen saver\" policy to \"Enabled\". Set&amp;nbsp;\"Screen Saver timeout\" to 15 minutes or less. The \"Password protect the screen saver\" and the \"Screen Saver timeout\" policies are not enabled by default on Windows 2003 and 2008.</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about enforcing password policy in a Microsoft AD environment, please see \"Enforcing Strong Password Usage Throughout Your Organization\" at\n<a href=\"http://technet.microsoft.com/en-us/library/cc875814.aspx\">http://technet.microsoft.com/en-us/library/cc875814.aspx</a>.\n</li>\n    <li>To download the \"Group Policy Management Console,\" please see \"Group Policy Management Console with Service Pack 1\" at\n<a href=\"http://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887\">\nhttp://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;FamilyID=0a6d4c24-8cbd-4b35-9272-dd3cbfc81887</a>.</li>\n  </ul>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/101a5f93-cbae-4e29-804e-25a57b1011fa\">Formulate the User Authentication and Password Policies</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}