{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-812103236",
      "Content_Hash": "625830710"
    },
    "Metadata": [
      {
        "Id": [
          "f9226ce5-33c7-4e79-b59c-0e6e61a53d88"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Network Documentation Includes Descriptions of Used Ports"
        ],
        "Category": [
          "Documentation and Policy"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Network Documentation Includes Descriptions of Used Ports"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 1.1.5.a</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>The network documentation should include descriptions of all used services, protocols and ports, and why they are necessary for business.</p>\n  <h1>Why</h1>\n  <p>Documenting the services that are being used is important for designing and evaluating the firewall policy. The fewer services being used, the smaller the potential target surface that is presented to the attacker. Documenting the services necessary for\n business helps make sure that there are no services running that are not needed.</p>\n  <h1>How to Check</h1>\n  <p>Check the network documentation to make sure that it includes a list and descriptions of all used services, protocols and ports that are necessary for business. Check to see that list and descriptions match reality by checking the Internet firewall configuration.</p>\n  <h1>How to Fix</h1>\n  <p>Identify each service that is being used. Write a description of why each service is necessary for business. Identify the port and protocol used by each service. Document the port and protocol together with the description. Make sure that the network documentation\n matches the configuration of the Internet firewall.</p>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/19c8d409-b52c-44ac-b8d2-c668f32a5ec4\">Prepare the Network Documentation for PCI DSS Compliance</a>\n    </li>\n    <li>\n      <a href=\"/article/faa1bbb3-14c5-42ed-8350-534c1a8f3a4f\">Disable Unused Services and Protocols</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}