{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1934634494",
      "Content_Hash": "-1224942731"
    },
    "Metadata": [
      {
        "Id": [
          "faa1bbb3-14c5-42ed-8350-534c1a8f3a4f"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Disable Unused Services And Protocols"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Disable Unused Services And Protocols"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 2.2.2</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Disable unused services and protocols on each server. This includes disabling unused:</p>\r\n  <ul>\r\n    <li>Windows Server Roles </li>\r\n    <li>Windows Components </li>\r\n    <li>Windows services</li>\r\n    <li>Windows network protocols </li>\r\n    <li>Windows applications </li>\r\n    <li>UNIX TCP wrappers </li>\r\n    <li>LINUX daemons</li>\r\n  </ul>\r\n  <h1>Why</h1>\r\n  <p>The fewer network services that run on a server, the fewer potential vulnerabilities there are for an attacker to exploit.</p>\r\n  <h1>When</h1>\r\n  <p>The unused services and protocols should be disabled when a new server is deployed.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following tasks to disable unused services and protocols on each server:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Remove unnecessary Windows Server Roles on Windows 2008. </strong>Click on Start Menu, right click on \"Computer”, select \"Manage\", select \"Roles\", click \"Remove roles\". Remove all unnecessary roles to remove the associated network services.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Remove unnecessary Windows Components on Windows 2003.</strong> Go to \"Control Panel\", \"Add or Remove Programs\", \"Add/Remove Windows Components\". Uncheck all unnecessary Windows Components. Click \"Next\" to remove the associated network services.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Disable unused services on Windows 2003 and 2008. </strong>Click \"Start\", \"Run\", type \"services.msc\", hit \"OK\". Go through the list of services and disable the ones that are not needed. Different services are required on different versions of Windows\r\n Operating Systems. Use caution - disabling required services may render the server unusable.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Remove unused network protocols on Windows 2003 and 2008. </strong>Go to \"Network Connections.\" Right click on each active network connection and select \"Properties.\" Uncheck each unnecessary protocol and click OK.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Remove unnecessary Windows applications. </strong>Go to the \"Control Panel.\" Select \"Add or Remove Programs\" or \"Programs and Features\" in the \"Classic View.\" Identify which programs in the list are needed for server operations. Uninstall all unneeded\r\n programs by clicking the \"Uninstall\" button for each unneeded application. It is ok to leave programs necessary for server maintenance.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Remove UNIX TCP wrappers if they are not used or disable unused services.\r\n</strong>Either disable TCP wrappers altogether by making sure that inetd does not start from the start-up scripts, which are typically located in&amp;nbsp;/etc/init.d and /etc/rc.d, or configure the inetd super-daemon by editing the /etc/inetd.conf configuration file.\r\n To disable unnecessary services, comment out unneeded services by placing a # in the beginning of the corresponding line for each unneeded service.\r\n</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Disable unused Linux daemons. </strong>Some UNIX-like systems include custom server management applications. They are often very simple and present a list of checkboxes that select which daemons are enabled. Daemon is a UNIX term for a system service\r\n and also applies to a network service. Please refer to the vendor's documentation or technical support for detailed instructions on configuring network services on your Operating System.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}