{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1870441517",
      "Content_Hash": "-1801669252"
    },
    "Metadata": [
      {
        "Id": [
          "fb923c3a-18ee-4933-8d0d-534dc0c57471"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Review Custom Application Code"
        ],
        "Category": [
          "Development"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Review Custom Application Code"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PCI DSS Requirement 6.3</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Develop code in accordance with secure coding guidelines. Have code reviewed by someone else other than its author. Fix discovered vulnerabilities before the release. Ask management to approve code review results.</p>\r\n  <h1>Why</h1>\r\n  <p>Changes to application code should be reviewed to ensure that they do not introduce vulnerabilities.</p>\r\n  <h1>How</h1>\r\n  <p>Add a requirement to the information security policy that code changes should reviewed by someone other than their author(s). Add steps to the software development process for someone other than the code's author review the code. It is a good idea to have\r\n a dedicated testing team in the development environment. Add a requirement to the information security policy for code to be developed according to secure coding principles. Integrate security engineering techniques with your software development process.\r\n Information about security engineering techniques may be found in TeamMentor in the \"Security Engineering\" folder. Add a requirement to the information security policy for corrections to be implemented before release. Add steps to the software development\r\n process to fix any errors found in the code during review to be fixed before the release. Add a requirement to the information security policy for code review results to be approved by management before release. Add this requirement to the software development\r\n process.</p>"
        ]
      }
    ]
  }
}