{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1775840720",
      "Content_Hash": "-1655068850"
    },
    "Metadata": [
      {
        "Id": [
          "fd003a44-e621-44cb-9b4b-a8c01d17f876"
        ],
        "Library_Id": [
          "47a10a30-15ad-4cfd-bf82-00e9bb2037f6"
        ],
        "Title": [
          "Periodic Anti-virus Scans Are Scheduled"
        ],
        "Category": [
          "Anti-Virus"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Periodic Anti-virus Scans Are Scheduled"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>PCI DSS Requirement 5.2</li>\n    <li>PCI DSS Requirement 5.2.c</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>The anti-virus software should periodically perform scans to detect known threats.</p>\n  <h1>How to Check</h1>\n  <p>Find the master installation of the anti-virus software and make sure that it has the capability to automatically run scans when deployed. Take a sample of systems that have the anti-virus software installed and check the options to verify that automatic\n scans are scheduled. To check the anti-virus options, locate the anti-virus administration interface. Some anti-virus packages have control panels on the systems where they are deployed, and some anti-virus suites offer a centralized control panel. The number\n of options offered by the anti-virus interface is usually small enough that a person with an IT background can figure out what all of them are and how to use them quickly. The administration interface typically has an option to enable automatic scans and set\n the exact type of the periodic scan. A full scan is usually too time-consuming, so a \"quick-scan\" that checks the most important system locations is usually sufficient. An occasional full-scan may still be a good idea. Check the logs to make sure that the\n automatic scans are taking place.</p>\n  <h1>How to Fix</h1>\n  <p>Verify that it is possible to run automatic scans with your anti-virus by referring to the vendor documentation or technical support. The documentation or technical support should provide the exact instructions on how to implement automatic scans. Automatic\n scans are a basic feature of modern anti-virus packages. If your anti-virus does not offer this feature, please consider installing and configuring a different anti-virus.</p>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/6a12327a-3bc3-4acc-af65-9145046280b9\">Deploy an Anti-Virus</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}