{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000023f8a3"
        ],
        "Id_History": [
          "00000000-0000-0000-0000-00000023f8a3,8c52b999-1ae9-44a6-8a30-fbec40026825,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Error Information Is Logged"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Error Information Is Logged"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET\r\n\r\n==What to Check For==\r\n\r\nVerify that error information is being logged. Make sure that error logs include sufficient information to identify the time, the source, and the nature of the errors. \r\n\r\n==How to Check==\r\n\r\nTo make sure that error information is being logged.\r\n\r\n# **Identify error handlers.** Enumerate all the code that handles application errors. There may be a considerable amount of this code, which is a good thing. It should be alarming if there is very little error handling code.\r\n# **Check error handlers.** Review error handling code to make sure that it includes instructions that log error information. Verify that relevant information about the errors is being recorded, such as time-stamps, resources being accessed and the active username.\r\n# **Check error logs.** Examine the error logs generated by the application to make sure they include relevant information.\r\n\r\n==How to Fix==\r\n\r\nTo log error information:\r\n\r\n# **Identify the logging subsystem.** Logging is one of the essential security components of an application. Find the logging functions that are provided by the application. Review them to figure out how they work and where they store the error files.\r\n# **Identify error handling code.** Enumerate all the code that handles application errors. There may be a considerable amount of this code, which is a good thing. It should be alarming if there is very little error handling code.\r\n# **Determine relevant error details.** For each block of error handling code, determine the information that should be logged to help debug the error. Make sure to include time-stamps. It may be helpful to log the active username and the accessed resources as applicable to help identify attacks.\r\n# **Add logging code to error handling routines.** Add code that records the relevant information to the  error handlers. "
        ]
      }
    ]
  }
}