{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "834504741",
      "Content_Hash": "675854995"
    },
    "Metadata": [
      {
        "Id": [
          "218355a9-ee09-4c82-b025-8cd1d0739b34"
        ],
        "Id_History": [
          "218355a9-ee09-4c82-b025-8cd1d0739b34,0df7b045-79b3-4f4e-a4e4-748c0ef74872,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Apply Security Design Guidelines"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Apply Security Design Guidelines"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Use proven design practices, patterns, and principles to avoid many of the vulnerabilities introduced by poor design choices. By adopting proven design principles and learning from other's mistakes you can ensure your application is secure from the start.</p>\r\n  <h1>Why</h1>\r\n  <p>Adopting security design guidelines can help reduce your attack surface by addressing common vulnerabilities, allowing you to focus on the unique aspects of your design.</p>\r\n  <h1>When</h1>\r\n  <p>Apply security design guidelines during the architecture and design stage of the development life-cycle.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to prepare security design guidelines for use in your project:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Establish guidline quality requirements.</strong> Each guideline must meet the following qualifications before it is included:</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Actionable.</strong> Must be associated with a vulnerability that can be mitigated through the use of the guideline.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Relevant.</strong> Must be associated with a vulnerability that is known to affect real applications.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Impactful.</strong> Must represent key engineering decisions that will have a wide ranging impact.</p>\r\n            </li>\r\n          </li>\r\n        </li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Identify relevant categories of vulnerabilities.</strong> Design guidelines are organized by the common application vulnerability categories, including input / data validation, authentication, authorization, configuration management, sensitive data, cryptography, exception management and auditing and logging. These represent the key areas for application security design, where mistakes are most often made. </p>\r\n        <li>\r\n          <p>\r\n            <strong>Identify application-specific guidelines.</strong> Depending on the application being designed, the types of issues that must be addressed vary. For example, when you design a secure Web application, it is important that you follow guidelines to ensure effective user authentication and authorization, to protect sensitive data as it is transmitted over public networks, and to prevent attacks such as session hijacking. When you design a secure, smart client application, the set of guidelines changes to address the most important threats for this application type. </p>\r\n          <li>\r\n            <p>\r\n              <strong>Identify deployment considerations.</strong> During the application design phase, you should review your corporate security policies and procedures together with the infrastructure that your application is to be deployed on. Frequently, the target environment is rigid, and your application design must reflect the restrictions. In some cases, you may need to make design tradeoffs; for example, because of protocol or port restrictions or specific deployment topologies. Identify constraints early in the design phase to avoid surprises later, and involve members of the network and infrastructure teams to help with this process.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Prepare the security frame.</strong> Distill the set of guidelines into a pattern-based security frame, or framework, that describes all of the areas in which poor design can lead to security vulnerabilities. The security frame allows the inclusion of additional guidelines or the refinement of existing guidelines based on newly discovered vulnerabilities. The security frame is a pattern-based information model that defines a set of security-related categories specifically for the application type you are designing. These categories represent the areas where security mistakes are most often made.</p>\r\n            </li>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information, see &#8220;Chapter 4, Design Guidelines for Secure Web Applications&#8221; at <a href=\"http://msdn.microsoft.com/library/default.asp?url=/library/en-us/dnnetsec/html/THCMCh04.asp\">http://msdn.microsoft.com/library/default.asp?url=/library/en-us/dnnetsec/html/THCMCh04.asp</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}