{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "534467449",
      "Content_Hash": "1437440254"
    },
    "Metadata": [
      {
        "Id": [
          "497597e5-4f03-48f1-83c7-c3cd5356d17e"
        ],
        "Id_History": [
          "497597e5-4f03-48f1-83c7-c3cd5356d17e,c3945953-102e-4d2b-b67f-cba6b609f611,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Allow Only Trusted Hosts to Connect to Database Server"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Allow Only Trusted Hosts to Connect to Database Server"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Prevent direct access to your database server.</p>\r\n  <h1>Why</h1>\r\n  <p>Direct access allows an attacker to use tools such as Query Analyzer (Isqlw.exe) and establish a connection to the SQL Server and issue commands. This could lead to unauthorized access to data.</p>\r\n  <h1>When</h1>\r\n  <p>When using a SQL backend with your application.</p>\r\n  <h1>How</h1>\r\n  <p>To restrict access to your SQL Server:</p>\r\n  <ul>\r\n    <li>\r\n      <p>\r\n        <strong>From the outside</strong>: Configure the firewall to make sure that SQL Server ports (TCP 1433 and UDP 1434 by default) are not visible from outside of the perimeter network. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>From within the perimeter</strong>: Restrict direct access by unauthorized internal hosts via internal firewalls when available, and by using IPSec and port filtering. IPSec can be used for computer authentication in addition to encryption and can be used to ensure that only the specific application server can connect to the database server, in order to prevent attacks from other computers.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Minimize exposure</strong>: The production database server should only be accessible from the application server(s) it works with and a minimum set of other maintenance systems for monitoring, external logging, backup, and administration. Development and production systems should not share the same database server, and development machines should not have access to the production servers.</p>\r\n    </li>\r\n  </ul>\r\n  <h1>Problem Example</h1>\r\n  <p>A financial firm uses a web application to allow its agents to interact with the company database. To prevent attackers, the firm uses a firewall which restricts attackers from accessing the database server. However, one of the workstations inside the firewall gets infected with malware. This workstation is exploited by attackers to scan the internal network. When the attackers discover the SQL Server, they use tools such as the Query Analyzer to connect to and issue commands to it, using the compromised workstation as a proxy.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>A financial firm uses a web application to allow its agents to interact with the company database. To prevent outside attackers the firm uses a firewall and to prevent internal threats to the database the firm uses IPSec to restrict access. Now when one of the workstations inside the firewall gets infected with malware and is exploited by attackers to scan the internal network, the attackers will not discover the SQL Server and will not be able to connect or issue commands to it.</p>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}