{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "2056015373",
      "Content_Hash": "-642525802"
    },
    "Metadata": [
      {
        "Id": [
          "07732230-8869-45d1-b65c-278142d32f31"
        ],
        "Id_History": [
          "07732230-8869-45d1-b65c-278142d32f31,1b916b02-578b-43b5-8390-45ec2ef35d71,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Buffer Size Is Checked During Copying"
        ],
        "Category": [
          "Memory Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Buffer Size Is Checked During Copying"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>C&#43;&#43;</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>Verify that all functions that copy data between strings or arrays check boundaries of the destination buffers to prevent buffer overflows.</p>\n  <h1>Why</h1>\n  <p>Copying more data than a buffer can fit results in a buffer overflow.</p>\n  <h1>How to Check</h1>\n  <p>Perform the following actions to assure that buffer size is checked during copying:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify all functions that copy data to strings or arrays.</strong> List the components, modules, and libraries that do the most amount of data handling. Usually there exists some code heavy on manipulating data that copies many buffers or constructs various strings.</p>\n      <li>\n        <p>\n          <strong>Verify that memory size is calculated correctly.</strong> Watch out for using sizeof() on pointers. When an array is passed as a parameter, it is passed as a pointer, and sizeof() returns the size of a pointer, not the array. Make sure that code accounts for the trailing null if data is stored in a null-terminated string.</p>\n        <li>\n          <p>\n            <strong>Verify that errors during memory allocation are handled.</strong> Memory allocation might fail, so the copying function should account for that possibility.</p>\n          <li>\n            <p>\n              <strong>Verify that bounds are checked during copying.</strong> Only copy the amount of data that fits into the buffer. There should be sufficient memory allocated if the size of data has been calculated correctly, but for extra security it is a good idea to write code that checks buffer bounds while copying to prevent buffer overflows. Data that doesn't fit into the buffer should be truncated -&nbsp;code that copies data should terminate once the buffer is full.</p>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Perform the following steps to assure that your code allocates enough buffer space when copying data to prevent buffer overflows:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify all functions that copy data to strings or arrays.</strong> List the components, modules, and libraries that do the most amount of data handling. Usually there exists some code heavy on manipulating data that copies many buffers or constructs various strings.</p>\n      <li>\n        <p>\n          <strong>Calculate the amount of memory that is used by data being copied or set a maximum size limit for valid data.</strong> Make sure to include a trailing null if a null-terminated string is being copied. When calculating the size of data, count the amount of memory it uses, not the amount of elements in the array. Be careful when using the sizeof() function, because it returns the size of a pointer when an array containing data is passed as a parameter to the function. The memory size of data should be calculated beforehand, ideally in the same scope in which the data structure containing data is declared, and passed as an argument to the function that does the copying.</p>\n        <li>\n          <p>\n            <strong>Allocate memory for the buffer.</strong> Once the amount of memory needed to fit all the data is determined, allocate an array or a string of a sufficient size. Write code to handle possible memory allocation errors.</p>\n          <li>\n            <p>\n              <strong>Check bounds when copying.</strong> Use the size of the allocated array or string when copying to assure that only the amount of data that fits into the array is copied. This should always be the case if the amount of memory to allocate is calculated correctly, but for extra security it is a good idea to write code in a way that truncates data if it doesn't fit into the buffer.</p>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about verifying that data is copied to sufficiently large storage, please see \"ARR33-C. Guarantee that copies are made into storage of sufficient size\" at <a href=\"https://www.securecoding.cert.org/confluence/display/seccode/ARR33-C.&#43;Guarantee&#43;that&#43;copies&#43;are&#43;made&#43;into&#43;storage&#43;of&#43;sufficient&#43;size\">https://www.securecoding.cert.org/confluence/display/seccode/ARR33-C.&#43;Guarantee&#43;that&#43;copies&#43;are&#43;made&#43;into&#43;storage&#43;of&#43;sufficient&#43;size</a></li>\n  </ul>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/54ee5a30-738f-4ca6-a1eb-ab6e58152f7b\">Get the Size of an Array Correctly</a>\n      <li>\n        <a href=\"/article/bf5f6cb5-4a28-496f-9023-9e521e7dac6d\">How to Test for Buffer Overflow Vulnerabilities</a>\n      </li>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}