{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "97355065",
      "Content_Hash": "1262801737"
    },
    "Metadata": [
      {
        "Id": [
          "0d7d5d60-33bc-4fac-a088-f0be84d37cef"
        ],
        "Id_History": [
          "0d7d5d60-33bc-4fac-a088-f0be84d37cef,68897de4-648f-4bee-95e1-8306ffe15166,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Authentication And Authorization Are Required for All Sensitive Pages"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Authentication And Authorization Are Required for All Sensitive Pages"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>Java</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>Verify that authentication and authorization are required for all sensitive pages.</p>\n  <h1>Why</h1>\n  <p>All pages that have private information should require authentication and authorization to prevent unauthorized information disclosure. Use role-based authorization policies because they are relatively simple to manage correctly.</p>\n  <h1>How to Check</h1>\n  <p>To verify that authentication and authorization are required for all sensitive pages:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify all sensitive pages.</strong> Make a list of all pages that handle sensitive or private information.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that all sensitive pages require authentication.</strong> Visit each sensitive page with a web browser to make sure it requires authentication.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that all sensitive pages require authorization.</strong> Make a list of all available roles for testing role-based authorization. Visit each sensitive page authenticated as a member of each role to verify that authorization is implemented correctly.</p>\n    </li>\n    <li>\n      <p>\n        <strong>(Optional) Verify that authentication and authorization are implemented on the server correctly.</strong> The goal of this checklist is to verify that all sensitive pages are covered by authentication and authorization controls. If additional assurance is required, it may be helpful to review the application in depth. To do so: identify authentication and authorization libraries being used, verify that the web application server is configured correctly for the chosen authentication and authorization methods and that all sensitive pages are covered, review each sensitive page to make sure authentication and authorization features are used correctly, and review code used by each sensitive page to make sure that it uses authentication and authorization correctly. These tasks may be quite time consuming and may not be necessary to verify that all sensitive pages are protected by the authentication and authorization controls.</p>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>To require authentication and authorization for all sensitive pages:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify all sensitive pages.</strong> Make a list of all pages that handle sensitive or private information.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Define roles.</strong> Define access roles for your application. These roles should include administrative users and various types of users specific to your application.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Implement authentication and role-based access control.</strong>&nbsp; </p>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}