{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1279628643",
      "Content_Hash": "172749481"
    },
    "Metadata": [
      {
        "Id": [
          "125214b6-625a-4ebb-8e31-b1f00adc51ec"
        ],
        "Id_History": [
          "125214b6-625a-4ebb-8e31-b1f00adc51ec,6e61a534-822e-4725-87e9-f80924237be2,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Input Validation Is Centralized"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Input Validation Is Centralized"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>C&#43;&#43;</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>Verify that input validation functions are organized in a dedicated class or library.</p>\n  <h1>Why</h1>\n  <p>Centralizing input validation helps ensure that data is validated in a consistent way throughout the application and provides a single point of maintenance.</p>\n  <h1>How to Check</h1>\n  <p>Use the following steps to verify that input validation is centralized:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Find the input validation subsystem.</strong> Examine the application structure with a&nbsp;focus on input and data validation functions to verify that a dedicated class or library exists for input and data validation functions. </p>\n      <li>\n        <p>\n          <strong>Verify that input is constrained, rejected, and sanitized.</strong> Examine the validation functions to make sure they constrain known valid input first, then reject known bad input, and sanitize the resulting data.</p>\n        <li>\n          <p>\n            <strong>Verify that trust boundaries are identified.</strong> Examine documentation to verify that trust boundaries between components are identified. Use this information to verify that all input is explicitly validated at the boundaries.</p>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Perform the following actions to assure that all input is validated:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Centralize validation.</strong> When you develop an input- and data-validation architecture for your application, consider developing a library of validation routines in all but the smallest applications. This will help ensure that data is validated in a consistent way throughout the application and provide a single point of maintenance. You need to trace data from entry point to exit point to know how it should be validated. A good library includes routines for all of the different types of validation you need to apply, and these can be used in combination if necessary. </p>\n      <li>\n        <p>\n          <strong>Constrain, reject, and sanitize input.</strong> Constrain what you allow from the beginning. It is much easier to validate data for known valid types, patterns, and ranges (using a white list) than it is to validate data by looking for known bad characters (using a black list). When you design your application, you know what your application expects. The range of valid data is generally a more finite set than the range of potentially malicious input. However, for added defense you might want to reject known bad input and then sanitize the input. Constrain input for type, length, format, and range. Use regular expressions to help constrain text input. Use strong data typing where possible. </p>\n        <li>\n          <p>\n            <strong>Identify trust boundaries.</strong> Ensure that entry points between trust boundaries validate all input data explicitly. Make no assumptions about the data. The only exception is inside a routine that you know can only be called by other routines within the same trust boundary. </p>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/cc81757b-6da5-4463-92f9-d27f680ad6c7\">Centralize Input Validation</a>\n      <li>\n        <a href=\"/article/3de41277-0cc1-4ebc-8dd7-e96d161aa0ef\">Validate All Input</a>\n        <li>\n          <a href=\"/article/004526a6-5b2f-4094-94fa-a80d818c0a41\">Canonicalize All Input Used to Identify Resources</a>\n          <li>\n            <a href=\"/article/62ed6d49-ca67-492a-b3ed-14c18bb8d906\">Use Helper Classes to Assure Input Validation</a>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}