{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "339313805",
      "Content_Hash": "710465133"
    },
    "Metadata": [
      {
        "Id": [
          "14a7c12b-46dd-4ee5-9ebf-8b9497ab7ce3"
        ],
        "Id_History": [
          "14a7c12b-46dd-4ee5-9ebf-8b9497ab7ce3,710f6680-1a52-4395-9d4c-555ec903eea3,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Accounts Are Locked After Multiple Failed Authentication Attempts"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Accounts Are Locked After Multiple Failed Authentication Attempts"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure that accounts are locked after consecutive failed login attempts. </p>\n  <h1>Why</h1>\n  <p>Multiple, consecutive failed authentication attempts over a short period of time are a symptom that is used to detect when an account is under attack. Locking out the account prevents the attacker from compromising and accessing the account.</p>\n  <h1>How to Check</h1>\n  <p>Follow these steps to ensure your application will lock out an account after consecutive failed login attempts:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Verify that your application has a lockout policy.</strong> An account lockout policy is typically application specific. Review your application's requirements and design specifications and verify the following functionality:</p>\n      <ul>\n        <li>A mechanism for determining failed authentication attempts </li>\n        <li>A mechanism for locking accounts that have exceeded the maximum number of allowed authentication attempts </li>\n        <li>A mechanism for unlocking accounts that have exceeded the maximum number of allowed authentication attempts </li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Ensure your application tracks login attempts.</strong> All authentication procedures record the number of authentication attempts for each user. The login counter for each user should be reset to 0 upon a successful authentication</p>\n    </li>\n    <li>\n      <p>\n        <strong>Ensure your application enforces the lockout policy.</strong> All authentication procedures implement your application's lockout policy. The implementation should match the lockout policy as the business requirements of your organization may change over time</p>\n    </li>\n    <li>\n      <p>\n        <strong>Test the application.</strong> Use a web browser to test authentication to make sure that repeated failed authentication attempts result in the user account being locked.</p>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Use the following steps to successfully lock accounts after consecutive failed login attempts:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Define a lockout policy.</strong> There are two variables to consider when determining a lockout policy:</p>\n      <ul>\n        <li>Number of allowed consecutive failed login attempts </li>\n        <li>Amount of time that a locked account will remain locked </li>\n      </ul>\n      <p>A simple policy would be to lock an account after five failed login attempts for the duration of 15 minutes. Although this is an effective method for blocking a brute force attack, it exposes your application to denial of service as an attacker can easily keep an account locked through a small stream of authentication requests.</p>\n      <p>When determining the lockout policy, it is important to evaluate the risk of attacks against the user and the support costs associated with reactivating a locked account. For example, requiring the user to contact your organization's support staff to reactivate a locked account will have a direct impact on support costs and would add general user frustration. However, it is important to use extra care when designing more sophisticated variations of your application's lockout policy, such as correlating a single or multiple user login attempts with a source IP. When adding extra levels of complexity, carefully consider and evaluate the scenarios where your application's lockout policy can be circumvented or can harm your business. For instance, consider scenarios where an attacker would attempt to compromise a user through the use of multiple hosts, or multiple users would authenticate using a shared office IP.</p>\n      <p>\n        <strong>Note:</strong> PCI DSS requirements state that an account should be locked out for at least 30 minutes after no more than six failed login attempts.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Track login attempts.</strong> Login attempts can be tracked with the use of a login counter. Increment the counter once a user tries to authenticate. Reset the counter to 0 after the user successfully authenticates. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Enforce the lockout policy.</strong> The lockout policy should be enforced at all points in the application where authentication is necessary. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Set an unlocking mechanism.</strong> Keep track of the lockout period. Based on your application's lockout policy, unlock the account after the lockout period has expired.</p>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}