{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1934057426",
      "Content_Hash": "465276161"
    },
    "Metadata": [
      {
        "Id": [
          "1844d70b-41f7-4be1-9e78-95084c720b03"
        ],
        "Id_History": [
          "1844d70b-41f7-4be1-9e78-95084c720b03,1dc979fb-4a9b-49fb-b6ad-909fdcd1e996,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use of Privileged Accounts Is Monitored"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Use of Privileged Accounts Is Monitored"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure your application</p>\n  <ul>\n    <li>monitors use of privileged accounts </li>\n    <li>logs all activities performed under their credentials</li>\n  </ul>\n  <h1>Why</h1>\n  <p>Privileged accounts by their nature are allowed to do damaging activities. If compromised, they can cause the most damage. Close monitoring can catch unauthorized and/or malicious activities and help minimize&amp;nbsp;any damage done.</p>\n  <h1>How to Check</h1>\n  <p>To check if your application monitors privileged accounts activities, follow these steps:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify the privileged users and roles. </strong>For the purposes of security monitoring, privileged accounts are those that can cause more damage than other users. Check for both privileged users and roles (Administrator or the Administrator's group, among others, or root and wheel on a Unix environment). This will vary by application and roles defined, however, some examples are:</p>\n      <ul>\n        <li>Administrators </li>\n        <li>Power users </li>\n        <li>Team leaders</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Identify potentially dangerous activities. </strong>Enumerate all activities enabled by the privileged accounts identified above. Some of the common activities include, but are not limited to:</p>\n      <ul>\n        <li>Add, delete, and modify user accounts </li>\n        <li>Add, delete, and modify database tables </li>\n        <li>Install or remove applications </li>\n        <li>View or modify application configuration settings </li>\n        <li>View log files </li>\n        <li>View or modify source code</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Ensure all activities are logged. </strong>Identify areas of code that perform privileged activates as identified from step 2 above. Verify that all activities, including successful and failed operations, are logged. Use the checklist <a href=\"/article/8dfc3d3e-7a00-4273-bd89-ff918f5eb8fb\">Important Security Operations are Logged</a> to aid you in this process. Additionally, ensure that privileged events are logged in the following manner: </p>\n      <ul>\n        <li>Separately in files that are not accessible to lower privileged users </li>\n        <li>With higher alert/severity levels</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Audit the logs. </strong>Audit your application's logs regularly. Logs are the first and sometimes only place that security problems can be discovered. Use your logs to detect problems early and prevent them instead of for forensics. Verify that:</p>\n      <ul>\n        <li>The application's security policy includes scheduled log audits </li>\n        <li>Logs are being audited regularly </li>\n        <li>Information in log files is marked and categorized during audits </li>\n        <li>Suspicious activity is investigated</li>\n      </ul>\n    </li>\n  </ol>\n  <p>If there are no available logs to audit, use your application to generate enough logged sample data from the application's components that require privileged accounts. Then perform an audit to verify that the logging mechanisms have been set up correctly.</p>\n  <h1>Problem Example</h1>\n  <p>MyApp is a multi-user financial application. The application records all basic security related operations for all users. Unfortunately, it fails to monitor all authorizations that accompany the transactions of large financial assets, an action for which a privileged account is needed. Therefore it is impossible to trace financial fraud to the responsible user.</p>\n  <br />\n  <hr />\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}