{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1054275736",
      "Content_Hash": "-1425826965"
    },
    "Metadata": [
      {
        "Id": [
          "1aeff70c-48c1-4ef2-84a4-49997dcdb1d6"
        ],
        "Id_History": [
          "1aeff70c-48c1-4ef2-84a4-49997dcdb1d6,ce84fca0-1a09-4ea2-bed8-57d3b8faebda,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Sensitive Data Is Not Cached"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Sensitive Data Is Not Cached"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure that your application does not cache sensitive data at any level.</p>\r\n  <h1>Why</h1>\r\n  <p>Output caching is usually done on the client, and that has serious security implications if the page being cached has sensitive data. Output caching is similar in impact to storing sensitive data in cookies. The data may persist on the client machine, on proxy servers or on the web server. Due to this fact, it leaves interesting data available to attackers should the devices caching the data be compromised.</p>\r\n  <h1>How To Check</h1>\r\n  <p>To make sure that sensitive data is not cached:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify sensitive data.</strong> Sensitive data is any information that is kept secret and should be disclosed only to authorized parties. Common examples of sensitive data include, but are not limited to, names of customers, government issued ID numbers, credit card and other financial information, passwords, and private keys. Some industries, such as health care and banking, have regulatory standards that define sensitive information. Use regulatory requirements, as they apply to your application, to identify sensitive data. Sensitive data can be defined as follows:</p>\r\n      <ul>\r\n        <li>Information that either contains personally identifiable information or can be used to derive personally identifiable information that should not be shared with others. </li>\r\n        <li>Information that a user provides that they would not want shared with other users of the application. </li>\r\n        <li>Information that comes from an external trusted source that is not designed to be shared with users. </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that HTTP headers are used to prevent caching.</strong> Your application can use certain HTTP headers to prevent certain content from being cached. Ensure that the following techniques are used:</p>\r\n      <ul>\r\n        <li>Verify that sensitive content contains the header \"<em>Pragma: No-Cache</em>\" in the outputted HTML document. Example: <p /><pre>&lt;HTML&gt;<br />&nbsp;&nbsp;&nbsp; &lt;HEAD&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;HTTP-EQUIV=\"PRAGMA\" CONTENT=\"NO-CACHE\"&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ...<br />&nbsp;&nbsp;&nbsp; &lt;/HEAD&gt;<br />&nbsp;&nbsp;&nbsp; &lt;BODY&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ...<br />&nbsp;&nbsp;&nbsp; &lt;/BODY&gt;<br />&lt;/HTML&gt;</pre></li>\r\n        <li>Verify that your application includes the \"<em>Cache-Control: no-cache</em>\" header in the outputted HTTP response. Example: <p /><pre>Response.Cache.SetCacheability(HttpCacheability.NoCache);</pre></li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that output caching is disabled.</strong> Make sure that all pages in your application that contain sensitive information have output caching turned off by adding the <em>@OutputCache</em> directive as follows:</p>\r\n      <pre>&lt;%@ OutputCache Location=\"None\"%&gt;</pre>\r\n      <p>If your application uses its own internal custom data caching layers they must also be designed so that sensitive data is not cached.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that sensitive data is not stored in hidden fields or script variables.</strong> Check all hidden fields and client-side scripts in your application. Verify that no sensitive data is stored in a hidden field or a script variable. Ensure all sensitive data that needs to be passed back to the application is stored inside server-side sessions. An example of storing sensitive data into hidden fields:</p>\r\n      <pre>&lt;input type=\"hidden\" name=\"ccNum\" value=\"4111111111111111\"&gt; </pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that sensitive data is not cached within the application or in the database unless it is stored securely. </strong>Trace the paths that sensitive data takes through the system, paying particular attention to places where it may be combined with less sensitive data; mixed data is still just as sensitive, but is often handled like non-sensitive data. In each place where sensitive data is persisted, even temporarily, ensure that it is cleaned up after use and that access is controlled appropriately. If data is persisted beyond what is needed for immediate use, refactor the system so that only non-sensitive data is cached, or store the data in the cache securely (for example, encrypt it).</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How To Fix</h1>\r\n  <p>Output caching is off by default and must be explicitly turned on in order to be activated. There are two ways that output caching can be turned on: high-level declarative API, or low-level programmatic API. The high-level declarative API is used by including the <em>@OutputCache</em> directive in the .aspx file for a page. The low-level programmatic API is used through the<em> Page.Response.Cache</em> property which returns an instance of the <em>HttpCachePolicy</em> class.</p>\r\n  <p>Use the following steps to ensure that sensitive data is not cached:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Review pages for sensitive data.</strong> Review all of your pages for instances of sensitive data. This could include, but is not limited to:</p>\r\n      <ul>\r\n        <li>Information that either contains personally identifiable information or can be used to derive personally identifiable information that should not be shared with users. </li>\r\n        <li>Information that a user provides that they would not want shared with other users of the application. </li>\r\n        <li>Information that comes from an external trusted source that is not designed to be shared with users.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Review the pages for declarative Output Caching.</strong> Review the pages discovered in step 1 for the use of the <em>@OutputCache</em> directive. If it exists, remove it.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Review the pages for programmatic Output Caching.</strong> Review the pages discovered in step 1 for the use of the <em>HttpCachePolicy</em> class. Generally this is accessed through the <em>Page.Response.Cache</em> property.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <em>You may find these additional articles useful</em>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/ae1f457b-c3ef-4d5f-9471-ae793137e07e\">Do Not Cache Sensitive Data</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>\r\n  <h1>\r\n  </h1>\r\n  <h1>\r\n  </h1>"
        ]
      }
    ]
  }
}