{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-410254653",
      "Content_Hash": "598770812"
    },
    "Metadata": [
      {
        "Id": [
          "222800fe-aa5f-404e-a4b4-878d6e0c68d2"
        ],
        "Id_History": [
          "222800fe-aa5f-404e-a4b4-878d6e0c68d2,41610c4c-c043-4b65-80b6-e74c1326a7eb,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "A Strong Application Architecture Is Used"
        ],
        "Category": [
          "Design Considerations"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "A Strong Application Architecture Is Used"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Verify that a strong application architecture is used.</p>\r\n  <h1>Why</h1>\r\n  <p>Compartmentalizing software allows you to limit the amount of damage that can be done to a system. You can divide the system into a collection of isolated units so that even if one component is breached, the entire system is not compromised. Compartmentalization separates resources, data, users, and processes from one another.</p>\r\n  <h1>How to Check</h1>\r\n  <p>To verify that a strong application architecture is used:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that users are compartmentalized.</strong> Identify code that handles authorization. Review code to make sure that role-based authorization is used.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that processes are compartmentalized.</strong> Review project documentation to make sure that the application is separated into a number of functional modules based on security requirements. Review code to make sure that the implementation matches the design.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that data is compartmentalized.</strong> Review project documentation to make sure that data is stored in different locations based on security requirements by design. Review code to make sure that the implementation matches the design.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Designing an application architecture is best done in the early stages of the project. Later on, the architecture can be strengthened gradually over time. To provide separation between components:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Compartmentalize users.</strong> You should never provide the same set of permissions on application resources to different users. The separation of users ensures that even if one user's account is compromised, other accounts remain secure. Use role-based and user-based authorization to enforce separation of users. For role-based authorization, the roles need to be defined. Additionally, you need to determine the type of resources that can be accessed by a group of users. For user-based authorization, determine the type of resources that can only be accessed by specific users.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Compartmentalize processes.</strong> Break your applications into a collection of well-defined functional components. Each of these components should have its own specific purpose. This separation applies even more when dealing with critical operations and processes, such as credit card transactions. If the application is not properly compartmentalized, a failure or breach in one process can compromise the application and its assets.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Compartmentalize data.</strong> Data should be stored separately depending on its sensitivity and purpose:</p>\r\n      <ul>\r\n        <li>Store data in a database on a nonpublicly accessible machine. </li>\r\n        <li>Place Web-root on a separate partition from OS installation. </li>\r\n        <li>Segment data by the authorization level required to access it (database tables, config files, Web folders). </li>\r\n        <li>Separate databases/tables for storing different types of data and create different database users with privileges limited to their needs. </li>\r\n        <li>On the file system, assign permissions carefully, granting only the privileges a given process needs.</li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <br />"
        ]
      }
    ]
  }
}