{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "638883277",
      "Content_Hash": "951840876"
    },
    "Metadata": [
      {
        "Id": [
          "289a4fc3-adf1-4c11-a95d-51bfe1ab9726"
        ],
        "Id_History": [
          "289a4fc3-adf1-4c11-a95d-51bfe1ab9726,d4de8c71-dad3-4be9-b3d6-4c5ec31f4e9d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "User Accounts Can Be Managed"
        ],
        "Category": [
          "Administration"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Authentication And Authorization Policies Are Configurable"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nMake sure that user accounts can be managed.\r\n\r\n## Why ##\r\n\r\nAn interface to manage user accounts is essential for performing essential security-related administrative tasks and enabling role-based authorization. Authorization controls typically need to be configured during deployment according to the principle of least privilege and an administrative interface is essential for this.\r\n\r\n## How To Check ##\r\n\r\nTo make sure that user accounts can be managed:\r\n\r\n1. **Identify application requirements.** At the very least, there should be an administration interface for managing user accounts and role membership, and an interface for users to manage their own accounts.\r\n2. **Identify administrative interface(s).** Find the administrative interface that is used to manage user accounts.\r\n3. **Review the administrative interface.** Test the functionality of the administrative interface to make sure it satisfies the application requirements.\r\n\r\n## How to Fix ##\r\n\r\nTo implement an administrative interface that allows managing user accounts.\r\n\r\n1. **Identify application requirements.** Define options for configuring access control and authentication policies. At the very least, there should be an administration interface for managing user accounts and role membership, and an interface for users to manage their own accounts.\r\n2. **Make application code configurable.** Find all code responsible for authentication and authorization features. Modify this code to read settings configured by the administrative interface.\r\n3. **Design the administrative interface.** Design the interface to be used for configuring user role membership.\r\n4. **Implement the administrative interface.** Write code for the administrative interface. The administration interface should be able to read and write settings to a secure location, where the application code may access them. The saved settings should be protected with access controls to prevent unauthorized disclosure and tampering.\r\n"
        ]
      }
    ]
  }
}