{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "620670489",
      "Content_Hash": "-894660194"
    },
    "Metadata": [
      {
        "Id": [
          "2e3eb764-6dc5-4715-a4af-d89a5aff0125"
        ],
        "Id_History": [
          "2e3eb764-6dc5-4715-a4af-d89a5aff0125,3b53248d-76ae-4d92-a535-5da50c756931,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Log Files Are Protected"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Log Files Are Protected"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure log files are protected.</p>\r\n  <h1>Why</h1>\r\n  <p>Log files often contain internal application details that could enable an attacker to more effectively target your application.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use these steps to ensure log files are protected:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that the&amp;nbsp;log location is not disclosed. </strong>Scan your application's code base to verify that the location of the log files is known only to the internal logging framework.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check the file permissions of logs. </strong>Verify that the logs are set with the appropriate filesystem permissions. All entities, excluding your application and its administrators/developers, must be prohibited access to the logs. If your application backs up its logs, verify that log backups are stored into an environment that is as secure as the storage environment for the current logs.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check for common logging mistakes. </strong>Scan your application's code base for common logging mistakes such as:</p>\r\n      <ul>\r\n        <li>Logging data structures that contain user-supplied data </li>\r\n        <li>Appending user-supplied data to an exception's message and/or details </li>\r\n        <li>Opening logs in \"write\" mode and not in \"append\" mode</li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <p>\r\n    <strong>Note:</strong> PCI DSS certification requires that all access to the logs is logged, that logs muct be promptly backed up to a centralized log server or media that is difficult to alter, and logs should be reviewed regularly to watch for suspicious activity that could indicate access by an attacker.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>Use the following steps to protect the application's log files: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Avoid disclosing location of logs. </strong>The location of the log files should be known only by your application and its administrators. Avoid disclosing the location of the logs to users.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Set appropriate file permissions. </strong>Set the filesystem permissions so that only your application and its administrators/developers have access to its logs.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Keep logging framework away from users. </strong>Do not allow your application's users to interact directly with the logging framework. The logging framework should log information regarding the performance of the application but should avoid storing user-supplied data inside the logs. Some user-supplied information can aid an attacker into poisoning your application's logs. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Always use the append flag when writing to log files. </strong>Make sure that your application always appends new events to the log files. Appending to the logs reduces the risk of overwriting the existing logged events. Example:</p>\r\n      <pre>FileOutputStream logFile =<br /> new FileOutputStream(Environment.getLogPath() + logFilename, true);</pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Consider using log rotation. </strong>Log rotation prevents your application from working with large log files. It allows you to manage and audit your application's logged events without interfering in your application's workings. Use the following steps when utilizing log rotation:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Define a rotation period</strong>: Schedule your log rotation on a regular basis. For example, rotate your logs every Monday. </li>\r\n        <li>\r\n          <strong>Create a new log file</strong>: Create a new log file when your application needs to rotate its log files. It is recommended to associate the new log file to the period of its creation. For example, the log file corresponding to the week of October 16, 2007 would be named 20071016.log. </li>\r\n        <li>\r\n          <strong>Back up the existing log files</strong>: Back up the existing log files when your application needs to rotate its log files. Consult your internal auditing policy to determine the period for which logs should be backed up. If your application backs up its logs, store them into an environment that is as secure as the storage environment for the current logs.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Consider using an external logging application. </strong>Using an external logging application ensures that your application's logs will be kept up-to-date even if your application abruptly terminates.</p>\r\n    </li>\r\n    <li>\r\n      <strong>Consider encoding output that is sent to log files</strong>. This can be useful in preventing log forging. Possible encoding mechanisms could include: \r\n                  <ul><li>Stripping out certain characters [\\r\\n] that are known to create new lines, which can allow an attacker to forge log entries. </li><li>Encode all log output using HTML encoding, then view it in a browser to see the output.</li></ul></li>\r\n  </ol>\r\n  <p>\r\n    <strong>Note:</strong> PCI DSS requirements state that logs should be kept for at least&amp;nbsp;one year.</p>"
        ]
      }
    ]
  }
}