{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-688497350",
      "Content_Hash": "-1109895770"
    },
    "Metadata": [
      {
        "Id": [
          "37e2ff71-71b6-47e0-b6f6-53c8d4e81544"
        ],
        "Id_History": [
          "37e2ff71-71b6-47e0-b6f6-53c8d4e81544,5eaab98a-2c4e-4954-adfa-4d8830886cd8,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "The Account Management Functions Are Protected"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Account Management Functions Are Protected"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure that the account administration interface is separate from the main application interface.</p>\r\n  <h1>Why</h1>\r\n  <p>Account administration requires higher privileges than the main application interface. Separating the two interfaces decreases the risk of a normal user being able to escalate privileges to that of an administrator.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to verify that the account administration interface is separate from the main application interface: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that your application has a separate administrative interface.</strong> Review your application's design and verify that your application's design specifies separation of administrative and main application interfaces. Verify that all administrative functionality is clearly identified and separated from the rest of your application's functionality. Exceptions are allowed only when your application allows users to modify their own accounts. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that account administration code is organized.</strong> Ensure all administrative functionality is structured as a single module and not scattered throughout your application. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that re-authentication is required for administrative functions.</strong> Verify that privileged users are forced to re-authenticate before accessing the administrative interface. Check if your application's administrative interface uses a separate authentication module from the rest of your application. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that appropriate access controls are used.</strong> Verify that only valid, privileged users can access your application's administrative interface. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that TLS is used.</strong> Check if your application's administrative interface is utilizing TLS. </p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Use the following steps when designing an administrative interface:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Only privileged users can administer all accounts.</strong> Design your application such that the administrative module is separate from the main application interface. Since the separation requires using separate authentication mechanisms for the application and administration, there is a reduced risk of escalation-of-privilege attacks. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Users may be allowed to administer their own accounts.</strong> It may be necessary to allow users to administer their own accounts. This involves the ability to change passwords, account details, etc. Such administration can be done through the main application interface. Because the user is modifying sensitive data, extra security precautions must be enforced:</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Force re-authentication.</strong> Enforce re-authentication when modifying the user's password. This helps verify that the user is aware of the password change and is not a victim of a session hijacking. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Modify accounts in sections.</strong> Do not modify all account information at once. Split the account modification procedure in sections. For example, group the account information into credentials, personal data, contact information and additional information. Modifying the account information in groups reduces the risk of information leakage when the user is updating his/her account. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Use TLS when modifying accounts.</strong> The use of TLS provides encryption when transmitting sensitive data over the network. TLS also certifies the authenticity of the application against the user.</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <br />"
        ]
      }
    ]
  }
}