{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "894364246",
      "Content_Hash": "616043258"
    },
    "Metadata": [
      {
        "Id": [
          "3ad0f969-2260-4ce0-a090-308e68d1ba6a"
        ],
        "Id_History": [
          "3ad0f969-2260-4ce0-a090-308e68d1ba6a,8acc7a7d-0e6e-4020-8048-a2503f9f4890,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Except Where Necessary, APTCA Usage Is Avoided."
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Except Where Necessary, APTCA Usage Is Avoided."
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Check to ensure that APTCA usage is avoided, except where necessary as it increases the attack surface and exposes your code to partial trust callers.</p>\r\n  <p />\r\n  <h1>How to Fix</h1>\r\n  <p>You can override the link demand for full trust by adding the <b>AllowPartiallyTrustedCallersAttribute</b> (APTCA) to your assembly, as shown below, but you should do so only when it is absolutely necessary.</p>\r\n  <p>Use of APTCA increases the attack surface and exposes your code to partial trust callers.</p>\r\n  <p>Use APTCA only if both of the following conditions apply: </p>\r\n  <ul>\r\n    <li>You specifically want partially trusted callers to use your strong named assembly. For example, you might need an application running on a file share to access your assembly located in the global assembly cache. However, do not open up an attack surface with APTCA if you only want fully trusted callers to use your code. <li>You have performed a thorough security code review, and your code has been rigorously audited for security vulnerabilities. Examine the resource access and other privileged operations performed by your assembly, and consider authorizing access to these operations by using other code access security demands. </li></li>\r\n  </ul>\r\n  <p>The APTCA attribute is shown below.</p>\r\n  <div>\r\n    <pre> &#91;assembly: AllowPartiallyTrustedCallersAttribute()&#93;</pre>\r\n  </div>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}