{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-160404944",
      "Content_Hash": "177960461"
    },
    "Metadata": [
      {
        "Id": [
          "3e9cdc03-491b-405e-adb2-dd7aa5eb5988"
        ],
        "Id_History": [
          "3e9cdc03-491b-405e-adb2-dd7aa5eb5988,24e9fb24-ed88-4b2a-91eb-0ee35ac52608,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Threat Models Are Created"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Threat Models Are Created"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Check that threat models have been created for your application(s).</p>\n  <h1>Why</h1>\n  <p>Threat modeling is performed to identify when and where more resources are required (or justified) to reduce risks. There are many possible vulnerabilities, threats, and attacks, and it is unlikely that your application will encounter all of them. It is also unlikely that your company would need to address all of them. Threat modeling helps you to identify where your organization needs to apply effort.</p>\n  <h1>How To Check</h1>\n  <p>Check project documentation to verify that threat models have been created for your application(s).</p>\n  <h1>How To Fix</h1>\n  <p>Perform the following steps to create threat models for your application(s):</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify security objectives.</strong> Clear objectives help you to focus the threat modeling activity and determine how much effort to spend on subsequent steps.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Create an application overview.</strong> Itemizing your application's important characteristics and actors helps you to identify relevant threats during step 4.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Decompose your application.</strong> A detailed understanding of the mechanics of your application makes it easier for you to uncover more relevant and more detailed threats.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify threats.</strong> Use details from steps 2 and 3 to identify threats relevant to your application scenario and context.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify vulnerabilities.</strong> Review the layers of your application to identify weaknesses in the context of your threats. Use vulnerability categories to help you to focus on those areas where mistakes are most often made.</p>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/e0a09e31-82b1-42f4-8934-faf4495217b5\">Create a Threat Model<br /></a>\n    </li>\n  </ul>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information on threat modeling, see <a href=\"http://msdn.com/threatmodeling\">http://msdn.com/threatmodeling</a></li>\n  </ul>"
        ]
      }
    ]
  }
}