{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-481510086",
      "Content_Hash": "683687136"
    },
    "Metadata": [
      {
        "Id": [
          "45e085ee-668e-409c-93d8-6ee578085c47"
        ],
        "Id_History": [
          "45e085ee-668e-409c-93d8-6ee578085c47,bd4081ae-9597-444a-be8e-ef9d7cb4df33,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "The Application Avoids File Name And Path Input"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Application Avoids File Name And Path Input"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Unless absolutely necessary, the application should not accept file names or file paths as input.</p>\r\n  <h1>Why</h1>\r\n  <p>Malicious file input can be used to coerce your application into accessing arbitrary files and resources.</p>\r\n  <h1>How To Check</h1>\r\n  <p>Use the following steps to check for this problem:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Find all sources of input in your application. </strong>During design time identify all of the potential sources of input to your application. Scour the source code to discover sources of input that may have been missed in the design. Compile a list that you can use in the following steps.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Determine if any source of input provides file or path information. </strong>Examine each source of input and determine if it is used to generate a file name or file path.&nbsp;Look not only for sources of input that provide full paths or file names but also for user input that could be used to modify the internal generation of paths and file names.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How To Fix</h1>\r\n  <p>If user control over file paths or file names is not absolutely necessary, remove the responsible code from the application.</p>\r\n  <p />\r\n  <p>If the functionality is critical to the proper working of the application, then validate the input for directory traversal and canonicalization attacks:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Check File Names. </strong>Ensure that file paths only refer to files within your application's virtual directory hierarchy if that is appropriate. When checking file names, obtain the full name of the file by using the <em>System.IO.Path.GetFullPath</em> method. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check File Paths. </strong>If you use <em>MapPath</em> to map a supplied virtual path to a physical path on the server, use the overloaded <em>Request.MapPath</em> method that accepts a <em>bool</em> parameter so that you can prevent cross-application mapping: </p>\r\n      <pre>try<br />{<br />  string mappedPath = Request.MapPath(inputPath.Text,<br />                       Request.ApplicationPath, false);<br />}<br />catch (HttpException)<br />{<br />  // Cross-application mapping attempted<br />}</pre>\r\n      <p>The final <em>false</em> parameter prevents cross-application mapping. This means that a user cannot successfully supply a path that contains \"..\" to traverse outside of your application's virtual directory hierarchy. Any attempt to do this results in an exception of type <em>HttpException</em>. </p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <em>You may find these additional articles useful</em>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/30a85330-dbcd-456e-8538-aa9aff177821\">Avoid File Name or Path Input</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}