{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1548988256",
      "Content_Hash": "-1092199719"
    },
    "Metadata": [
      {
        "Id": [
          "4891b0a0-9843-463c-9d5e-addc3804bdde"
        ],
        "Id_History": [
          "4891b0a0-9843-463c-9d5e-addc3804bdde,a49f7c2c-9460-4519-8c38-dbc28c34e59b,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "ASP.NET Session State Is Protected"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "ASP.NET Session State Is Protected"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that ASP.NET session state is properly protected from sniffing and guessing attacks by changing default values, disabling unused services and protecting your out-of-process state service.</p>\r\n  <h1>Why</h1>\r\n  <p>Attackers often use known attack vectors to attack an application; changing or disabling these services can minimize the attack surface of the application.</p>\r\n  <p>Attackers will often use port scanners as a first attempt to learn more about the application under attack, and changing the port can impede their progress. Attackers may attack the Out-of-Process session state management server directly to gain access to the system.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Take the following steps to ensure that the ASP.NET session state is properly protected:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that the default session state port is changed. </strong>Verify that the port value in the following key is different from the default value of 42424:</p>\r\n      <pre>HKLM\\SYSTEM\\CurrentControlSet\\Services\\aspnet_state\\Parameters </pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure the out-of-process session state management is properly secured. </strong>Keep in mind the following considerations when verifying the security of the out-of-process state management:</p>\r\n      <ul>\r\n        <li>Verify that the service operates using the Network Service account or another low-privileged account. </li>\r\n        <li>Ensure that the session state communication channel is protected. </li>\r\n        <li>Using Step 1, verify that the default session state port is changed. </li>\r\n        <li>Verify that the session state connection strings are secured.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>If unused, verify that the ASP.NET state service is turned off.</strong>\r\n      </p>\r\n      <ol>\r\n        <li>Navigate to Administrative Tools <strong>-&gt;</strong> Internet Information Services. </li>\r\n        <li>Select the appropriate instance of IIS that is associated with your application. </li>\r\n        <li>Right-click on the IIS instance and select Properties. </li>\r\n        <li>Select the Configuration option under the Home Directory tab. </li>\r\n        <li>Navigate to the Options tab. </li>\r\n        <li>Verify that the \"Enable session state\" option in unchecked. </li>\r\n      </ol>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>\r\n    <strong>Consider the following problem if you are using the default port for session state</strong>\r\n  </p>\r\n  <p>MyApp is a financial application that utilizes ASP.NET state service. Because the ASP.NET State Server is running with its default port configuration, it would be easy for a skilled attacker to discover and attack the service. </p>\r\n  <p>\r\n    <strong>Consider the following problem if your application does not require the session state</strong>\r\n  </p>\r\n  <p>MyApp is a monitoring tool. Although it does not require the ASP.NET state service, its administrators have not disabled the service, allowing a skilled attacker to compromise the application through the ASP.NET state service.</p>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}