{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "215258184",
      "Content_Hash": "-236915670"
    },
    "Metadata": [
      {
        "Id": [
          "4b441912-33f8-43cc-b0c3-663c74700c99"
        ],
        "Id_History": [
          "4b441912-33f8-43cc-b0c3-663c74700c99,0eb22c82-f59d-481a-a5d1-aade22dd26b1,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Re-authentication Is Enforced When Executing Critical Functionality"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Re-authentication Is Enforced When Executing Critical Functionality"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure your application forces the user to re-authenticate when executing security-critical functionality including, but not limited to, change of password, account modifications, and critical transactions.</p>\r\n  <h1>Why</h1>\r\n  <p>Forcing the user to re-authenticate verifies the user's decision to execute the given functionality and preserves the application's integrity in the event that a user's account has been compromised via session hijacking. </p>\r\n  <h1>How to Check</h1>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all critical functionality within your application.</strong> Locate all critical functionality within your application's code base. Common places to look at include:</p>\r\n      <ul>\r\n        <li>Creating new accounts <li>Changing passwords for existing users <li>User transactions that are sensitive in nature <li>Changing your application's global configuration <li>Any operation affecting your application's overall wellness such as start-up and shutdown</li></li></li></li></li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Ensure that your application has adopted re-authentication mechanism.</strong> Ensure that your application's design and requirements ask for re-authentication mechanisms. Common re-authentication mechanisms include:</p>\r\n        <ul>\r\n          <li>\r\n            <strong>Current password.</strong> The user uses their current password to confirm the identity. This technique ensures that the given user is aware of the action to be performed and holds responsibility for executing it. <li><strong>CAPTCHA.</strong> CAPTCHA is a mechanism where alpha-numeric codes are embedded into displayed pictures. Forcing the user to confirm the embedded code ensures that the application is interacting with a human. If your application uses CAPTCHA, ensure that your version of CAPTCHA is up-to-date with its security updates.</li></li>\r\n        </ul>\r\n        <li>\r\n          <p>\r\n            <strong>Verify that re-authentication is enforced.</strong> Ensure that the re-authentication procedures are positioned properly throughout your application's critical functionality. Verify that re-authentication is performed immediately upon entering a critical component. Example:</p>\r\n          <pre>public void ProcessPayment(PaymentInfo paymentInfo, string username, string password)<br />&amp;#123;<br />    MembershipProvider membershipProvider = Membership.Provider;<br />    if (membershipProvider.ValidateUser(username, password))<br />    &amp;#123;<br />        // Prepare and execute the transaction<br />    &amp;#125;<br />&amp;#125;</pre>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following code processes a payment transaction. Unfortunately, the code executes the payment without verifying that the user is aware of the transaction.</p>\r\n  <pre>public void ProcessPayment(PaymentInfo paymentInfo)<br />&amp;#123;<br />    // Prepare and execute the transaction<br />&amp;#125;</pre>\r\n  <h1>Related Guideline</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/740a1606-d091-4a93-bfd8-f0d4226adbf1\">Guideline: Force Re-Authentication When Executing Critical Functionality </a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}