{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1784617604",
      "Content_Hash": "205998236"
    },
    "Metadata": [
      {
        "Id": [
          "4cc9be39-e7ff-427a-84d6-63a5ba9b2e77"
        ],
        "Id_History": [
          "4cc9be39-e7ff-427a-84d6-63a5ba9b2e77,5cca4aa6-6fa1-4be0-9720-e7fd59cd7b87,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "A Repeatable Hardening Process Is Established"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "A Repeatable Hardening Process Is Established"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Verify that a repeatable hardening process is established.</p>\n  <h1>Why</h1>\n  <p>A repeatable hardening process helps prevent security misconfiguration vulnerabilities.</p>\n  <h1>How to Check</h1>\n  <p>To verify that a repeatable hardening process is established:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Find documentation.</strong> Make sure that documentation for the hardening process exists. Verify that a record of previously applied hardening is included.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify software components.</strong> Make a list of all software components, including operating systems, server platforms, code libraries, and user applications.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Make sure all software components are covered.</strong> Verify that the hardening process covers all relevant software components.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Perform a vulnerability scan.</strong> Scan a representative sample of systems using tools of your choice to make sure that the hardening process has been applied correctly.</p>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>The exact hardening process varies from application to application and from server to server. It is recommended to define a custom hardening process suited specifically for the requirements of your environment. There are some universal guidelines that are likely to be helpful. To establish a repeatable hardening process:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Document the hardening process.</strong> Design a repeatable hardening process with the understanding that it should include thorough documentation from the start. The process should be well documented so that it can be repeated, analyzed, and changed as necessary.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Consider existing hardening guides.</strong> Many hardening guides are available in the public domain. Some of these guides are written by highly skilled professionals and are of high quality. It is recommended to establish custom hardening processes specific for each environment, but existing guides may be valuable for reference.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Disable unnecessary functionality.</strong> Removing unnecessary functionality is an important part of hardening computer systems. The less functionality is available, the less opportunities there are for an attacker. Available functionality has to be balanced against the needs of the users - only functionality that is necessary for users to do their work should be available.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Apply patches.</strong> Information security is a rapidly evolving field. New vulnerabilities are being discovered at a rapid pace. Vendors respond to discovered vulnerabilities with software patches. Software patches should be installed to protect from known vulnerabilities. Installing vendor-supplied patches is a vital part of a hardening process.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Deny all access by default.</strong> All access control components should be configured to deny access by default. Following this principle assures that an attacker cannot gain unauthorized access to a resource for which no access control rules have been explicitly defined - for example, if an administrator has not defined access control rules for a resource yet. Following this principle also makes implementing access controls correctly simpler - the administrator only has to explicitly specify what is allowed, rather than having to specify what is allowed and what is not allowed.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Apply the principle of least privilege.</strong> Only give privileges that are necessary for work. This principle ties in directly with denying all access by default for access control systems - only access privileges that are required by users should be granted. The principle of least privilege goes beyond access controls. There are typically various levels of privileges for different user groups, such as privileged administrator users, and non-privileged \"regular\" users. Users should only be assigned a level of privilege that they need for their work. The principle of least privilege should be applied to: access controls, group or role membership, user account privilege level, database access accounts, and privileges granted to software components.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Automate the hardening process.</strong> After documenting the hardening process and applying it manually several times, develop tools that automate portions of the process. Eventually, the entire process may be automated, but it is okay for some parts of the process to be performed manually, especially at first.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Apply the hardening process.</strong> The same hardening process should be applied in the development, QA, and production environments - these environments should be configured identically.</p>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}