{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-218927289",
      "Content_Hash": "-860612228"
    },
    "Metadata": [
      {
        "Id": [
          "500ae131-3373-4246-b6f5-b90128ab8e3c"
        ],
        "Id_History": [
          "500ae131-3373-4246-b6f5-b90128ab8e3c,7f2e5604-e3dd-4506-ac79-80e1ec490baf,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] User's Login Credentials Are Validated Before Use"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure user credentials are validated before processing them.</p>\r\n  <h1>Why</h1>\r\n  <p>Validating user-provided login information can help to prevent cross site scripting attacks, SQL injections, and other potential problems, depending on system architecture. All input should always be validated before use and encoded before display, but login information is especially critical as it interacts with high-value data stores.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Follow these steps to ensure that your application validates user credentials before use: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Locate all code that handles user credentials. </strong>Examine your application and identify all places inside its code base that handle user credentials. Common places include:</p>\r\n      <ul>\r\n        <li>Creating new users <li>Modifying existing users <li>Changing credentials for existing users <li>Retrieving information related to existing users <li>Removing existing users <li>Authenticating users</li></li></li></li></li></li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Verify that validation is handled properly. </strong>Ensure that your application addresses username validation throughout the different stages of your application's development lifecycle:</p>\r\n        <ul>\r\n          <li>\r\n            <p>\r\n              <strong>Requirements</strong>: Check if your application's security requirements have established a policy regarding acceptable usernames. Such a&nbsp;policy should state the length and input set for valid usernames as well as password requirements. Consult the <a href=\"/article/b7dde97a-d5e3-49a8-b98b-121213bdccf4\">Strong Passwords are Enforced</a> checklist for additional information regarding password requirements.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Design</strong>: Check if all username validation routines are positioned properly at the trust boundaries of all of your application's routines that handle user credentials. For instance, all validation should occur before the username is processed by any component within your application:</p>\r\n              <pre>&lt;asp:Login ID=\"Login1\" runat=\"server\" <strong>OnLoggingIn=\"ValidateUsername\"</strong> ... /&gt;</pre>\r\n              <li>\r\n                <p>\r\n                  <strong>Implementation</strong>: </p>Check if all username validation routines implement your application's policy regarding usernames. Verify that the implementation is using whitelist and not blacklist validation techniques. Example: <pre>public bool ValidateUsername(string username)<br />&#123;<br />&nbsp;&nbsp;&nbsp; Regex rx = new Regex(\"(\\\\w&#124;\\\\d)&#123;6,&#125;\");<br />&nbsp;&nbsp;&nbsp; return rx.IsMatch(username);<br />&#125;</pre><p>Ensure that all error or exception conditions are handled correctly.&nbsp;Verify that all authentication procedures exit immediately in a graceful manner upon failed username validation. Consult the <a href=\"/article/98fb697a-6278-4f73-8937-291b2b83cdb4\">Valuable Information is Not Disclosed in Error Messages</a> and <a href=\"/article/edb7f620-21a6-4599-aebd-2966c47ec2e3\">Exception Details are Not Disclosed to the Client</a> checklists for more details.</p></li>\r\n            </li>\r\n          </li>\r\n        </ul>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following code authenticates a user in a web application. Unfortunately, it fails to validate the user login info&nbsp;which allows&nbsp;an attacker to break the authentication mechanism and gain unauthorized access.</p>\r\n  <pre>&lt;asp:Login ID=\"Login1\" runat=\"server\" MembershipProvider=\"MyAppMembershipProvider\" /&gt;</pre>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>A tutorial on regular expressions is available at <a href=\"http://www.regular-expressions.info/\">Regular-Expressions.info</a>. </li>\r\n  </ul>\r\n  <h1>Related Guideline</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/cf9e691f-d091-4b46-8177-ce1a3bda24f8\">Guideline: Validate User's Login Credentials Before Processing Them&nbsp;</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}