{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "922913914",
      "Content_Hash": "-1981573447"
    },
    "Metadata": [
      {
        "Id": [
          "54ea1759-e5e8-4eee-84cc-67607fef0c30"
        ],
        "Id_History": [
          "54ea1759-e5e8-4eee-84cc-67607fef0c30,aaea1617-4224-47e9-aeec-60eb2ff55fab,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Indirect Object References Are Used"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Indirect Object References Are Used"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Java</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that per-user or per-session indirect object references are used instead of direct object references.</p>\r\n  <h1>Why</h1>\r\n  <p>Using direct object references may expose sensitive data to attackers. Direct object references often expose sensitive data, such as files, database entries, or personal information. Direct object reference attacks are very simple to execute and have been used in high profile, low-skill attacks. Indirect object references should be used to prevent direct object reference vulnerabilities. Please, note that another approach to mitigating direct object reference vulnerabilities is to perform access control checks whenever accessing objects.</p>\r\n  <h1>How to Check</h1>\r\n  <p>To verify that indirect object references are used:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify pages that use object references.</strong> Make a list of all pages in the application. Go through the list and identify all pages that use object references by examining each page.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that indirect object references are used.</strong> Examine each page that uses object references to make sure that indirect object references are used instead of direct object references.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>To use indirect object references:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify pages that use direct object references.</strong> Make a list of all pages in the application. Go through the list and identify all pages that use direct object references by examining each page.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify objects that are being referenced.</strong> For each page that uses direct object references, make a list of all objects that are being referenced.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Consider alternatives.</strong> Using indirect object references may require significant changes to the application. Please, consider not using object references at all or performing access control checks each time an object is referenced. Not using object references means replacing all code that performs object references. Performing access control checks means adding code that performs access control checks to code that performs object references.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define object reference maps.</strong> Object reference maps are arrays or hashes of objects that are being referenced. The web application exposes the index of the array or the key of the hash that matches the required resource, rather than exposing the object itself. This approach ensures that only objects in the array may be accessed. For this approach to work, reference maps should only include objects for which access is authorized. It is possible to use per-user or per-session object mappings. Per-user mappings define objects that may be accessed by each user. Per-session mappings define objects that may be accessed by each user for the current session. Per-session references may offer additional security or flexibility, but require more work. Mappings should be generated dynamically and that means that code has to be written that defines objects that may be accessed by each user. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use reference maps instead of direct object references.</strong> Once the code that defines object reference maps is written, all the pages that reference objects have to be updated to use the reference maps.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about preventing insecure direct object reference vulnerabilities, please see <a href=\"http://www.enterprisenetworkingplanet.com/netsecur/article.php/3927401/Protect-Your-Web-Apps-From-Insecure-Direct-Object-References.htm\">http://www.enterprisenetworkingplanet.com/netsecur/article.php/3927401/Protect-Your-Web-Apps-From-Insecure-Direct-Object-References.htm</a></li>\r\n    <li>For information about using access reference maps in OWASP ESAPI, please see <a href=\"http://owasp-esapi-java.googlecode.com/svn/trunk_doc/latest/org/owasp/esapi/AccessReferenceMap.html\">http://owasp-esapi-java.googlecode.com/svn/trunk_doc/latest/org/owasp/esapi/AccessReferenceMap.html</a></li>\r\n  </ul>\r\n  <br />"
        ]
      }
    ]
  }
}