{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1567820070",
      "Content_Hash": "-1774217749"
    },
    "Metadata": [
      {
        "Id": [
          "59132a30-2bae-45e9-9d85-8de26441be29"
        ],
        "Id_History": [
          "59132a30-2bae-45e9-9d85-8de26441be29,a87a40d9-bafc-4675-af39-086679a614a6,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Session Cookies Are Protected"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Session Cookies Are Protected"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that the confidentiality of session cookies is protected.</p>\r\n  <h1>Why</h1>\r\n  <p>Session cookies are used by an application to identify the session associated with a particular user. Protecting session cookies can help prevent an attacker from hijacking the session and using the application posing as a legitimate user.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to verify that your application's session cookies are handled securely:</p>\r\n  <ol>\r\n    <li>\r\n      <strong>Verify that session identifiers cannot be guessed. </strong>Ensure that your application's session identifiers cannot be guessed by an attacker. Verify that your application's session IDs meet the following requirements:<p /><ul><li><strong>Length</strong>: Your application uses long session identifiers (e.g. string of length 32). </li><li><strong>Triviality</strong>: Your application uses randomly generated session identifiers. </li><li><strong>Lifetime</strong>: Your application uses <em>HttpSession.setMaxInactiveInterval</em> to expire inactive <span>sessions or that the timeout has been set via a configuration in web.xml.</span></li><li><strong>Recycling</strong>: Your application does not reuse previously used sessions.</li></ul></li>\r\n    <li>\r\n      <strong>Verify that users can invalidate their own sessions. </strong>Ensure that your application uses <em>HttpSession.invalidate</em> to allow its users to invalidate their own sessions.<p /></li>\r\n    <li>\r\n      <strong>Verify that session cookies are sent over encrypted channels. </strong>Ensure your application transmits session cookies over encrypted channels. Although this is not required for non-sensitive transactions, it is mandatory for any transactions are sensitive in nature.<p /></li>\r\n    <li>\r\n      <strong>Verify that session cookies have the <em>HttpOnly</em> flag set</strong>. This prevents client side scripts from gaining access to the cookie.<p /></li>\r\n    <li>\r\n      <strong>Verify that session cookies have the <em>Secure</em> flag set.</strong> The \"<em>Secure</em>\" flag forces sessions cookies to be sent only over TLS.<p /></li>\r\n    <li>\r\n      <strong>Verify that sessions are invalidated on login</strong>. This can help prevent session fixation (or hijacking).\r\n              </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Use the following steps to secure session cookies:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Do not allow users to choose their own session identifiers. </strong>Java automatically assigns random IDs to its sessions which minimizes the risk of an attacker hijacking another user's session by using the same session ID. To use sessions in Java, invoke <em>HttpServletRequest.getSession</em>:</p>\r\n      <pre>HttpSession session = request.getSession();</pre>\r\n    </li>\r\n    <li>\r\n      <strong>Invalidate the session identifier on login (as well as logout) to ensure session identifiers are not reused.</strong> This is a portion of the approach necessary to prevent session hijacking. Use <em>HttpSession.invalidate</em> to accomplish this. After the session has been invalidated, the call below will generate a new session identifier.<p /><pre>HttpSession session = request.getSession(true);</pre></li>\r\n    <li>\r\n      <p />\r\n      <strong>Time-out sessions. </strong>\r\n      <span>Set an expiration time for sessions. This helps minimize the threat of session hijacking by giving an attacker a smaller window of opportunity. Depending on your application, an appropriate timeout can be anywhere from 10 to 20 minutes. Setting when sessions should expire can be done through <em>HttpSession.setMaxInactiveInterval</em> in code, or via the <em>session-timeout</em> configuration in the web.xml file.<p /></span>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Allow users to terminate their sessions. </strong>Allowing users to invalidate their sessions reduces the risk of session being hijacked. Use <em>HttpSession.invalidate</em> to accomplish this.</p>\r\n    </li>\r\n    <li>\r\n      <p />\r\n      <strong>Ensure cookies are sent over encrypted channels. </strong>\r\n      <span>Mark cookies sent over TLS as <em>Secure</em>. Use <em>Cookie.setSecure</em> to require TLS when sending out the given cookie. It is recommended to avoid sending session cookies over unencrypted channels as session hijacking is made much easier. Use <em>ServletRequest.isSecure</em> to verify whether TLS is being used. There is a <em>cookie-secure</em> attribute that can be set for the sessiond id cookie in the web.xml file.<p /></span>\r\n    </li>\r\n  </ol>\r\n  <p>\r\n    <strong>Note:</strong> PCI DSS requirements state that sessions that are idle for 15 minutes should be locked automatically and require the user's password to unlock.</p>\r\n  <h1>Problem Example</h1>\r\n  <p>The following code shows the logout function of the <em>LoginModule</em> used when relying on JAAS for authentication. The code removes all authentication tokens associated with the current session but fails to invalidate the session. </p>\r\n  <pre>public boolean logout() throws LoginException{<br />      subject.getPrincipals().remove(userToken);<br /><br />      clearCredentials();<br />      userToken = null;<br /><br />      // The application should have invalidated the session here.<br /><br />      // Log the logout event. Consult the Logging section for more details<br /><br />      return true;<br />}</pre>\r\n  <h1>Solution Example</h1>\r\n  <p>The following code shows the logout function of the <em>LoginModule</em> used when relying on JAAS for authentication. The code removes all authentication tokens associated with the current session and invalidates the session.</p>\r\n  <pre>public boolean logout() throws LoginException{<br />      subject.getPrincipals().remove(userToken);<br /><br />      clearCredentials();<br />      userToken = null;<br /><br />      // The application invalidates the session when<br />      // the user is logging out<br />      HttpSession session = common.getCurrentSession();<br />      session.invalidate();<br /><br />      // Log the logout event. Consult the Logging section for more details<br /><br />      return true;<br />}</pre>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To learn more about session prediction attacks, see: <a href=\"http://www.webappsec.org/projects/threat/classes/credential_session_prediction.shtml\">Credential and Session Prediction</a>.</li>\r\n  </ul>"
        ]
      }
    ]
  }
}