{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-49509385",
      "Content_Hash": "-1547126454"
    },
    "Metadata": [
      {
        "Id": [
          "5b207f0a-b17d-42e3-813f-8ac255b3e1bb"
        ],
        "Id_History": [
          "5b207f0a-b17d-42e3-813f-8ac255b3e1bb,08ba0426-77ea-4363-bf3f-4808b72242d6,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "Java Supported Functionality Is Not Utilized Through JNI"
        ],
        "Category": [
          "Unmanaged Code"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Java Supported Functionality Is Not Utilized Through JNI"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure no Java-supported functionality is re-implemented using JNI.</p>\n  <h1>Why</h1>\n  <p>When you use native code, you expose yourself to potential vulnerabilities, such as buffer overflows, that are mitigated by the Java Virtual Machine.</p>\n  <h1>How to Check</h1>\n  <p>\n    <strong>Java Native Interface (JNI)</strong> should be used only when the Java Virtual Machine has no implementation for the required functionality. Once your application utilizes JNI, it risks losing certain benefits of the Java platform: </p>\n  <ul>\n    <li>JNI prevents Java applications from being cross-platform. Therefore, you would need to recompile your JNI components in the environment where you would like to deploy your application. <li>Because the Java Virtual Machine provides certain type and boundary checks that are otherwise unavailable in native code, all data types in Java are type-safe and secure. Using JNI exposes your application to vulnerabilities such as buffer overflow. <li>Because of the logic behind its garbage collector, Java does not allow dangling or arbitrary pointers. When using JNI for your application, you would need to take extra effort to ensure that your application does not reference memory that is not allocated.</li></li></li>\n  </ul>\n  <p>Use the following steps to ensure that your application does not re-implement Java functionality through JNI:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Review your application's design and requirements. </strong>Thoroughly examine your application's design and requirements. </p>\n      <ul>\n        <li>Identify all functionality that is necessary for your application to perform its tasks. <li>Research whether each component can be implemented using Java. <li>If the Java SDK cannot provide a viable solution for a component, identify that the component is using JNI.<br /><br />Common tasks that may require the use of JNI include: <ul><ul><li>Interaction with the underlying operating system <li>Low-level network operations <li>Interaction with legacy software <li>Interaction with external libraries that are written in native code <li>Interaction with hardware devices</li></li></li></li></li></ul></ul></li></li></li>\n      </ul>\n      <li>\n        <p>\n          <strong>Verify that only the allowed components utilize JNI. </strong>Identify all uses of JNI in your application's code base, by looking for \"<em>JNIEnv</em>\" and \"<em>jobject</em>\" strings, which are tell-tale signs of JNI:</p>\n        <pre>#include &lt;jni.h&gt;<br />#include &lt;sys/types.h&gt;<br />#include &lt;fcntl.h&gt;<br />#include &lt;stdio.h&gt;<br />#include &lt;atlbase.h&gt;<br />#include &lt;windows.h&gt;<br />#include &lt;wtypes.h&gt;<br /><br />JNIEXPORT jboolean JNICALL Java_ActiveX_invokeObject<br />           (JNIEnv &#42; env, jobject jobj, jstring jguid)<br />&#123;<br />      ...<br />&#125;</pre>\n        <p>Using the list of components specified&nbsp;for JNI use&nbsp;that was identified in&nbsp;Step 1, compare all actual uses of JNI against your application's intended use of native code. Ensure that all actual use of JNI is within the intended scope.</p>\n      </li>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Use the following steps when choosing native vs. Java code: </p>\n  <ol>\n    <li>\n      <p>\n        <strong>Understand the required functionality. </strong>Unless the requirements ask for device and kernel drivers or other low-level code, the implementation can likely be accomplished using Java code. </p>\n      <li>\n        <p>\n          <strong>Examine the Java SDK references. </strong>Before turning to native code, consult the Java SDK. It is likely that there are Java APIs already provided for the required functionality.</p>\n      </li>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>The developers of MyApp, a stock market analysis tool, use econometric modeling as a base technology in the application. In their desire to optimize the application's algorithms, the developers use Java Native Interface throughout the code. By doing so, they prevent the Java Virtual Machine from executing all of its code optimization routines and internal security checks.</p>\n  <h1>Solution Example</h1>\n  <p>The developers of MyApp, a stock market analysis tool, use econometric modeling as a base technology in the application. The developers choose to use Java code only. Therefore, they do not disturb the code optimization routines and internal security checks of the Java Virtual Machine.</p>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about the security issues that JNI introduces, see: <a href=\"http://www.owasp.org/index.php/Unsafe_JNI\">Unsafe JNI</a> from OWASP. </li>\n  </ul>\n  <h1>Unmanaged Code Guidelines</h1>\n  <ul>\n    <li>\n      <a href=\"/article/351b69c8-b40b-4c13-899e-a8399b85a0ea\">Do Not Utilize Functionality Through JNI if Java Already Supports It</a>\n      <li>\n        <a href=\"/article/70b53138-faf7-410a-a966-16f3088fca63\">Minimize the Number of Times Language Boundaries are Crossed</a>\n      </li>\n    </li>\n  </ul>\n  <h1>Unmanaged Code Checklists</h1>\n  <ul>\n    <li>\n      <a href=\"/article/5b207f0a-b17d-42e3-813f-8ac255b3e1bb\">Java Supported Functionality Is Not Utilized Through JNI</a>\n        <li>\n          <a href=\"/article/a61487db-d1e1-4304-89b1-44bb8c88b1e3\">All Data Passed Between Native and Java Code Is Validated</a>\n          <li>\n            <a href=\"/article/d775ead4-8413-4736-a40f-92c7e0231e5b\">Libraries Loaded Through JNI Are Protected</a>\n          </li>\n        </li>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}