{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-857745980",
      "Content_Hash": "-1410527183"
    },
    "Metadata": [
      {
        "Id": [
          "660cb349-fe70-4693-921a-20cc5def9e76"
        ],
        "Id_History": [
          "660cb349-fe70-4693-921a-20cc5def9e76,04c5c4c6-45ba-47ac-8fe5-c40fde9b551a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Destinations of Redirects And Forwards Are Validated"
        ],
        "Category": [
          "Redirects and Forwards"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Destinations of Redirects And Forwards Are Validated"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Web Applications</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Check that destinations of redirects and forwards are validated.</p>\r\n  <h1>Why</h1>\r\n  <p>If destinations of redirects or forwards are not validated, an attacker may create hyperlinks that appear to point to legitimate sites, but actually point to malicious pages controlled by the attacker. This technique is often used by phishers to trick people into visiting fake sites that steal authentication credentials. In some cases, a user may gain unauthorized access by manipulating redirect or forward parameters, if destinations are not validated.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to verify that destinations of redirects and forwards are validated:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify redirects and forwards.</strong> Review code to find all redirects and forwards.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Enumerate destinations.</strong> Make a list of all destinations for each redirect and forward.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify access permissions.</strong> Determine circumstances under which it is acceptable for each user role to access each destination.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Examine each redirect and forward.</strong> Verify that each redirect and forward uses mapping values instead of fully-qualified urls to determine destinations. Review code of each redirect and forward to make sure that all destinations are validated to assure that users can only access resources that are authorized for them. </p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to assure validation of redirects and forwards:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify redirects and forwards.</strong> Review code to find all redirects and forwards.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Map destinations.</strong> Make a list of all destinations for each redirect and forward. Define mapping values for all destinations used by redirects and forwards. A mapping value is a short identifying string that symbolically represents a resource.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define access permissions.</strong> Determine circumstances under which it is acceptable for each user role to access each destination.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Validate redirects.</strong> Rewrite redirects and forwards to use mapping values as input to calculate the final destinations of redirects or forwards. Add validation routines to verify that the user has permissions to access the resource, which is the destination of the redirect or forward.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about unvalidated redirects and forwards, please see <a href=\"http://www.owasp.org/index.php/Top_10_2010-A10-Unvalidated_Redirects_and_Forwards\">http://www.owasp.org/index.php/Top_10_2010-A10-Unvalidated_Redirects_and_Forwards</a></li>\r\n  </ul>\r\n  <br />"
        ]
      }
    ]
  }
}