{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1701374995",
      "Content_Hash": "-1002802107"
    },
    "Metadata": [
      {
        "Id": [
          "6adf267f-db7d-4770-86c6-292f9b126874"
        ],
        "Id_History": [
          "6adf267f-db7d-4770-86c6-292f9b126874,5eed31f9-57c1-4811-8223-4a1a023bb43c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Sensitive Data Is Not Placed in Parameters"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Sensitive Data Is Not Placed in Parameters"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure that sensitive data is not placed in unprotected parameters.</p>\n  <h1>Why</h1>\n  <p>Sensitive data stored in unprotected parameters is sent on the network in plaintext and can be easily&amp;nbsp;read by an attacker who steals it&amp;nbsp;using a network sniffer.</p>\n  <h1>How to Check</h1>\n  <p>Sensitive data may be transmitted between a user's browser and your application for the following purposes:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Submitting input to your application:</strong> A user can provide input to your application via URL and form-based parameters.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Tracking user activity:</strong> Your application may use cookies or hidden fields to track user activity. </p>\n    </li>\n  </ol>\n  <p>Since HTTP-based parameters are handled in plaintext form, use the following steps to ensure your application's proper use of HTTP-based parameters when handling sensitive data:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify sensitive data. </strong>Sensitive data is any information that is kept secret and should be disclosed only to authorized parties. Common examples of sensitive data include, but are not limited to, names of customers, government issued ID numbers, credit card and other financial information, passwords and private keys. Some industries, such as health care and banking, have regulatory standards that define sensitive information. Use regulatory requirements, as they apply to your application, to identify sensitive data. Sensitive data can be defined as follows:</p>\n      <ul>\n        <li>Information that either contains personally identifiable information or can be used to derive personally identifiable information that should not be shared with others. </li>\n        <li>Information that a user provides that they would not want shared with other users of the application. </li>\n        <li>Information that comes from an external trusted source that is not designed to be shared with users.</li>\n      </ul>\n    </li>\n    <li>\n      <strong>Verify that your application uses HTTPS for all sensitive pages.</strong> Identify all sensitive pages and use a web browser to navigate through them, using the facilities built-into the web browser to make sure that all sensitive pages are protected with TLS.</li>\n    <li>\n      <p>\n        <strong>Verify your application uses POST requests. </strong>Ensure that your application accepts sensitive data via only&amp;nbsp;HTTP POST requests. Verify that the following items are in place:</p>\n      <ul>\n        <li>\n          <p>\n            <strong>HTML Forms</strong>: Verify that all forms that submit sensitive data explicitly specify that the user's browser should use POST requests.</p>\n          <pre>&lt;form method=\"POST\" action=\"https://login.example.com/myapp/login\"&gt;<br />  &lt;input type=\"text\" name=\"user\" size=25&gt;&lt;br&gt;<br />  &lt;input type=\"password\" name=\"pass\" size=25&gt;&lt;br&gt;<br />  &lt;input type=\"submit\" name=\"submit\" value=\"log in\"&gt;<br />&lt;/form&gt;</pre>\n        </li>\n        <li>\n          <p>\n            <strong>Server-Side Code</strong>: Verify that your application accepts sensitive data only over a POST method.</p>\n          <pre>public final class MainLoginServlet extends HttpServlet<br />{<br />      public void doPost(HttpServletRequest request, HttpServletResponse response)<br /><br />            throws ServletException, IOException<br />      {<br />            ...<br />      }<br />}</pre>\n        </li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that no sensitive data is stored in HTTP parameters or cookies. </strong>Ensure that your application does not store sensitive data in HTTP parameters or cookies. Verify that all sensitive data is stored into sessions. <br /></p>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Follow these steps when handling sensitive data via parameters:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify the parameters.</strong> Parameters can be used as both entry points and storage places. Locating your application's parameters helps identify potential sources of input. Because parameters are easily accessible by the client, they should be considered untrusted. Different types of parameters include:</p>\n      <ul>\n        <li>URL-based parameters </li>\n        <li>Form-based parameters </li>\n        <li>Hidden fields </li>\n        <li>Cookies</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Identify the use. </strong>Parameters can be used for several purposes. If you are using parameters to send sensitive data, use the steps below to find a work around:</p>\n      <ul>\n        <li>\n          <p>\n            <strong>Submitting input</strong>: Submitting sensitive data using parameters should always be done through an encrypted channel and always using a POST request. Use TLS to ensure encryption. Avoid using hidden fields when gathering information from the user. Allowing the user to enter all information about their account ensures that they are aware of all data that is being sent. Any information regarding the user's client environment can be gathered via the HTTP headers.</p>\n        </li>\n        <li>\n          <p>\n            <strong>User tracking</strong>: User tracking should always be done server-side using sessions. Avoid storing sensitive information in hidden fields and cookies. If it is necessary to store sensitive data using parameters, encrypt the data using a key that is known only by your application. If encrypted sensitive data is stored inside a cookie, avoid setting the cookie as persistent.</p>\n        </li>\n      </ul>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>In the following page, the credentials are sent using a GET request. When the page is submitted, the credentials will be available in the URL. Therefore, it is possible for a malicious user to obtain the credentials via the server's access logs or by sniffing the HTTP referrer header.</p>\n  <pre>&lt;html&gt;<br />  &lt;head&gt;<br />    &lt;title&gt;login form&lt;/title&gt;<br />  &lt;/head&gt;<br />  &lt;body&gt;<br />    &lt;form method=\"GET\" action=\"https://login.example.com/myapp/login\"&gt;<br />    &lt;input type=\"text\" name=\"user\" size=25&gt;&lt;br&gt;<br />    &lt;input type=\"password\" name=\"pass\" size=25&gt;&lt;br&gt;<br />    &lt;input type=\"submit\" name=\"submit\" value=\"log in\"&gt;<br />    &lt;/form&gt;<br />  &lt;/body&gt;<br />&lt;/html&gt;</pre>\n  <h1>Solution Example</h1>\n  <p>In the following page, the credentials are sent using a POST request over TLS. When the page is submitted, the credentials will not be shown in the URL.</p>\n  <pre>&lt;html&gt;<br />  &lt;head&gt;<br />    &lt;title&gt;login form&lt;/title&gt;<br />  &lt;/head&gt;<br />  &lt;body&gt;<br />    &lt;form method=\"POST\" action=\"https://login.example.com/myapp/login\"&gt;<br />    &lt;input type=\"text\" name=\"user\" size=25&gt;&lt;br&gt;<br />    &lt;input type=\"password\" name=\"pass\" size=25&gt;&lt;br&gt;<br />    &lt;input type=\"submit\" name=\"submit\" value=\"log in\"&gt;<br />    &lt;/form&gt;<br />  &lt;/body&gt;<br />&lt;/html&gt;</pre>"
        ]
      }
    ]
  }
}