{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1932336224",
      "Content_Hash": "1297697828"
    },
    "Metadata": [
      {
        "Id": [
          "6f76a0e9-bc7a-4a1e-89a2-97399f848c5b"
        ],
        "Id_History": [
          "6f76a0e9-bc7a-4a1e-89a2-97399f848c5b,222e67ca-0869-4c59-a11d-0cff820cb18b,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Destinations of Redirects And Forwards Are Calculated Without User Input"
        ],
        "Category": [
          "Redirects and Forwards"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Destinations of Redirects And Forwards Are Calculated Without User Input"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>Web Applications</li>\n  </ul>\n  <h1>What to Check For</h1>\n  <p>Verify that destinations of redirects and forwards are calculated without user input.</p>\n  <h1>Why</h1>\n  <p>Using input to calculate destinations of redirects or forwards may allow an attacker to create hyperlinks that appears to point to legitimate sites but redirect to malicious pages controlled by the attacker. This technique is often used by phishers to trick people into visiting fake sites that steal authentication credentials.</p>\n  <h1>How to Check</h1>\n  <p>Look for code that handles parameters to see if it performs redirects or forwards based on input. Redirects are also known as \"transfers\" in .NET. Ideally, redirects and forwards should not rely on user input to calculate their destinations.</p>\n  <h1>How to Fix</h1>\n  <p>Perform the following actions to calculate destinations of redirects and forwards without user input:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Find redirects and forwards.</strong> Find all pages that perform redirects or forwards. Redirects are also known as \"transfers\" in .NET.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify dangerous redirects and forwards.</strong> Find all redirects and forwards that rely on user input to calculate their destinations.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Rewrite redirects and forwards.</strong> Consider making design or code changes to get rid of each redirect or forward, if possible. If a redirect or forward is absolutely necessary, consider how it may be rewritten to operate without user input. This is usually possible based on assumptions made in the application design.</p>\n    </li>\n  </ol>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>For more information about unvalidated redirects and forwards, please see <a href=\"http://www.owasp.org/index.php/Top_10_2010-A10-Unvalidated_Redirects_and_Forwards\">http://www.owasp.org/index.php/Top_10_2010-A10-Unvalidated_Redirects_and_Forwards</a></li>\n  </ul>\n  <br />"
        ]
      }
    ]
  }
}