{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1284353983",
      "Content_Hash": "-899520211"
    },
    "Metadata": [
      {
        "Id": [
          "7f8deb21-cd52-41be-80b4-8897612021dc"
        ],
        "Id_History": [
          "7f8deb21-cd52-41be-80b4-8897612021dc,9f781750-4c45-4dc4-bad5-bd9f63d37450,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Input from All Sources Is Validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Input from All Sources Is Validated"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nCheck for input that has not been passed through a validation routine. All input from external sources should be validated.\r\n\r\n\r\n## Why ##\r\n\r\nInput that is not validated can lead to cross-site scripting, SQL injection, directory traversals, and other vulnerabilities which would allow an attacker to gain unauthorized access to sensitive data.\r\n\r\n\r\n## How to Check ##\r\n\r\nAn application can take input via various ways such as a web interface, database, file system or other software running on the server. Use the following steps to establish a validation strategy:\r\n\r\n1. **Identify all sources of input.** At design time identify all potential sources of input to your application. Once implemented, scour source code to discover sources of input that may have been missed in the design. Potential sources of input in a web application typically include:\r\n\t* URL based parameters\r\n\t* Form based parameters\r\n\t* Hidden fields\r\n\t* Cookies\r\n\t* HTTP headers (Host, accept types, www authentication, cache settings, encodings, etc)\r\n\t* Local filesystem\r\n\t* Database\r\n\t* Other services running on the system\r\n\t* Javascript variables\r\n\t* Uploaded files and their attributes (filename, size, data, etc)\r\n\t* DNS results or host names\r\n\t* External component call return values (COM, AJAX, ActiveX)\r\n\r\n2. **Once you know the types of input from where your application may receive data, look for all entry points.** Good starting points are method parameters and assignment statements. For example:\r\n\r\n\t\t/* This method uses the searchTerm variable: */\r\n\r\n\t\tvoid aggregateData(PrintWriter out, String searchTerm)\r\n\t\t ...\r\n\t\tdouble[] rData = common.queryDBForIndex(searchTerm);\r\n\r\n\t\t/* This assignment stores data from a GET request parameter named index and stores it in the string searchTerm. Ensure that this input is validated: */\r\n\r\n\t\tString searchTerm = request.getParameter(\"index\");\r\n\r\n\t\t/* This assignment uses the input that was gathered above to store more input from a database. \r\n\t\tVerify that searchTerm is validated before this use, and also ensure that rData is validated as another source of input. */\r\n\r\n\t\tdouble[] rData = common.queryDBForIndex(searchTerm);\r\n\r\n3. **Trace data from source to sink.** Trace each source of input from the immediate source through your application to its final destination. The final sink may be in memory, on the hard drive, sent over the network or stored in a data store such as a database.\r\n\r\n4. **Identify validation routines.** Each input source should have a validation routine associated with it. Ideally the validation will occur as soon as the input reaches your application. Shared validation routines are better than creating many throughout the code base, so check for consolidation of routines to aid testing and reduce the chance of one-off bugs. If any input source does not have a validation routine associated with it, flag it for fixing.\r\n\r\n5. **Ensure quality of validators.** Validation routines should check for length, range, format and type. Validation should first check for good data through whitelisting then for known malicious data through blacklisting. Do not rely on client-side validation alone as it can be bypassed easily.\r\n\r\n\r\n## How to Fix ##\r\n\r\nAn application can take input via various ways: web interface, database, file system, other software running on the server, etc. Use the following steps to establish a validation strategy:\r\n\r\n1. **Establish your application's trust boundary.** The notion is that all input not generated by your application is untrusted.\r\n\r\n2. **Identify all sources of input.** An application can have various sources of input and each one is an entry point to your application that can potentially be used to break your application's security model. Enumerate all possible sources of input and make note of the expected input at each source. Potential sources of input in a web application typically include:\r\n\t* URL based parameters\r\n\t* Form based parameters\r\n\t* Hidden fields\r\n\t* Cookies\r\n\t* HTTP headers (Host, accept types, www authentication, cache settings, encodings, etc)\r\n\t* Local filesystem\r\n\t* Database\r\n\t* Other services running on the system\r\n\t* Javascript variables\r\n\t* Uploaded files and their attributes (filename, size, data, etc)\r\n\t* DNS results or host names\r\n\t* External component call return values (COM, AJAX, ActiveX)\r\n\t\r\n3. **Understand the input that your application can handle and process.** After identifying the different entry points, define the format and type of input that should be provided through each entry point.\r\n\r\n4. **Create a set of validators.** Build a validator for each format and type of expected input. Centralize your application's validators as it helps strengthen the code by limiting the amount of scattered validation code throughout your application. Place the set of validators on your application's trust boundary. Your application should accept input from the outside world only through its set of validators.\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}