{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "820122911",
      "Content_Hash": "1519885397"
    },
    "Metadata": [
      {
        "Id": [
          "810cbb10-f05a-4625-b186-6a6210050afb"
        ],
        "Id_History": [
          "810cbb10-f05a-4625-b186-6a6210050afb,3b1bea5c-a176-4bdf-bd6d-098206a2c508,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Penetration Testing Is Performed"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Penetration Testing Is Performed"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Penetration testing results should be documented and the identified vulnerabilities should be fixed.</p>\n  <h1>Why</h1>\n  <p>Penetration testing helps discover vulnerabilities before someone else does.</p>\n  <h1>How to Check</h1>\n  <p>Check project documentation for information about penetration testing. Penetration testing results should be documented and the identified vulnerabilities should be fixed. There are many different methodologies for carrying out penetration tests. Procedures for carrying out penetration tests depend on specific aspects of the application or system being tested. One thing is common to all penetration tests - they should be documented. Verify that this documentation is included in project documentation to make sure that penetration testing has been done.</p>\n  <h1>How to Fix</h1>\n  <p>One option is to contract an information security consulting company to perform the penetration test. One methodology for carrying out penetration tests involves examining the application environment for common vulnerabilities, using automated tools to search for low hanging fruit, then manually checking the application for the most dangerous and common vulnerability types and attack vectors.</p>\n  <br />"
        ]
      }
    ]
  }
}