{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-775259599",
      "Content_Hash": "-786678394"
    },
    "Metadata": [
      {
        "Id": [
          "8850ea3d-c43e-48bd-bf5c-f5a6ef898038"
        ],
        "Id_History": [
          "8850ea3d-c43e-48bd-bf5c-f5a6ef898038,1ae034b9-37f6-407c-b0ba-7e3101ec3ea3,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Prepared Statements Are Used for Data Access"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Prepared Statements Are Used for Data Access"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure that type safe SQL parameters are used when performing database transactions.</p>\r\n  <h1>Why</h1>\r\n  <p>Prepared statements mitigate the number one risk for database-facing Web applications: SQL injection. This powerful attack is language independent, as it depends on the algorithm used to generate SQL strings passed to the database and affects the database engine, not the actual application. It exploits the creation of the SQL string, in which user input is embedded manually with escape sequences (such as the single quote (') or double quote (\") characters). Using this method, an attacker inserts valid SQL statement fragments as part of user input so they, in turn, are embedded within the SQL query that is submitted to the database engine for execution. Successful exploitation allows an attacker to potentially compromise the entire database and often the underlying operating system. </p>\r\n  <p>Prepared statements offer a simple yet efficient mitigation since they automatically contain user-input in a non-escaped form, passing the input as parameters, much like a function call. By parameterizing input parameters and type-enforcing them, user input is effectively filtered. </p>\r\n  <h1>How to Check</h1>\r\n  <p>To check if prepared statements are used:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all database transactions.</strong> Locate all SQL queries throughout your application. </p>\r\n      <li>\r\n        <p>\r\n          <strong>Verify that each transaction uses prepared statements.</strong> Prepared statements can be identified in PHP easily by searching for calls to the prepare function.</p>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>To use prepared statements to prevent SQL injection, follow these steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify SQL queries. </strong>Locate all SQL queries throughout your application. </p>\r\n      <li>\r\n        <p>\r\n          <strong>Identify the parameters in each SQL query.</strong> After locating all SQL queries, identify the parameters in each query. Understand the format and type of each parameter's data.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Use prepared statements for SQL queries.</strong> Substitute the parameters in SQL queries with question marks (\"?\"). The basic steps for writing a prepared statement are: get a database handle, call the prepare function to make the prepared statement, use the bindParam function to bind prepared statement parameters to variables, load data into the variables, and call the execute function to execute the prepared statement. For examples and more information about writing prepared statements in PHP, please see the link at the bottom of this article. One example of a prepared statement is:</p>\r\n          <pre>// Create the prepared statement. Notice the ?, which defines the parameter.<br />$preparedStatement = $databaseHandle-&gt;prepare(\"SELECT * FROM USERS WHERE Name =  ?\");<br />// Bind a variable to the parameter.<br />$preparedStatement-&gt;bindParam(1, $name);<br />// Load data into the parameter.<br />$name = \"Joe\";<br />// Execute the prepared statement.<br />$preparedStatement-&gt;execute();</pre>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about using prepared statements, please see <a href=\"http://php.net/manual/en/pdo.prepared-statements.php\">http://php.net/manual/en/pdo.prepared-statements.php</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}