{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-166997435",
      "Content_Hash": "1995822081"
    },
    "Metadata": [
      {
        "Id": [
          "88b03935-778f-47f1-8308-c01c995d5eb1"
        ],
        "Id_History": [
          "88b03935-778f-47f1-8308-c01c995d5eb1,8df8d961-7f78-4081-8014-67d0d87430c3,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Session State Service Is Run With a Least Privileged Account"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Session State Service Is Run With a Least Privileged Account"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that the principle of least privilege is applied to the local system account that&nbsp;is used for running the ASP.NET state service.</p>\r\n  <h1>Why</h1>\r\n  <p>A determined hacker may be able to discover login information used by the ASP.NET worker process or to piggy back on credentials provided to the State Server. This can allow the attacker to arbitrarily read session information or further compromise the State Server.</p>\r\n  <h1>How to Check</h1>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Determine if your application uses the ASP.NET Session State service. </strong>Use the following steps to identify if your application uses the ASP.NET Session State service:</p>\r\n      <ol>\r\n        <li>Open the IIS management utility. <li>Locate your application's web site. <li>Right click on your application and select Properties. <li>Select the ASP.NET tab. <li>Click on the Edit Configuration button. <li>Select the State Management tab. <li>Observe the Session state mode value. If the value is set to State Server, then your application uses the ASP.NET Session State service.</li></li></li></li></li></li></li>\r\n      </ol>\r\n      <li>\r\n        <p>\r\n          <strong>Identify the account used by the ASP.NET Session State service. </strong>Use the following steps to identify the account used by the ASP.NET Session State service:</p>\r\n        <ol>\r\n          <li>Open Administrative Tools <strong>-&gt;</strong> Services. <li>Locate the ASP.NET State Service. <li>Right click on the ASP.NET State Service and select Properties. <li>Select the Log On tab. <li>Observe the account that is used by the service.</li></li></li></li></li>\r\n        </ol>\r\n        <li>\r\n          <p>\r\n            <strong>Verify that the principle of least privilege is applied to the ASP.NET Session State service account. </strong>If the account used is differently from NT AUTHORITY\\NetworkService, ensure that the principle of least privilege is applied to it. Common privileges that should not be granted to this account include:</p>\r\n          <ul>\r\n            <li>local logon <li>administrative privileges</li></li>\r\n          </ul>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is in a server farm and uses the SQL Server state service. Because the ASP.NET state server user runs on the database with full privileges, an attacker may be able to compromise the server, which would lead to full compromise of the database.</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information on the Session State Modes, see: <a href=\"http://msdn2.microsoft.com/en-us/library/ms178586(vs.80).aspx\">Session-State Modes</a>&nbsp;on MSDN. <li>For more information on how to select the right Session State Storage, see: <a href=\"http://www.ondotnet.com/pub/a/dotnet/2003/03/24/sessionstate.html?page=last\">Choosing the Right Session State Storage</a>.</li></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}