{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-948291120",
      "Content_Hash": "1309404024"
    },
    "Metadata": [
      {
        "Id": [
          "8d2d20fc-a21a-4a1c-bb31-8a876e57abaf"
        ],
        "Id_History": [
          "8d2d20fc-a21a-4a1c-bb31-8a876e57abaf,7d8379cc-5ca7-4113-a211-3645c39f812d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Valid TLS Certificates Are Used"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Valid SSL Certificates Are Used"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that valid TLS certificates are used.</p>\r\n  <h1>Why</h1>\r\n  <p>Using valid TLS certificates helps prevent phishing attacks by assuring visitors that your site is secure and trusted. </p>\r\n  <h1>How to Check</h1>\r\n  <p>To verify that a valid TLS certificate is used, open the TLS-secured area of the site with a web browser. The web browser should indicate whether the TLS certificate is valid in the URL bar. The web browser will display a warning message if the TLS certificate is not valid.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>To use a valid TLS certificate:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Purchase a valid TLS certificate.</strong> You may purchase a valid TLS key from VeriSign, Thawte, or your web hosting provider. Follow the vendor's instructions for purchasing the TLS certificate. The certificate is usually a .cer file. Make sure the certificate matches all domains used by the application.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Import the valid TLS certificate.</strong> The exact instructions for importing TLS certificates are different for different application servers. Please, refer to your application server's documentation or technical support for detailed instructions on how to install TLS certificates.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Configure the web application server to use TLS.</strong> The exact instructions for configuring web application servers to use TLS are different for different platforms. Please, refer to your application server's documentation or technical support for detailed instructions on how to install TLS certificates.</p>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}