{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "762919249",
      "Content_Hash": "2030651670"
    },
    "Metadata": [
      {
        "Id": [
          "9b361424-e366-48b4-a45d-40d70393e987"
        ],
        "Id_History": [
          "9b361424-e366-48b4-a45d-40d70393e987,70a3e1dd-f5b0-44f0-adcb-41563caa4380,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Sensitive Data Is Not Stored in View State"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Sensitive Data Is Not Stored in View State"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that sensitive data&nbsp;is not being stored in ViewState.</p>\r\n  <h1>Why</h1>\r\n  <p>By default, the ViewState does not provide any protection against information disclosure, and thus should not be used for sensitive data. Encryption can be added to the ViewState, but there is a&nbsp;large performance overhead to doing so, both in terms of CPU usage for encryption and the size of the resulting ViewState; the easiest option is to ensure that no sensitive data is in the ViewState. </p>\r\n  <h1>How to Check</h1>\r\n  <p>Examine all data which is being placed in ViewState and ensure that it is not sensitive, either alone or in combination with other data. By default, the ViewState will contain the accumulation of all the properties of all the server controls on your page. </p>\r\n  <p>To see what is&nbsp;in your ViewState at runtime, you can use ASP.NET tracing:</p>\r\n  <ol>\r\n    <li>Turn on the ASP.NET Trace </li>\r\n    <li>Submit the form on your page or in some other way force a post back </li>\r\n    <li>Scan the trace for the hidden form field __VIEWSTATE </li>\r\n    <li>The values within this hidden form field make up the contents of the ViewState</li>\r\n  </ol>\r\n  <p>Alternatively, you can review the HTML source returned by your application on the client-side and scan for the VIEWSTATE hidden field:</p>\r\n  <pre>&lt;form name=\"testForm\" method=\"post\" action=\"viewstate.aspx\" id=\"testForm\"&gt;\t<br />&lt;input type=\"hidden\" name=\"__VIEWSTATE\"&gt;</pre>\r\n  <h1>How to Fix</h1>\r\n  <p>If your ViewState does contain sensitive data, you should consider protecting it against eavesdropping by enabling ViewState encryption, as SSL does not stop ViewState from being viewed and modified on the user's computer.</p>\r\n  <p>To prevent ViewState from being viewed on the user's computer (and over the network), use ASP.NET ViewState encryption. However, do not use it if your ViewState does not contain sensitive data because encryption adds significantly to the size of the ViewState,&nbsp;which impacts performance. </p>\r\n  <p>To enable ViewState encryption use the following steps:</p>\r\n  <ol>\r\n    <li>Check that the <b>viewStateEncryptionMode</b> attribute of the <b>&lt;pages&gt;</b> element is set to <b>Always</b>, as shown in the following example. <pre>&lt;pages<br /> ...<br /> viewStateEncryptionMode=\"Always\"<br /> ...<br /> /&gt;</pre><p>If you do not want every page to use encrypted ViewState, check that the <b>viewStateEncryptionMode</b> attribute of the <b>&lt;pages&gt;</b> element is set to <b>Auto</b>, as shown in the following example. </p><pre>&lt;pages<br /> ...<br /> viewStateEncryptionMode=\"Auto\"<br /> ...<br /> /&gt;   </pre><p>Then from within your code, call the <b>RegisterRequiresViewStateEncryption</b> method as shown in the following example. </p><pre>Page.RegisterRequiresViewStateEncryption();</pre></li>\r\n    <li>Specify the encryption algorithm to use on the <b>validation</b> attribute, as shown in the following example. <pre>&lt;machineKey<br /> ...<br /> validation=\"AES\"<br /> ...<br /> /&gt;</pre><p>The <b>validation</b> attribute is overloaded and can be used to specify either the hashing algorithm or the encryption algorithm.&nbsp;You can specify either <b>3DES</b> or <b>AES</b>. Because <b>AES</b> offers larger key sizes (128 bits, 192 bits, or 256 bits) than <b>3DES</b> (56 bits), it is considered more secure and should be used.</p></li>\r\n    <li>Review the <b>decryptionKey</b> attribute of the <b>&lt;machineKey&gt;</b> element: <pre>&lt;machineKey decryptionKey=\"AutoGenerate,IsolateApps\" ... /&gt;</pre><p>Unless your application is installed in a Web farm, you should leave the <b>decryptionKey</b> attribute with the default values shown in the example.</p></li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>An ASP.NET application contains a server-side control that a user will fill in with social security number.&nbsp;The ViewState is protected from tampering by default due to the fact it is integrity checked with HMACS.&nbsp;The application's developer knows that social security information is sensitive so he requires SSL for the form post.&nbsp;This protects the information on the network; however, since ViewState is not encrypted, the social security information is visible on the user's computer to anyone who has access to the machine.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>An ASP.NET application contains a server-side control that a user will fill in with social security number. The ViewState is protected from tampering by default due to the fact it is integrity checked with HMACS. The application's developer knows that social security information is sensitive so he requires SSL for the form post to protect the information on the network. In order to also&nbsp;protect the information on the user's machine, ViewState is encrypted using ASP.NET ViewState encryption. </p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information on ASP.NET Tracing, see the <a href=\"http://msdn.microsoft.com/en-us/library/bb386420.aspx\">ASP.NET Tracing&nbsp;Overview </a>on MSDN.</li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/b4b49e15-eb5d-46b0-b56d-231ca447c053\">Guideline: Avoid Storing Sensitive Data in ViewState</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}