{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "74550313",
      "Content_Hash": "1423249287"
    },
    "Metadata": [
      {
        "Id": [
          "9c92c6af-a002-4624-aa2e-c31b6fb1f802"
        ],
        "Id_History": [
          "9c92c6af-a002-4624-aa2e-c31b6fb1f802,a05332f4-35f2-41a8-aab3-c7e32eb7b197,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Configuration Settings Are Locked to Enforce Policy Settings"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Configuration Settings Are Locked to Enforce Policy Settings"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure web applications cannot change their own configuration settings by overriding them in child configuration files.</p>\r\n  <h1>Why</h1>\r\n  <p>Locking configuration settings prevents applications from modifying configuration settings through their own web.config files. This ensures that all important security settings will be properly propagated to all applications that are hosted within the given environment.</p>\r\n  <h1>How to Check</h1>\r\n  <p>ASP.NET configuration files inherit from each other in the order that they are loaded. Hence, a web.config file in an application directory can override settings specified in the machine.config. ASP.NET loads configuration files according to configuration levels in the following order: </p>\r\n  <p>\r\n  </p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          <strong>Configuration Level</strong>\r\n        </td>\r\n        <td>\r\n          <strong>File name</strong>\r\n        </td>\r\n        <td>\r\n          <strong>Location</strong>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>Server</td>\r\n        <td>machine.config</td>\r\n        <td>%Windir%\\Microsoft.NET\\Framework\\{version}\\CONFIG</td>\r\n      </tr>\r\n      <tr>\r\n        <td>Root Web</td>\r\n        <td>web.config</td>\r\n        <td>%Windir%\\Microsoft.NET\\Framework\\{version}\\CONFIG</td>\r\n      </tr>\r\n      <tr>\r\n        <td>Web Site</td>\r\n        <td>web.config</td>\r\n        <td>The web site's root directory as identified by IIS</td>\r\n      </tr>\r\n      <tr>\r\n        <td>ASP.NET application root</td>\r\n        <td>web.config</td>\r\n        <td>The application's root directory</td>\r\n      </tr>\r\n      <tr>\r\n        <td>ASP.NET application subdirectory</td>\r\n        <td>web.config</td>\r\n        <td>The application's subdirectory</td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <p />\r\n  <p>In order to prevent certain configuration settings from being changed by web site or application specific configuration files, they should be properly locked, using the following steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the configuration settings that must be locked.</strong> Review your application's configuration settings and identify the settings that must be locked down. Common settings that should be locked include:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Connection strings</strong>: Check this setting if your application uses pre-defined connection strings that must not be altered. To locate these in a configuration file look for the <strong>connectionStrings</strong> element. </li>\r\n        <li>\r\n          <strong>Membership providers</strong>: Check this setting if your organization has adopted a centralized authentication schema and your application must comply with it. To locate these in a configuration file look for the <strong>providers</strong> element. </li>\r\n        <li>\r\n          <strong>Web resources</strong>: Check this setting if your application exposes web resources that are of a sensitive nature and require special access controls. To locate these in a configuration file look for the <strong>location</strong> element.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify the appropriate locking mechanism is applied.</strong> After identifying all elements that need to be locked, ensure that each element is protected through the appropriate locking actions.</p>\r\n      <p>To check for this in a configuration file, verify that an appropriate property from the list below has been set in the element tag. ASP.NET provides several levels of protection for its configuration settings:</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>allowOverride</strong>: Used within a <strong>location</strong> tag, this attribute locks all configuration settings for the web resource identified by the <strong>path</strong> attribute. Use this attribute when you need to lock the security settings for a specific shared resource, such as a shared authentication module. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>lockAllAttributesExcept</strong>: Locks all attributes of an element except for the ones specified. Use this attribute to ensure that only specific attributes can be modified while preserving the integrity of the other attributes. This is helpful when your application has certain assumptions about its environment and the components that it will use. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>lockAllElementsExcept</strong>: Locks all children of an element except for the ones specified. Use this attribute to ensure that only specific children of the element can be modified while preserving the integrity of the other children elements. This is helpful when your application has certain assumptions about its environment and the components that it will use. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>lockAttributes</strong>: Lock all attributes of an element. Use this attribute to prevent all modifications to an element's attributes without protecting its children. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>lockElements</strong>: Lock all children of an element. Use this attribute to protect the element's children without protecting the element's attributes. </p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>lockItem</strong>: Locks an element and its children. Use this attribute if you need to protect a block of elements that are encapsulated by a parent element. This is helpful when you need to propagate a specific security feature into all of your application's components.</p>\r\n          <p>For example, a web resource may be locked as follows:</p>\r\n          <blockquote>\r\n            <pre> &lt;location allowOverride=\"false\" path=\"myApplication1\"&gt;<br />   &lt;system.web&gt;<br />     &lt;!- final settings go here --&gt;<br />   &lt;/system.web&gt;<br /> &lt;/location&gt;</pre>\r\n          </blockquote>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is the internal HR application for MyCorp. As part of MyCorp's security policy, the application is required to enforce Windows authentication throughout all of its components. The developers have set the appropriate authentication settings in the application's root web.config. Unfortunately, they have not locked the authentication element; therefore, other developers can override the authentication element through their components' web.config files and allow other authentication mechanisms that do not comply with the application's requirements.</p>\r\n  <p />\r\n  <pre>&lt;authentication mode=\"Windows\"/&gt;</pre>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To learn more about the ASP.NET configuration file hierarchy and inheritance, visit: <a href=\"http://msdn2.microsoft.com/en-us/library/ms178685.aspx\">ASP.NET Configuration File Hierarchy and Inheritance</a>. </li>\r\n  </ul>\r\n  <h1>Related Guideline</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/01aa845d-9256-42e8-8504-df338a47a01e\">Guideline: Lock Configuration Settings to Enforce Policy Settings (ASP.NET)</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}