{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1444108572",
      "Content_Hash": "1153169116"
    },
    "Metadata": [
      {
        "Id": [
          "9ced5cc7-2dc6-4967-a6f4-4eaedc14c157"
        ],
        "Id_History": [
          "9ced5cc7-2dc6-4967-a6f4-4eaedc14c157,05fdd0d6-02ff-426b-adb9-5944ce1d8402,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Unusual Activity Is Logged to Track Suspicious Actions"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Unusual Activity Is Logged to Track Suspicious Actions"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure that the application logs events that might indicate unusual or suspicious activity. Unusual activity includes replays of old authentication tickets or too many login attempts over a specific period of time.</p>\n  <h1>Why</h1>\n  <p>Instrumenting for suspicious activity allows you to detect and react to potential problems as early as possible. </p>\n  <h1>How to Check</h1>\n  <ol>\n    <li>\n      <p />\n      <strong>Define what should be logged. </strong>Before you can check whether the correct logging is taking place, you need to&amp;nbsp;create a list that defines unusual activity for your application. Use the following list as a starting point: <ul><li>Repeated unsuccessful authentication attempts <li>Attempts to use stale session-related information or authentication tickets <li>Large and/or rapid transactions <li>Transactions that occur outside of normal time periods <li>Application errors, especially those not easily caused by user error or occuring&amp;nbsp;in deeper tiers.</li></li></li></li></li></ul><li><p><strong>Ensure the data is being logged. </strong>Once you understand what constitutes unusual activity for your application, check to ensure that it is&amp;nbsp;logged appropriately.&amp;nbsp;Appropriate logging depends upon the specific data being logged. Most applications will raise a custom event to indicate when unusual activity is occurring. </p><li><p><strong>Ensure That Logs are Monitored. </strong>Monitoring needs will depend on the application. Ensure that the applicable monitoring is in place and that the responsible staff has an appropriate response plan ready in the event of any suspicious behavior.</p></li></li></li>\n  </ol>\n  <h1>How to Fix</h1>\n  <ol>\n    <li>\n      <p />\n      <strong>Define Unusual Activity For Your Application. </strong>The first and most important step is understanding what defines suspicious activity for your application. Because the business focus of each application is unique, many of the specifics must be&amp;nbsp;determined for each application. For example, logging may be part of a larger fraud-prevention campaign. However, there are some activities that are suspicious across a wide variety of application types: <ul><li>Repeated unsuccessful authentication attempts <li>Attempts to use stale session-related information or authentication tickets <li>Large or rapid transactions <li>Transactions that occur outside of normal time periods <li>Application errors, especially those not easily caused by user error or occuring&amp;nbsp;in deeper tiers </li></li></li></li></li></ul><li><p><strong>Ensure Sufficient Data is being Logged. </strong>Once you understand what constitutes unusual activity for your application, you need to ensure that it is&amp;nbsp;logged appropriately.&amp;nbsp;Appropriate logging depends upon the specific data being logged. Example: Replays of old authentication tickets automatically raise an ExpiredTicketFailure event. To raise an event for too many login attempts, you can write an event handler for the <b>LoginError</b> event of the <b>Login</b> control. In the handler, call <b>Membership.GetUser(Login1.UserName).IsLockedOut</b> to determine if there have been too many login attempts for the user.&amp;nbsp;You can then raise a custom event to indicate that the account has been locked out.&amp;nbsp;Custom events can also be raised for a wide variety of non-authentication-related unusual activities. Other suspicious activity will require a more application-specific approach. Some suspicious activity logging will be best accomplished by parsing existing log files and looking for anomolous activity&amp;#8212;rapid transactions from a single host or user, unsually large orders, etc. </p><li><p><strong>Ensure That Logs are Monitored. </strong>Logging&amp;nbsp;will not be useful&amp;nbsp;if the results never see the light of day, so the next step is ensuring that logs are monitored and the information is acted upon. Work with the operations team who will be managing the application to define a plan for monitoring and responding to log events. Depending on the environment, you may need to define this from scratch, or you may be fitting into a pre-exisiting framework. <br />If you are&amp;nbsp;defining a monitoring framework from scratch, here are some things you need to consider: </p></li><ul><li>When do the logs need to be monitored&amp;#8212;some applications will need 24x7 coverage, but many will be fine with 8x5. <li>How much time will log monitoring take&amp;#8212;if&amp;nbsp;your application is a&amp;nbsp;large ecommerce site, you may have a dedicated team for log monitoring, but a small web app may be safe enough with a sysadmin taking a look a couple times a day. <li>What are your response time needs&amp;#8212;if there's a serious problem with the site, it will&amp;nbsp;show up in the logs first; is your tolerance for problems defined in minutes, hours, or days? <li>What will be your procedure for acting on potential issues? <li>How will you control access to your logs and information derived from them; how sensitive is the information likely to be? <li>What response capabilities will the log monitoring team have? Log monitoring on its own does no good if the information can't be acted on&amp;#8212;compromised accounts need to be locked, machines patched or taken off line, etc.</li></li></li></li></li></li></ul><li><p><strong>Avoid Pitfalls for Logging. </strong>Logging too much information can end up being a problem of its own. Once you have an idea of the volume of log events that you're seeing from your application, it may be worthwhile to implement some form of log throttling to reduce the flow of information to a rate at which you can act upon. Good log throttling should only eliminate redundant information&amp;nbsp;as well as&amp;nbsp;provide a way to surface the most important information first. Automatically taking action based on detection of anomolous conditions is a very dangerous thing to do and is&amp;nbsp;best avoided. While it may be reasonable to throttle the speed at which an event (say, a login attempt) may occur, preventing an action from occurring&amp;nbsp;may result in an easy-to-launch denial of service attack against your application. </p></li></li></li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>An e-commerce site does hundreds of transactions an hour but only keeps basic web server and database transaction logs.&amp;nbsp;When an attacker finds a vulnerability in the login script and steals several accounts&amp;nbsp;to make&amp;nbsp;a large number of high-value transactions, the break-in isn't discovered until after the merchandise has been shipped.&amp;nbsp;</p>\n  <h1>Solution Example</h1>\n  <p>An e-commerce site does hundreds of transactions an hour, and keeps a seperate security log that records unusual activity for the application.&amp;nbsp;The log is monitored 24x7 by the site operations team, who can respond quickly to attacks and if they need more assistance, they can contact the developers.&amp;nbsp;The logs contain the following categories of information (among others):</p>\n  <ul>\n    <li>Multiple account login failures for the same account or from the same address <li>Unusually large transactions, based on a customer's history and site averages <li>Multiple rapid transactions from the same customer <li>Any exceptions, http errors, or&amp;nbsp;SQL errors from security critical systems</li></li></li></li>\n  </ul>\n  <p>When an attacker finds a vulnerability in the login script and attempts to steal several accounts, the 24x7 monitoring team immediately sees the attempts in the logs, locks the accounts, blocks the attacker and works with development to deploy a fix.</p>\n  <h1>Related Guideline</h1>\n  <ul>\n    <li>\n      <a href=\"/article/dd1a00d0-7951-43f8-8f13-a719348b1b02\">Guideline: Instrument Application for Unusual Activity</a>\n    </li>\n  </ul>\n  <p />\n  <hr />\n  <p />\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}