{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1272983742",
      "Content_Hash": "-1483842057"
    },
    "Metadata": [
      {
        "Id": [
          "a210fcb7-f142-4c2e-844a-c43e0859f90d"
        ],
        "Id_History": [
          "a210fcb7-f142-4c2e-844a-c43e0859f90d,21d5e838-9461-410e-a903-d56a1c822e48,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "All Input Is Validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All Input Is Validated"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p />Ensure that all input parameters from form fields, query strings, cookies, and HTTP headers are&amp;nbsp;validated.&amp;nbsp;Validation routines should check for length, range, format, and type. Validation should check first&amp;nbsp;for known valid and safe data and then for malicious, dangerous data.<span><p /></span><h1>Why</h1><p>An attacker passing malicious input can attempt SQL injection, cross-site scripting, and other injection attacks that aim to exploit your application's vulnerabilities.</p><h1>How To Check</h1><p>To check for this problem, use the following steps:&amp;nbsp;</p><ol><li><p><strong>Find all sources of input.</strong> During design time identify all of the potential sources of input parameters to your application. Scour the source code to discover sources of input that may have been missed in the design.&amp;nbsp;Compile a list that you can use in the following steps. The most common sources are:</p><ul><li>Form Fields </li><li>Query Strings </li><li>Cookies </li><li>HTTP Headers</li></ul></li><li><p><strong>Trace data from source to sink.</strong> Trace each of source of input through your application until you find its ultimate destination.&amp;nbsp;The final sink may be in memory, on the hard drive, sent over the network or stored in a database.</p></li><li><p><strong>Identify validation routines.</strong> Each input source should have a data validation routine associated with it. Ideally the validation will occur as soon after the input reaches your application as possible.&amp;nbsp;Shared validation routines are better than creating many spread throughout your code base, check for consolidation of routines to aid testing and reduce the chance of one-off bugs.&amp;nbsp;If an input source does not have a validation routine associated with it, flag it for fixing.</p></li><li><p><strong>Ensure quality of validation routines.</strong> Validation routines&amp;nbsp;should check for length, range, format, and type. Validation should check first&amp;nbsp;for known valid and safe data and then for malicious, dangerous data.&amp;nbsp;Do not rely on filtering out all malicious data, it is too easy to miss something. Do not rely on client-side validation alone as it can be easily bypassed.</p></li></ol><h1>How To Fix</h1><p>Check for known good data and constrain input by validating it for type, length, format, and range. For Web form applications that obtain input through server controls, use the ASP.NET validator controls, such as the <em>RegularExpressionValidator</em>, <em>RangeValidator</em>, and <em>CustomValidator</em>, to validate and constrain input. Check all numeric fields for type and range. If you are not using server controls, you can use regular expressions and the <em>Regex</em> class, and you can validate numeric ranges by converting the input value to an integer or double and then performing a range check.&amp;nbsp;Validate your input against the least permissive expression possible that will accept all the input you expect for that field.&amp;nbsp;If you know that the field will have certain internal structure, check for it.&amp;nbsp;If your input has an internal checksum, like a credit card number, check that too. </p><p>Most Web applications accept input from various sources, including HTML controls, server controls, query strings, and cookies.&amp;nbsp;Validate input from all of these sources to help prevent injection attacks. Use regular expressions to help validate input. The following example shows how to use the <em>Regex</em> class. </p><pre>using System.Text.RegularExpressions ;<br />// Instance method:<br />Regex reg = new Regex(@\"^[a-zA-Z'.\\s]{1,40}$\");<br />Response.Write(reg.IsMatch(Request.QueryString[\"Name\"]));<br />// Static method:<br />if (!Regex.IsMatch(Request.QueryString[\"Name\"],@\"^[a-zA-Z'.\\s]{1,40}$\"))<br />{<br />   // Name does not match expression<br />}</pre><p>If you cannot cache your regular expression for frequent use, you should use the static IsMatch method where possible for performance reasons, to avoid unnecessary object creation. </p><p>Remember that validating input does not remove the need to format output, parameterize queries, or otherwise handle user input carefully. </p><h1>Related Items</h1><ul><li><a href=\"/article/3de41277-0cc1-4ebc-8dd7-e96d161aa0ef\">Validate All Input</a></li></ul><hr /><p>Adapted from Microsoft patterns &amp; practices guidance. </p><h1></h1><h1></h1>"
        ]
      }
    ]
  }
}