{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1458410969",
      "Content_Hash": "-2057586900"
    },
    "Metadata": [
      {
        "Id": [
          "a4ebbfd1-a7c3-48b6-8552-9eb776b570a2"
        ],
        "Id_History": [
          "a4ebbfd1-a7c3-48b6-8552-9eb776b570a2,7016fbbb-d954-431b-a598-9c5a00938142,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] When Using SQL Authentication, Protect Credentials Over The Network"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "When Using SQL Authentication, Protect Credentials Over The Network"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that the credentials are secured over the network by using IPSec or SSL when using SQL Server authentication.</p>\r\n  <h1>How to Fix</h1>\r\n  <p>If your application is not located in a physically secure isolated data center, you should use Internet Protocol Security (IPSec) or SSL to create an encrypted communication channel between the Web server and database server if your use SQL authentication. When you connect to SQL Server with SQL authentication, the credentials are not encrypted prior to transmission across the network, so&amp;nbsp;failure to&amp;nbsp;use an encrypted channel&amp;nbsp;means that credentials can be easily captured with a network monitor. </p>\r\n  <p>Use SSL when you need granular channel protection for a particular application instead of for all applications and services running on a computer. If you want to protect all the IP traffic between Web and database server, use IPSec. You can also use IPSec to restrict which computers can communicate with one another. For example, you can help protect a database server by establishing a policy that permits requests only from a trusted client computer, such as an application or Web server. You can also restrict communication to specific IP protocols and TCP/UDP ports.</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}