{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1902423105",
      "Content_Hash": "-734366425"
    },
    "Metadata": [
      {
        "Id": [
          "abd1c0b2-5557-4114-b381-f47f00a70f76"
        ],
        "Id_History": [
          "abd1c0b2-5557-4114-b381-f47f00a70f76,e4d83b51-b266-4ba1-9417-d6f97fc7aa8c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Communication Links Are Encrypted"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Communication Links Are Encrypted"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure that the communication channels are encrypted when interacting with other software across the network.</p>\n  <h1>Why</h1>\n  <p>Encrypting the communication links allows the application to preserve confidentiality and integrity of the transmitted data.</p>\n  <h1>How to Check</h1>\n  <p>Use the following steps to ensure that your application's communication links are encrypted:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify the connections used for transmitting sensitive data. </strong>Identify the sensitive data that is sent over the network and enumerate&amp;nbsp;the respective connections that are used for such communication.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Verify that connections are secured. </strong>Using a network sniffer, verify that your application utilizes either IPSec or TLS then check the following:</p>\n      <ul>\n        <li>\n          <p>\n            <strong>IPSec</strong>:&amp;nbsp;If your application uses IPSec, verify that&amp;nbsp;all packets from your sniffed traffic between the specified hosts contain an Authentication Header (AH) and Encapsulating Security Payload (ESP) fields after the IP headers.</p>\n        </li>\n      </ul>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>To encrypt the communication links:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify the connections used for transmitting sensitive data. </strong>Enumerate all connections between the different servers with other servers or with the application. Identify the sensitive data that is sent over the network and the respective connections that are used for such communication.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Choose the appropriate encryption mechanism. </strong>Depending on the infrastructure, you may consider using IPSec or TLS.</p>\n      <ul>\n        <li>\n          <strong>IPSec:</strong> IPSec is used when the encryption needs to be applied across all involved parties. Since IPSec is designed to secure connections between static hosts that are \"always on,\" use IPSec to secure the network connections between your application's servers. Due to its nature, IPSec requires low level support; therefore, your application would need support from the operating system or a JNI component to manage it. </li>\n        <li>\n          <strong>TLS:</strong> TLS provides a granular protection which&amp;nbsp;allows only&amp;nbsp;the traffic containing sensitive data to be encrypted. Because TLS has a certificate based design, it allows the protection of data between mobile hosts. Use TLS to secure the communication channel between your application and its users.<br /><br />While Java provides APIs for handling TLS encrypted traffic, it is recommended to follow the manuals associated with the&amp;nbsp;third party software that&amp;nbsp;is being used. For example, if your application connects to a database server, follow the database server's manual on setting up the encryption; if your application is web-oriented, follow the web server's documentation on setting up the TLS certificate. </li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Apply the appropriate encryption mechanism. </strong>Apply the encryption mechanism of choice at the appropriate locations in the code. Such locations include all functionality that establishes a connection between your application and another entity.</p>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>The following code establishes a connection between&amp;nbsp;two servers. Unfortunately, the communication is not encrypted; therefore, it is possible for an attacker to eavesdrop on the connection.</p>\n  <pre>String remoteHost = \"server02.example.com\";<br />int remotePort = \"1337\";<br /><br />Socket sock = new Socket(remoteHost, remotePort);<br />InputStreamReader isr = new InputStreamReader(sock.getInputStream());<br />BufferedReader input = new BufferedReader(isr);<br />PrintWriter output = new PrintWriter(sock.getOutputStream(), true);</pre>\n  <h1>Solution Example</h1>\n  <p>The following code establishes a connection between&amp;nbsp;two servers. Because the communication is encrypted, the confidentiality of the data in transit is preserved; therefore, it is impossible for an attacker to eavesdrop on the connection.</p>\n  <pre>String remoteHost = \"server02.example.com\";<br />int remotePort = \"1337\";<br /><br />SSLSocketFactory sslSF = (SSLSocketFactory) SSLSocketFactory.getDefault();<br />SSLSocket sslSock = (SSLSocket) sslSF.createSocket(remoteHost, remotePort);<br /><br />InputStreamReader isr = new InputStreamReader(sslSock.getInputStream());<br />BufferedReader input = new BufferedReader(isr);<br />PrintWriter output = new PrintWriter(sslSocket.getOutputStream(), true);</pre>"
        ]
      }
    ]
  }
}