{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "59546272",
      "Content_Hash": "-877933105"
    },
    "Metadata": [
      {
        "Id": [
          "af8c3ff3-490d-40fe-bed3-eca342fdba4e"
        ],
        "Id_History": [
          "af8c3ff3-490d-40fe-bed3-eca342fdba4e,c6ed32d4-ed07-4a67-b57b-ba971571cc6a,"
        ],
        "Library_Id": [
          "c037d0d2-0617-44f3-b846-21dc3d02c4f8"
        ],
        "Title": [
          "Redirects And Forwards Are Not Used Unless Necessary"
        ],
        "Category": [
          "Design Considerations"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Redirects And Forwards Are Not Used Unless Necessary"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that redirects and forwards are not used unless necessary.</p>\r\n  <h1>Why</h1>\r\n  <p>Redirects or forwards may be manipulated by an attacker to create hyperlinks that appear to point to legitimate sites, but actually point to attacker-controlled malicious pages. This technique is often used by phishers to trick people into trusting a fake web site.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to verify that redirects and forwards are not used unless necessary:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Review application design.</strong> Look through project documentation for any mentions of redirects or forwards. Ideally, there should be no redirects or forwards in the application design.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Review code.</strong> Search code for redirects or forwards. Because there are many different ways to implement redirects and forwards, look through every page for code that handles parameters, and verify that this code doesn't perform redirects or forwards based on input.</p>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following actions to avoid using redirects or forwards:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Enumerate redirects and forwards.</strong> Review application code to find all redirects and forwards used by the application.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Review application design.</strong> Determine how redirects and forwards figure into the application design. Consider making design changes to remove the need for redirects and forwards.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Remove redirects or forwards.</strong> Remove the redirects and forwards that are not necessary after changes to the application design.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Secure the remaining redirects or forwards.</strong> If there appears to be no reasonable way to get rid of redirects or forwards, use related guidelines to secure the remaining redirects or forwards.</p>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>Consider an on-line banking application that has an insecure redirect:</p>\r\n  <p>\r\n    <pre>http://www.onlinebank.com/redirect.asp?url=&#91;destination&#93;</pre>\r\n  </p>\r\n  <p>A phisher may create the following hyperlink to point to his site and send it in spam messages to millions of people:</p>\r\n  <p>\r\n    <pre>http://www.onlinebank.com/redirect.asp?url=www.phisher.com</pre>\r\n  </p>\r\n  <p>When a user sees a link that appears to point to his bank at onlinebank.com in an e-mail message, he clicks that link and sees a web site that looks exactly like the bank's, but is actually a phishing web site used to steal authentication credentials. The user enters his account number and PIN into the web page, receives an error message telling him to try again, and is redirected to the bank's real site. After entering his credentials again, the user successfully views his account. However, the phisher now has the user's online banking information.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>The best solution to unvalidated redirects or forwards is to not use redirects or forwards at all. Considering the problem example above, a simple solution would be to remove the redirect.asp page after making the necessary changes to the application design.</p>\r\n  <h1>Redirect and Forward&nbsp;Validation&nbsp;Guidelines</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/9dd99e67-7f4b-4c3b-b355-253edd7b29a3\">Don't Use Redirects or Forwards if Possible</a>\r\n      <li>\r\n        <a href=\"/article/6daf44c7-fe2c-45f6-8854-7aa1e3a1030f\">Calculate Destinations of Redirects and Forwards Without User Input</a>\r\n        <li>\r\n          <a href=\"/article/f86bc5a9-e545-461b-9ba5-c6659841250e\">Validate Destinations of Redirects and Forwards</a>\r\n          <li>\r\n            <a href=\"/article/d718d5f2-247e-4299-a6ca-bfeaaac67eea\">Use Mapping Values When Redirecting on User Input</a>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ul>\r\n  <h1>Redirect and Forward Validation&nbsp;Checklists</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/af8c3ff3-490d-40fe-bed3-eca342fdba4e\">Redirects and Forwards Are Not Used Unless Necessary</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/a1061c45-7a6e-4257-ab36-f3a693d45ad3\">Destinations of Redirects and Forwards Are Calculated Without User Input</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/f87f29d2-388b-4d5f-bab5-bdf7b17eff85\">Destinations of Redirects and Forwards Are Validated</a>\r\n    </li>\r\n    <li>\r\n      <a href=\"/article/ff0f750a-308b-4c78-8602-3c6d603e406d\">Mapping Values Are Used for Redirects and Forwards</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}