{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-700549902",
      "Content_Hash": "1880258264"
    },
    "Metadata": [
      {
        "Id": [
          "b1803c35-9579-4a38-9a63-30202160ef25"
        ],
        "Id_History": [
          "b1803c35-9579-4a38-9a63-30202160ef25,5e5c0989-4cc9-4ba5-950d-4553f2a6935c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "The Application Does Not Rely on Client-Side Validation"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Application Does Not Rely on Client-Side Validation"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that all input validation is performed on the server. Client-side validation should only be used for performance and usability reasons. </p>\r\n  <h1>Why</h1>\r\n  <p>Client-side validation is executed by the client and can be easily bypassed. Client side validation is a major design problem when it appears in web applications. It places trust in the browser, an entity that should never be trusted.</p>\r\n  <h1>How to Check</h1>\r\n  <p>An application can take input via various ways such as a web interface, database, file system or other software running on the server. Use the following steps to establish a validation strategy:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all sources of input. </strong>During design time, identify all of the potential input sources to your application. Scour the source code to discover sources of input that may have been missed in the design. Compile a list that you can use in the following steps. The most common sources are: </p>\r\n      <ul>\r\n        <li>URL based parameters </li>\r\n        <li>Form based parameters </li>\r\n        <li>Hidden fields </li>\r\n        <li>Cookies </li>\r\n        <li>HTTP headers (Host, accept types, www authentication, cache settings, encodings, etc) </li>\r\n        <li>Local filesystem </li>\r\n        <li>Database </li>\r\n        <li>Other services running on the system </li>\r\n        <li>Javascript variables </li>\r\n        <li>File upload and attributes (filename, size, data, etc) </li>\r\n        <li>DNS results or host names </li>\r\n        <li>External component call return values (COM, AJAX, ActiveX) </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify validation routines. </strong>Each input source should have a server side validation routine associated with it. Ideally the validation will occur as soon as the input reaches your application. Shared validation routines are better than creating many throughout the code base and may be located in a single component.</p>\r\n      <p>Validation may be identified by any of the following:</p>\r\n      <ul>\r\n        <li>Custom Java Validator class </li>\r\n        <li>Regular expression use (<em>java.util.regex</em>) </li>\r\n        <li>Method names that contain <em>validate</em> or <em>validator</em></li>\r\n        <li>Client-side validation is often linked to events: <ul><li>onSubmit </li><li>onChange </li><li>onFocus </li><li>onBlur </li><li>onKeyDown/Press/Up</li></ul></li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure validators run on the server. </strong>At a minimum, validation routines should run on the server. Server-side validation guarantees that malformed input will be caught and discarded regardless of the state that the client is in. As an optional feature, validation can also be implemented client side in order to improve application performance and user experience.<br /><br />Server-side validation is done within the application code. Ideally validation occurs immediately after canonicalization, and canonicalization should be done&amp;nbsp;as soon as the input reaches your application. In web applications, look for application-supplied validators, such as a Custom Java Validator, to validate and constrain input after it is received from an input source, such as a <em>GET</em> parameter. Check for the use of regular expressions and <em>java.util.regex</em>, or the use of a validator that checks numeric ranges.</p>Client-side Example: <pre>//The validation function is defined in JavaScript in the client-side form<br />&lt;script language=\"JavaScript\"&gt; function validate()<br />{<br /> ...<br />}<br />&lt;/script&gt;<br />...<br />// The application uses validation in the client-side form to validate the input<br />&lt;form method=\"post\"<br /> action=\"/myapp/aggregate\"<br /> onsubmit=\"return validate()\"&gt;</pre><p>Server-side Example:</p><pre>//The input \"searchTerm\" is received from a request<br />String searchTerm = request.getParameter(\"index\");<br />...<br />// The application uses validation in the application code to validate the input<br />if (validateSearchTerm(searchTerm))<br />{<br />      ...<br />}</pre></li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Client-side validation should only be used to improve user experience, never for security purposes. A client-side input validation check can improve application performance by catching malformed input on the client and, therefore, saving a roundtrip to the server. However, client side validation can be easily bypassed and should never be used for security purposes. Always use server-side validation to protect your application from malicious attacks.</p>\r\n  <p>Use the following steps when developing client side validation: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Never trust the browser.</strong> Because the browser is running on the user's machine, it can be fully controlled by the user. Therefore, any client-side validation code can be controlled and bypassed by an attacker.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use JavaScript only to enhance your pages.</strong> JavaScript is useful for enhancing your application's presentation. However, it has no mechanism to protect the integrity of its code. Do not rely on JavaScript to enforce security decisions. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Place a server-side validator for all input. </strong>Input validation should be executed on the server side. Use the following steps to properly set the validation routines: </p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Identify input.</strong> Determine the data that is to be passed from the client to your application. Input can take the following forms on the client-side:</p>\r\n          <ul>\r\n            <li>URL-based parameters </li>\r\n            <li>Form-based parameters </li>\r\n            <li>Hidden fields </li>\r\n            <li>Cookies</li>\r\n          </ul>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Understand the input.</strong> Understand the use and constraints associated with each input. Be clear how each input is used. Define the format and type of each input. Build a server-side validator for each format and type of expected input.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Create a set of validators.</strong> Build a validator for each type of input. Place the set of validators on the server-side of your application. If there are validators on the client-side, make sure the same validators are implemented on the server-side as well.<br /></p>\r\n        </li>\r\n      </ul>\r\n      <p>Once developed, it is important to place the validation routines at your application's trust boundary. Because your application's trust boundary extends only to your application's process space, the user's browser should not be considered&amp;nbsp;a part of your application's trust boundary.</p>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}