{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "516101259",
      "Content_Hash": "-1956227160"
    },
    "Metadata": [
      {
        "Id": [
          "b698d208-b554-4b6e-8233-4a11d838f57b"
        ],
        "Id_History": [
          "b698d208-b554-4b6e-8233-4a11d838f57b,b6aed927-2d10-4ddf-84b0-5777b1735b68,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Untrusted Code Does Not Use Reflection.Emit to Create Dynamic Assemblies."
        ],
        "Category": [
          "Dangerous APIs"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Untrusted Code Does Not Use Reflection.Emit to Create Dynamic Assemblies."
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Check to ensure that untrusted code does not use Reflection.Emit to create dynamic assemblies.</p>\n  <p />\n  <h1>How to Fix</h1>\n  <p>If your application dynamically generates code through the use of <b>Reflection.Emit</b>, do not allow untrusted code or data to influence the code generation. If an attacker can influence the code generation, the attacker could coerce your application into generating malicious code. This is particularly significant if your code uses user-supplied input to generate code dynamically.</p>\n  <p>There are some scenarios, such as script engine implementation, in which it is necessary to allow untrusted input to drive <b>Reflection.Emit</b>. If your assembly dynamically generates code to perform operations for a caller and the caller operates at a lower trust level, be especially vigilant for security vulnerabilities. Validate any input string used as a string literal in your generated code and escape quotation mark characters to make sure that the caller cannot break out of the literal and inject code. If there is a way that the caller can influence the code generation so that it fails to compile, treat the problem as a potential security vulnerability.</p>\n  <hr />\n  <p>Adapted from Microsoft patterns &amp; practices guidance.</p>"
        ]
      }
    ]
  }
}