{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "865970262",
      "Content_Hash": "545735889"
    },
    "Metadata": [
      {
        "Id": [
          "b69c04f6-cbb0-41cc-a947-5b96a63c10c5"
        ],
        "Id_History": [
          "b69c04f6-cbb0-41cc-a947-5b96a63c10c5,5a20afc4-0831-45d7-b1c1-866f5d1e1e68,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Logging Is Throttled"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Logging Is Throttled"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Verify that logging is throttled.</p>\n  <h1>Why</h1>\n  <p>Throttle logging of events when they occur at very high frequencies. When identical events occur multiple times, make a single entry that states that such an event occurred and the amount of times it occurred.</p>\n  <h1>How to Check</h1>\n  <p>Use the following steps to verify if logging is throttled.</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Determine if log throttling is necessary.&nbsp;</strong> Use log throttling when important events may occur at a frequency that may overwhelm the logging subsystem. </p>\n      <li>\n        <p>\n          <strong>Identify logging requirements.</strong> Consider which events might occur at a high frequency and may be throttled without losing valuable auditing information. Make a list of all events for which logging should be throttled. Use this list to guide implementation.</p>\n        <li>\n          <p>\n            <strong>Verify that logging is throttled.</strong> Use the list of events for which logging should be throttled to identify code that generates the corresponding log entries. Examine this code to verify that logging is throttled by counting identical or similar events that occur at a high frequency and producing a single record that includes the details of the event and the amount of times it has occured.</p>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Perform the following actions to throttle logging:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Consider log throttling.</strong> Use log throttling when important events may occur at a frequency that may overwhelm the logging subsystem. </p>\n      <li>\n        <p>\n          <strong>Identify logging requirements.</strong> Consider which events might occur at a high frequency and may be throttled without losing valuable auditing information. Make a list of all events for which logging should be throttled. Use these requirements for implementation.</p>\n        <li>\n          <p>\n            <strong>Implement log throttling.</strong> Use the list of events for which logging should be throttled to identify code that generates the corresponding log entries. Modify this code to throttle logs by counting identical or similar events that occur at a high frequency and producing a single record that includes the details of the event and the amount of times it has occured.</p>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/7af4efea-59f5-468a-b5a1-c423cd29744a\">Centralize Logging</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}