{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "921825858",
      "Content_Hash": "1769788733"
    },
    "Metadata": [
      {
        "Id": [
          "bf298d0e-9433-44c1-b9af-66ba69662d18"
        ],
        "Id_History": [
          "bf298d0e-9433-44c1-b9af-66ba69662d18,a924ca55-4791-46d2-a3e9-4a1f5d40c43e,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Structured Exception Handling Is Used"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Structured Exception Handling Is Used"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Check to ensure structured exception handling is used to catch error conditions.</p>\r\n  <h1>Why</h1>\r\n  <p>The classic approach for error handling was to use the codes that functions return in order to evaluate the success or failure of certain operations. However, with a nontrivial function call hierarchy, this approach clutters the code significantly. Every function must check the return code of every function call it makes and take care of errors. In most cases, the function will merely pass any errors back up to its caller. Complex ASP.NET applications may have several hundred internal functions and a call hierarchy many levels deep, so this approach is difficult to maintain. Using structured exception handling simplifies and de-clutters the application code, which improves robustness and avoids leaving the application in an inconsistent state. It provides the application more information regarding the encountered error and minimizes the risk of information disclosure. </p>\r\n  <h1>How To Check</h1>\r\n  <p>All code in your application that may fail should either be enclosed in a <em>try/catch/finally </em>block or caught by a global exception handler.&nbsp;Catching exceptions close to the source can improve error messages both for user experience and debugging purposes.&nbsp; </p>\r\n  <p>The code that may fail should be enclosed in a <em>try</em> statement such as:</p>\r\n  <p>\r\n    <em>try<br />{<br />&nbsp;&nbsp;&nbsp; //error prone code<br />}</em>\r\n  </p>\r\n  <p>A <em>catch</em> block may follow the <em>try</em> block if you want to execute error handling code including resource cleanup necessary in an error condition and any work needed to fail to a secure state.&nbsp;<em>Catch</em> blocks are the right place to do exception logging and add more information to the existing exception. In most cases you should rethrown the exception so that exception handlers above your code can react appropriately. You should only consume an exception if you can handle the error completely:</p>\r\n  <pre>catch(SomeExceptionClass e)<br />{<br />&nbsp;&nbsp;&nbsp; //error handling code<br />}</pre>\r\n  <p>It is ok to use <em>try/finally</em> without a <em>catch</em> block, especially when you cannot handle the exception and just need to make sure cleanup code is run.&nbsp;You should next create a <em>finally</em> block that performs cleanup or any other operations that should occur regardless of whether the code succeeds or fails</p>\r\n  <pre>finally<br />{<br />&nbsp;&nbsp;&nbsp; //resource cleanup code<br />}</pre>\r\n  <h1>How To Fix</h1>\r\n  <p>Exception handlers should be as specific and relevant as possible. When multiple exceptions are anticipated, the <em>try/catch</em> block should have multiple catch clauses to satisfy each type of exception. Consider the following aspects when constructing your application's exception handlers:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Location of handlers.</strong> The location of your exception handlers is very important if your code is to recover properly without damaging other parts of your application. Placing your handler closer to the exception source allows your application to have better information of the current operation and properly recover the appropriate resources.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Purpose of handlers.</strong> Carefully choose the purpose of your exception handlers. Although developers commonly use exception handlers to wrap up after their code has failed, exception handlers provide a mechanism for recovering allocated resources and safely disposing them. Keep track of the associated resources and handle them accordingly when an exception is thrown. For instance, if your code throws a <em>SQLException</em>, verify that your application's database components are back into a safe state. If your code handles sensitive data, ensure that all instances of sensitive data inside your block of code have been safely disposed of.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Exception data.</strong> Because it is a common practice to log exceptions to help troubleshoot a problem, make sure that your exceptions do not contain sensitive data that could compromise your application's users or assets when logged.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Type of handlers.</strong> Always catch the type of exceptions that best fit your application's efforts to recover into its normal state of operation upon encountering an error. If a block in your application is expected to throw multiple types of exceptions, make sure that each exception type is handled accordingly. For example, if a <em>SQLException</em> and <em>SecurityException</em> are expected, then there should be an exception handler for each type of exception: </p>\r\n      <pre>try<br />{<br />    // Execute SQL statement<br />}<br />catch (SqlException sqlEx)<br />{<br />    // Add appropriate exception handling<br />    // E.g.: Check database connectivity and restore lost connections<br />     // Log the event<br />}<br />catch (SecurityException secEx)<br />{<br />    // Add appropriate exception handling<br />    // E.g.: Notify the user of insufficient privileges <br />    // Log the event<br />}</pre>\r\n      <p>\r\n        <strong>Note:</strong> The example above assumes that there is a global exception handling mechanism placed at the root of the code execution.&nbsp; </p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <em>You may find these additional articles useful</em>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/afb7610c-53ab-49dd-a425-f3e3272f7749\">Use Structured Exception Handling</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>\r\n  <h1>\r\n  </h1>\r\n  <h1>\r\n  </h1>"
        ]
      }
    ]
  }
}