{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1462664627",
      "Content_Hash": "211354744"
    },
    "Metadata": [
      {
        "Id": [
          "c468e4b0-92cc-4558-8532-e0c77606efa5"
        ],
        "Id_History": [
          "c468e4b0-92cc-4558-8532-e0c77606efa5,28546cac-471d-49dd-ab48-4c611e7e3ccb,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Password Renewal Is Enforced"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Password Renewal Is Enforced"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure your application enforces a password expiry policy.</p>\n  <h1>Why</h1>\n  <p>Forcing users to renew their passwords reduces the risk of valid credentials becoming exposed. While this technique can prevent attackers from obtaining the valid credentials through the use of a Credentials Brute Force Attack or a Credentials Dictionary Attack attacks, it can also reduce the business risk associated with any instances of “discovered” or “leaked” valid credentials.</p>\n  <h1>How to Check</h1>\n  <p>Use the following steps to ensure your application has a password expiry policy: </p>\n  <ol>\n    <li>\n      <p>\n        <strong>Locate all authentication code.</strong> Identify all authentication procedures throughout your application.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Ensure that your application enforces password renewal.</strong> Ensure that your application addresses the need for password renewal throughout the different stages of your application's development lifecycle:</p>\n      <ul>\n        <li>\n          <strong>Requirements</strong>: Check if your application provides a password policy. Ensure that the password policy provides requirements regarding lifetime of passwords. For example, a password will expire after 45 days. <br /></li>\n        <li>\n          <strong>Design</strong>: Check if all password renewal routines are positioned properly throughout your application's authentication routines. For instance, if a user's password is expired, your application's authentication routine should force the user to renew their password upon a successful logon. </li>\n        <li>\n          <strong>Implementation</strong>: Check if all password renewal routines implement your application's password policy. </li>\n      </ul>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>The following code is part of the application's authentication routine. Because the application fails to force the user to renew their password, it allows more time for an attacker to guess the user's password.</p>\n  <pre>&lt;!-- The application's login control --&gt;<br />&lt;asp:Login ID=\"Login1\" runat=\"server\" DestinationPageUrl=\"~/Protected.aspx\" /&gt;<br /> // The Page_Load method of Protected.aspxprotected<br /> void Page_Load(object sender, EventArgs e){}</pre>\n  <br />\n  <hr />\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}