{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1773438820",
      "Content_Hash": "1366522817"
    },
    "Metadata": [
      {
        "Id": [
          "d02961a8-f8c9-48c7-99be-708ae5259910"
        ],
        "Id_History": [
          "d02961a8-f8c9-48c7-99be-708ae5259910,b524f8cf-af1f-49e3-b79b-d2d4b6a7ac30,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Echoed Input Is Encoded"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Echoed Input Is Encoded"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure that input is not echoed back to the user without first validating and/or encoding the data. Data which can be modified by a user must be treated as untrusted data.</p>\r\n  <h1>Why</h1>\r\n  <p>Echoing input directly back to the user makes your application susceptible to some code injection attacks, such as Cross-Site Scripting attacks. What constitutes malicious input varies widely depending on the system in question. On the web, it normally means some kind of JavaScript.</p>\r\n  <h1>How To Check</h1>\r\n  <p>Use the following steps to ensure that input which can be modified by a user is properly validated and encoded before being echoed back to the user:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all sources of user input.</strong> Determine all the possible tainted inputs to the application. The following list includes some common input sources:</p>\r\n      <ul>\r\n        <li>Form Fields </li>\r\n        <li>Query strings </li>\r\n        <li>Databases and data access methods </li>\r\n        <li>Cookie collection </li>\r\n        <li>Session and application variables</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all output that includes user input.</strong> Trace all inputs to the system though and determine all the code that will output it as a part of HTML, URL, JavaScript, CSS and XML contexts. Make a spreadsheet that contains all this information.<br /></p>\r\n    </li>\r\n    <li>\r\n      <b>Make sure the Microsoft AntiXSS library is used to encode special characters in data that is being displayed in HTML, URL, JavaScript, CSS and XML contexts.</b> Examine each piece of code that displays untrusted data in HTML, URL, JavaScript, CSS and XML contexts and make sure that corresponding functions from the AntiXSS library are used to encode the special characters in each piece of untrusted data at the very last moment before that piece of data is output. <br /></li>\r\n  </ol>\r\n  <h1>How To Fix</h1>\r\n  <p>If you write output that includes user input or data from a shared database or a local file that you do not trust, encode it. Encoding the data ensures that it is treated as literal text and not as script. Use the following guidelines to encode user input:</p>\r\n  <ol>\r\n    <li>\r\n      <b>Use the Microsoft AntiXSS library. </b>The AntiXSS library is a part of .NET starting with .NET 4.5. For projects using .NET 4.0, it has to be added using NuGet. The AntiXSS library can encoded data in HTML, URL, JavaScript, CSS and XML contexts.<br /></li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all sources of user input.</strong> Determine all the possible tainted inputs to the application. The following list includes some common input sources:</p>\r\n      <ul>\r\n        <li>Form Fields </li>\r\n        <li>Query strings </li>\r\n        <li>Databases and data access methods </li>\r\n        <li>Cookie collection </li>\r\n        <li>Session and application variables</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all output that includes user input.</strong> Trace all inputs to the system though and determine all the code that \r\nwill output it as a part of HTML, URL, JavaScript, CSS and XML contexts.\r\n Make a spreadsheet that contains all this information.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Encode all special characters based on context.</strong> Use the corresponding functions in the Microsoft AntiXSS library to encode the data that is being displayed in HTML, URL, JavaScript, CSS and XML contexts. Encode that data at the last possible moment before displaying it to reduce the possibility of double-encoding bugs.<br /></p>\r\n    </li>\r\n  </ol>\r\n  <ol>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To download the Anti-XSS library, go to <a href=\"https://www.nuget.org/packages/AntiXSS/\">https://www.nuget.org/packages/AntiXSS/\r\n</a></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}