{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "29106921",
      "Content_Hash": "979956006"
    },
    "Metadata": [
      {
        "Id": [
          "d33cc3de-517c-4c84-95bd-24f14d9d99d6"
        ],
        "Id_History": [
          "d33cc3de-517c-4c84-95bd-24f14d9d99d6,4e46da46-be73-417e-9fff-d48e00acfd52,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Debug Data Is Not Included in Output"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Debug Data Is Not Included in Output"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that debug information is not disclosed to the client.</p>\r\n  <h1>Why</h1>\r\n  <p>Debug information may have sensitive information, such as call stacks, fragments of the source code and more. This information may aid an attacker by giving them inside-information.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Debug information is often displayed in error messages during development in order to speed up the debugging process. After deployment, such output can greatly aid an attacker by revealing details about your application that normally would not be accessible. In order to prevent such information disclosure, verify the following:</p>\r\n  <ol>\r\n    <li>\r\n      <strong>Ensure that proper exception handling is used. </strong>Proper exception handling will prevent debug and source data from being disclosed to the user and allow your application to exit gracefully. There are two types of exception handling mechanisms that can be used: <ul><li><strong>Dynamic handling</strong>: Verify that the root execution code is executed inside a traditional <em>try/catch/finally</em> block. <li><strong>JSP error pages</strong>: Verify that error pages are defined for each exception type (making certain there is one covering <em>java.lang.Throwable</em>) as well as any applicable HTTP error codes in your application's web deployment descriptor (e.g. <em>web.xml</em>) using a &lt;<em>location</em>&gt; tag that points to a JSP error page with the <em>isErrorPage</em> attribute set to true.</li></li></ul><li><p><strong>If necessary, use a logging mechanism to collect debug information. </strong>If it is necessary to collect debug information for later analysis, use a logging mechanism to reduce the risk of an attacker gaining access to the information.</p><ul><li>Consult your application's designs to determine the appropriate framework for logging debug messages. <li>Identify all catch and finally clauses, and ensure that debug messages are not sent to the client. Ensure error messages are generic and all necessary debug information is collected via your application's logging framework. </li></li></ul></li></li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>The purpose of debug information is to identify and troubleshoot potential problems within your application. Use the following steps to ensure debug information is not transmitted to the client:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Collect debug information via a logging mechanism.</strong> Use a logging mechanism instead of transmitting debug information through the HTTP response to the client. </p>\r\n      <li>\r\n        <p>\r\n          <strong>Use proper exception handling.</strong> There are two approaches to placing an exception handler that allows your application to exit gracefully and hide debug and source data from the user:</p>\r\n        <ul>\r\n          <li>\r\n            <p>\r\n              <strong>Dynamic Handling</strong>: This allows the handling to be conducted inside the Java code. It consists of placing the entire root execution code inside a <em>try/catch/finally</em> block. Using dynamic handling allows your application to log the error and provide an error message to the user without having to disclose any detailed information about the raised exception. Example: </p>\r\n            <pre>public void doGet(HttpServletRequest request,<br />      HttpServletResponse response) throws ServletException, IOException<br />&amp;#123;<br />      PrintWriter out = response.getWriter();<br />      workDone = false;<br /><br />      try<br />      &amp;#123;<br />            ...<br />      &amp;#125;<br />      catch (Exception e)<br />      &amp;#123;<br />            // Add appropriate logging and exception handling mechanisms<br />             out.println(\"An error has occurred.\");<br />      &amp;#125;<br />      out.flush();<br />      out.close();<br />&amp;#125;</pre>\r\n            <li>\r\n              <p>\r\n                <strong>JSP Error Pages</strong>: JSP error pages provide an effective way of telling the user that something went wrong. The location of the appropriate error page is specified in your application's web deployment descriptor (e.g. web.xml) using the <em>&lt;location&gt;</em> tag. </p>\r\n              <p>For example:</p>\r\n              <pre>&lt;&amp;#33;-- Catch a system error using an HTML page --&gt;<br />&lt;error-page&gt;<br />  &lt;exception-type&gt;java.lang.NullPointerException&lt;/exception-type&gt;<br />  &lt;location&gt;/NPEerror.html&lt;/location&gt;<br />&lt;/error-page&gt;</pre>\r\n              <p>Ensure that there are error pages written for all specific exceptions that you need to handle, including one that covers java.lang.Throwable. This will catch all previously unhandled exceptions and redirect the user to the specified error page. In addition to handling exceptions, you should also handle HTTP error codes. An example is below.</p>\r\n              <pre>&lt;ERROR-PAGE&gt;&lt;ERROR-CODE&gt;&lt;error-page&gt;<br />&amp;nbsp;&amp;nbsp; &lt;error-code&gt;404&lt;/error-code&gt;<br />&amp;nbsp;&amp;nbsp; &lt;location&gt;/error/error404.jsp&lt;/location&gt;<br />&lt;/error-page&gt;&amp;#9;&lt;/ERROR-PAGE&gt;</pre>\r\n              <p>The JSP error pages should begin with the <em>&lt;&amp;#37;&amp;#64;page &amp;#37;&gt;</em> tag.</p>\r\n              <p>For example:</p>\r\n              <pre>&lt;&amp;#37;&amp;#64;page isErrorPage=\"true\" &amp;#37;&gt;</pre>\r\n              <p>Creating error pages for specific exception types not only allows you to ensure sensitive data is not sent to the client, but it also improves the user experience. Design your error pages so they are useful for a typical user (not a developer), and you are unlikely to include any information that an attacker will find useful.</p>\r\n            </li>\r\n          </li>\r\n        </ul>\r\n      </li>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}