{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-2031298323",
      "Content_Hash": "-807128911"
    },
    "Metadata": [
      {
        "Id": [
          "d4143ba9-d87b-4455-8053-d888489a0013"
        ],
        "Id_History": [
          "d4143ba9-d87b-4455-8053-d888489a0013,c00008fa-30ea-4f2c-932f-2f0752c8581a,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Code Is Partitioned into Separate Assemblies"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Code Is Partitioned into Separate Assemblies"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that web controls, user controls, and resource access code in your application are partitioned into their own assemblies for granular security. Verify appropriate security settings are assigned to each assembly.</p>\r\n  <h1>Why</h1>\r\n  <p>Because different components may require different privileges and levels of trust, your application may not be suited well by a single security policy. Partitioning your application into multiple assemblies provides extra flexibility when constructing and enforcing a security policy. Following this strategy will help you reduce the overall minimum set of privileges that your application requires while granting a given component extra trust when completing a task.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Take the following steps to ensure that your application is partitioned into multiple assemblies with appropriate trust levels:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all the major components of your application. </strong>Review your application's design. Ensure that all major functionality has been properly identified.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Identify all special security settings. </strong>Review your application's security requirements. Ensure that all special privileges required by particular components that&nbsp;are not required by others have been identified.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Verify that your application has been partitioned. </strong>Ensure that all major functionality is properly separated into different assemblies so that there is extra flexibility when assigning security settings. This lets you assign only the the minimum necessary privileges to each assembly. All the elements of an assembly (assembly manifest, type metadata, MSIL code and resources) can be grouped into a single .dll file. ASP.NET provides the following types of assemblies:</p>\r\n          <ul>\r\n            <li>\r\n              <p>\r\n                <strong>Page assemblies:</strong> By default, each ASP.NET page is compiled into its own assembly that is then loaded into the ASP.NET engine. Security configuration for such assemblies is stored inside the <strong>web.config</strong> file. Enumerating all of the .aspx files in a web application will provide a comprehensive list of all the page assemblies in an application.</p>\r\n              <li>\r\n                <p>\r\n                  <strong>Executable assemblies:</strong> Typically known as external libraries or DLLs, these assemblies can be re-used outside of ASP.NET development. Security settings for such assemblies is managed through the <strong>app.config</strong> file and the <strong>caspol.exe</strong> utility.<br />Finding each app.config file in the source tree for an application along with any binary-only DLLs used will provide a comprehensive list of the executable assemblies in an application.</p>\r\n              </li>\r\n            </li>\r\n          </ul>\r\n          <li>\r\n            <p>\r\n              <strong>Ensure that appropriate security settings have been applied. </strong>Ensure that an appropriate security policy has been applied to each assembly based on its specific security requirements. Use the <strong>caspol.exe</strong> utility, your application's <strong>web.config</strong>, or the assembly's <strong>app.config</strong> to accomplish this task.</p>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <p>\r\n    <strong>Note: </strong>This check is a pre-requisite for the checklist item entitled, \"<a href=\"/article/257481d8-fcc5-4ed2-a8d8-c198bb399c77\">A Security Policy is Defined</a>.\"</p>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is the HR application for MyCorp. Among its basic features for keeping track of employee records, the application allows document and calendar sharing that allows MyCorp's HR staff to be up-to-date on daily activities. Because the application is compiled as a single assembly, it is impossible to assign different security settings for its calendar and document sharing features. Therefore, a successfully exploited vulnerability in the calendar feature could lead to compromising shared documents. The following snippet shows the deployment of MyApp's security policy:</p>\r\n  <p />\r\n  <pre>&lt;location allowOverride=\"true\"&gt;<br />   &lt;system.web&gt;<br />      &lt;securityPolicy&gt;<br />         &lt;trustLevel name=\"MyAppTrustLevel\" policyFile=\"myapp_customtrust.config\" /&gt;<br />      &lt;/securityPolicy&gt;<br />      &lt;trust level=\"MyAppTrustLevel\" originUrl=\"\" /&gt;<br />   &lt;/system.web&gt;<br />&lt;/location&gt;</pre>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To learn more about the contents of a .NET assembly, visit <a href=\"http://msdn2.microsoft.com/en-us/library/zst29sk2(vs.80).aspx\">Assembly Contents</a> on MSDN.</li>\r\n  </ul>\r\n  <h1>Related Guideline</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/eb5dbadd-49ab-46e1-bc0d-d299eeb465f6\">Guideline: Partition Code Into Separate Assemblies (ASP.NET)</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}