{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-58918762",
      "Content_Hash": "-1199167532"
    },
    "Metadata": [
      {
        "Id": [
          "d726eab6-f879-478f-9c49-28b8479ec143"
        ],
        "Id_History": [
          "d726eab6-f879-478f-9c49-28b8479ec143,2411e6ea-ae38-43b8-a04d-b33f002d6bc9,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "0sink junk Query Strings Do Not Contain Server Secrets"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Query Strings Do Not Contain Server Secrets"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that sensitive information is not being transmitted between client and server through a query string.</p>\r\n  <h1>Why</h1>\r\n  <p>Sensitive data in the query string may be logged by web proxies, and will also appear in the user's browser history and in your own web server logs.&amp;nbsp; Additionally, if sensitive content is being sent through the user, the query string does not offer an easy way of protecting the content from user reading or tampering. </p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to check for this problem:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify sensitive information used by your application. </strong>Examples of sensitive data include: </p>\r\n      <ul>\r\n        <li>User Credentials <li>Social Security number or other identifying information <li>Credit card numbers or other financial information <li>Health information <li>Private keys or other data that could be used to decrypt encrypted information <li>System or application information that can be used to more effectively attack the application </li></li></li></li></li></li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Review how sensitive data is passed between client and server. </strong>The most common mechanisms for communicating and maintaining sensitive information are:</p>\r\n        <ul>\r\n          <li>Session State <li>HTTP POST <li>ViewState <li>HTTP GET, in the query string </li></li></li></li>\r\n        </ul>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <blockquote>\r\n    <p>\r\n      <strong>Session State</strong>\r\n    </p>\r\n    <p>Session State is an acceptable mechanism for maintaining sensitive information on the server during a user session.&amp;nbsp;If your application is using session state you'll see code similar to: </p>\r\n    <pre>Session&amp;#91;\"SessionVarName\"&amp;#93; = SensitiveObject.SensitiveData;</pre>\r\n    <p>\r\n      <strong>HTTP POST</strong>\r\n    </p>\r\n    <p>\r\n      <strong>ViewState</strong>\r\n    </p>\r\n    <p>ViewState can be used to store sensitive information if <strong>ViewStateEncryption</strong> is used. By default, an HMAC integrity check is applied to the ViewState and SSL can protect the sensitive information over the wire.&amp;nbsp;<strong>ViewStateEncryption</strong> ensures the confidentiality of the sensitive information on the local machine.&amp;nbsp; </p>\r\n    <p>\r\n      <strong>HTTP GET in the query string</strong>\r\n    </p>\r\n  </blockquote>\r\n  <p />\r\n  <h1>How to Fix</h1>\r\n  <p>If a user is submitting sensitive data, they should submit it as a form field via an HTTP POST, not in the query string.&amp;nbsp;Whenever possible, avoid the problem entirely&amp;#8212;do not send sensitive data on a round trip to the user unless they need to edit the data. Instead, store sensitive session data on the server side. If sensitive data must be sent through the user, use an encrypted ViewState instead of a query string parameter.</p>\r\n  <p>If your application is using query string to communicate sensitive data to the server, use the following steps to fix the issue:</p>\r\n  <ol>\r\n    <li>\r\n      <p>Use HTTP POST (form submission) instead of HTTP GET for sensitive data provided by the user. This will ensure that data is not logged by web proxies, the web server's logs, or browser histories. </p>\r\n      <li>\r\n        <p>Store sensitive data server-side instead of repeatedly passing it as a query string parameter. The best way to keep sensitive information safe is to leave it somewhere inaccessible. </p>\r\n        <li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>An ASP.NET application requests the user's social security number to gain access to financial information. Instead of using a form submit to post this information to the server, the application uses an HTTP GET and places the social security number in the query string:</p>\r\n  <pre>http://www.teammentorexample.com/results.asp?SocialSecurityNum=123001234</pre>\r\n  <h1>Solution Example</h1>\r\n  <p>An ASP.NET application requests the user's social security number to gain access to financial information. The application uses a form post over SSL to send the information to the server:</p>\r\n  <pre>POST results.asp?SocialSecurityNum=123001234</pre>\r\n  <p>Since a POST is used instead of a GET, the information is not persisted in the browser history or cache. Using SSL protects the sensitive information on the wire.</p>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/d81f0c17-cbda-4c73-85f2-6d2e43dec441\">Guideline: Do Not Put Sensitive Data in the Query String</a>\r\n      <li>\r\n        <a href=\"/article/9b361424-e366-48b4-a45d-40d70393e987\">Checklist Item: Sensitive Data is Not Stored in View State</a>\r\n      </li>\r\n    </li>\r\n  </ul>\r\n  <p />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}