{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-301923744",
      "Content_Hash": "1706020224"
    },
    "Metadata": [
      {
        "Id": [
          "d74fe6bf-387f-4ff1-9edb-d0275eedffc0"
        ],
        "Id_History": [
          "d74fe6bf-387f-4ff1-9edb-d0275eedffc0,4a6bde4d-f76c-4226-be9a-f429fcb185e7,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Passwords Are Stored Securely"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Passwords Are Stored Securely"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Java\n\n==What to Check For==\n\nVerify that iterative hashing is used to protect stored passwords.\n\n==Why==\n\nStoring hashes instead of plain-text passwords assures that an attacker cannot easily recover the passwords if he gains access to the password files. Adding salt to hashed files makes hashes much harder to break with dictionary attacks. Hashing should be applied multiple times to make hashing take longer and thus increase the computational resources required to attack the hashes. Iterative hashing applies a hashing function multiple times to a password and a salt, drastically increasing the time required to perform dictionary attacks.\n\n==When==\n\nUse iterative hashing when storing passwords.\n\n==How to Check==\n\nTo verify that iterative hashing is used to secure stored passwords:\n\n# **Identify code that stores passwords.** Find code that stores passwords. Search for {{{ SecretKeyFactory }}} to find code that hashes stored passwords. If searching for {{{ SecretKeyFactory }}} does not find the code that is used to store passwords, review the application to find the code that stores passwords.\n# **Examine code that stores passwords.** Review code that stores passwords to make sure it uses {{{ SecretKeyFactory }}} with the {{{ PBKDF2WithHmacSHA256 }}} algorithm to store passwords and that multiple iterations are used. If that API is not used, then make sure that the password is hashed iteratively at least ten times using a strong hashing algorithm.\n\n==How to Fix==\n\nThe following steps show how to use iterative hashing:\n\n# **Define password storage requirements.** Most applications with a database back-end store the passwords in a database table. Another option is to store the passwords in files. If your application implements the policy of preventing users from entering previously used passwords, then the salted hashes of the previously used passwords have to be stored also. If the amount of the previously used passwords that cannot be used is configurable, it is recommended to use a separate table or file to store the hashes and salts of the previously used passwords.\n# **Generate a random salt value.** Each bit of salt doubles the memory and computational requirements for dictionary attacks. Recommended salt lengths are 64-bit or more. Use a random number generator of your choice to generate a random number of required size. Use this number as the salt.\n# **Hash the password and the salt using multiple iterations.** Use the {{{ SecretKeyFactory }}} API with the {{{ PBKDF2WithHmacSHA256 }}} algorithm to hash and salt the password using multiple iterations. The amount of iterations has to be the same when storing the password and when checking the password during authentication.\n# **Store the hash and the salt.** Store the hash in the file or database of your choosing. It is important to store both the hash and the salt, because the salt will have to be used when comparing user entered passwords to the hashed value.\n# **Implement password verification.** During authentication, the password entered by the user should be checked against the value calculated using PBKDF2. To do this, retrieve the hash value and the salt from password storage. Use PBKDF2 to calculate a value based on user input and the stored salt and compare the resulting string against the stored hash. If the resulting hash is the same as the stored hash, the user has entered the correct password.\n\n**Note:** Never store the user credentials or their hashes on the client side (e.g. in cookies, hidden fields, etc.). Use sessions when there is a need to track the user or store their hashed credentials. \n\n==Solution Example==\n\nThe following code validates the user based on a given username and password. It calculated the PBKDF2 using the password and salt. Then it compares the username and the produced hash against the hash stored in the backend database. Therefore, the password is not stored in the database.\n\n{{{\n\npublic boolean validateUser(String user, char[] pass)\n\t\n{\n\ttry {\n\t\t...\n\t\tbyte[] storedPassHash;\n\t\tbyte[] salt;\n\t\t// set storedPassHash and salt to values from database\n\t\tbyte[] passHash = hashCredentials(pass, salt);\n\t\treturn Arrays.equals(passHash, storedPassHash);\n\t} catch (NoSuchAlgorithmException nsae) {\n\t\t// Add the appropriate logging and exception handling mechanisms\n\t\treturn false;\n\t} catch (InvalidKeySpecException ikse) {\n\t\t// Add the appropriate logging and exception handling mechanisms\n\t\treturn false;\n\t}\n}\n\npublic String hashCredentials(char[] pass, byte[] salt)\n       throws NoSuchAlgorithmException, InvalidKeySpecException\n{\n\tString algorithm = “PBKDF2WithHmacSHA1”;\n\tint derivedKeyLength = 160;\n\tint iterations = 10000;\n\n\tKeySpec spec = newPBEKeySpec(pass, salt, iterations, derivedKeyLength);\n\tSecreyKeyFactory skf = SecreyKeyFactory.getInstance(algorithm);\n\n\tReturn skf.generateSecret(spec).getEncoded();\n} \n\n}}}\n\n==Additional Resources==\n\n* For more information about the SecretKeyFactory API and PBKDF2WithHmacSHA1, see http://docs.oracle.com/javase/7/docs/technotes/guides/security/StandardNames.html#SecreyKeyFactory"
        ]
      }
    ]
  }
}