{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "470152742",
      "Content_Hash": "-1314203552"
    },
    "Metadata": [
      {
        "Id": [
          "d752726f-e1ce-4460-ac51-d042fa3b9e0a"
        ],
        "Id_History": [
          "d752726f-e1ce-4460-ac51-d042fa3b9e0a,f9efa95d-ec91-49e8-a3a0-789a90389e3c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] A Least-privileged Account Is Used for Running Applications"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "A Least-privileged Account Is Used for Running Applications"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure the account used to run an ASP.Net application has the minimum privilege levels necessary.</p>\r\n  <h1>Why</h1>\r\n  <p>The principle of least privilege is a ubiquitous security concept. Following this guideline means&nbsp;applications should not be given privileges that are unnecessary for normal operation.</p>\r\n  <h1>How to Check</h1>\r\n  <p>On IIS 5 and 6, applications use the least privileged accounts ASPNET and Network Service by default, respectively. However, because many applications are deployed using custom accounts, it is vital to check the configuration settings for your application.</p>\r\n  <p>To check that your application runs with as few privileges as necessary, take the following steps to identify the account used for running ASP.NET and ensure that it has minimal privileges:</p>\r\n  <p>\r\n    <strong>For IIS 5, Windows 2000, and Windows XP</strong>\r\n  </p>\r\n  <ol>\r\n    <li>\r\n      <p>Open the machine.config file that is located in the runtime's CONFIG folder. The path may be something like:</p>\r\n      <blockquote>\r\n        <pre>C:\\WINDOWS\\Microsoft.NET\\Framework\\v3.5.xxxxx\\CONFIG</pre>\r\n      </blockquote>\r\n    </li>\r\n    <li>\r\n      <p>Locate the &lt;<strong>processModel</strong>&gt; section which defines the account that aspnet_wp.exe (the ASP.NET worker process for IIS 5) will be run under. Verify that the attributes are configured in either of the following ways:</p>\r\n      <ul>\r\n        <li>\r\n          <p>The attribute <strong>autoConfig=\"true\"</strong> is set and the <strong>userName</strong> and <strong>password</strong> attributes are not specified. In this case the <strong>userName</strong> and <strong>password</strong> will be set to the values <strong>machine</strong> and <strong>autogenerate</strong> which tells ASP.NET to run the worker process under the ASPNET account with a strong random password which will be stored in the Local Security Authority.</p>\r\n        </li>\r\n        <li>\r\n          <p>The <strong>userName</strong> and <strong>password</strong> attributes are set to an account of least privilege. This account may be customized for your application. Ensure that the principle of least privilege is applied to the ASP.NET account by verifying that:</p>\r\n          <ul>\r\n            <li>The account is denied local logon.</li>\r\n          </ul>\r\n        </li>\r\n        <li>\r\n          <p>In either case, be certain that the <strong>userName</strong> is not set to <strong>System</strong>. This would give ASP.NET full access to both the system and the network.</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <p>\r\n    <strong>For IIS 6 and Windows Server 2003:</strong>\r\n  </p>\r\n  <ol>\r\n    <li>\r\n      <p>Open IIS Manager and expand local computer and Application Pools.</p>\r\n    </li>\r\n    <li>\r\n      <p>Find and right click on your application, click Properties, and go to the Identity tab.</p>\r\n    </li>\r\n    <li>\r\n      <p>The identity of an application defines the account that w3wp.exe (the ASP.NET worker process for IIS 6) will be run under. Verify that the application pool identity is configured in either of the following ways:</p>\r\n      <ul>\r\n        <li>\r\n          <p>If the application pool identity is \"Predefined\" it should use the \"NetworkService\" account.</p>\r\n        </li>\r\n        <li>\r\n          <p>If the application pool identity is \"Configurable\" ensure that the principle of least privilege is applied to the ASP.NET account by verifying that:</p>\r\n          <ul>\r\n            <li>The account is denied local logon. </li>\r\n            <li>The account is a member of the IIS_WPG group only.</li>\r\n          </ul>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is an HR application that uses the company's shares to store its documents. The application is operating with a privilege set that exceeds the minimum set of privileges necessary for it to complete its tasks. Using a canonicalization attack, an intruder exploits the application's report download feature and is able to gain access to important company records that would otherwise be available only to senior members of the staff.</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To learn more about system accounts and deploying applications on Windows server platforms securely, see&nbsp;Chapters 2 and 3&nbsp;from the Microsoft's TechNet article <strong>Services and Service Accounts Security Planning Guide</strong>&nbsp;<em>The Approach to Running Services More Securely</em> and <em>How To Run Services More Securely</em>, which can be downloaded&nbsp;from&nbsp;<a href=\"http://technet.microsoft.com/en-us/library/cc170953.aspx\">http://technet.microsoft.com/en-us/library/cc170953.aspx</a>.</li>\r\n  </ul>\r\n  <ul>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}