{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1816172112",
      "Content_Hash": "-907942304"
    },
    "Metadata": [
      {
        "Id": [
          "d898d2a2-f20a-45bb-b232-6713cb618de8"
        ],
        "Id_History": [
          "d898d2a2-f20a-45bb-b232-6713cb618de8,f9d3692a-b0ac-4140-9d87-12f349a06a04,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "0sink All Output Data Is Encoded"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All Output Data Is Encoded"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that input is not echoed back to the user without first validating and/or encoding the data. Data which can be modified by a user must be treated as untrusted data.</p>\r\n  <h1>Why</h1>\r\n  <p>Echoing input directly back to the user makes your application susceptible to some code injection attacks, such as the Cross Site Scripting Attack. What constitutes malicious input varies widely depending on the system in question. On the web, it normally means some kind of JavaScript.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to ensure that input which can be modified by a user is properly validated and encoded before being echoed back to the user:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all sources of user input.</strong> At design time and again at the code review stage during development, determine all the possible tainted inputs to the application. Determine the intended characteristics of each input (length, format, etc.) and create validators for them. The following list includes some common input sources:</p>\r\n      <ul>\r\n        <li>Form Fields </li>\r\n        <li>Query strings </li>\r\n        <li>Databases and data access methods </li>\r\n        <li>Cookie collection </li>\r\n        <li>Session and application variables</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all output that includes user input.</strong> At design time and again at the code review stage during development, trace all inputs to the system though and determine all of the places where they may be output. In each case, identify the context in which the output occurs.</p>\r\n    </li>\r\n    <li>\r\n      <p />\r\n      <strong>Ensure all user-controllable data is properly encoded before being sent as output.</strong> In each location where data is output, it must be encoded according the the context of the output. Use the Microsoft AntiXSS library to encode output data for the correct context. Make sure that you encode data at the last possible opportunity before the data is returned to the client. If you encode any earlier than this, you may not know the exact context that the data will be used in, and hence the format you need to encode into. Early encoding of some data can result in double encoding problems.\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>\r\n      For more information about the .NET AntiXSS Library, see <a href=\"https://www.owasp.org/index.php/.NET_AntiXSS_Library\">.NET AntiXSS Library - OWASP</a></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}