{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1366280532",
      "Content_Hash": "-508122099"
    },
    "Metadata": [
      {
        "Id": [
          "dc7aa72b-9d4f-4303-965b-6cb1c367c7c1"
        ],
        "Id_History": [
          "dc7aa72b-9d4f-4303-965b-6cb1c367c7c1,ad4320ac-34ce-487f-b7fb-032cc3131258,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Security Decisions Are Not Based on Client-Accessible Parameters"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Security Decisions Are Not Based on Client-Accessible Parameters"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Verify that your application does not make security decisions based on parameters that are accessible by the client and&amp;nbsp;that all security decisions are made based purely&amp;nbsp;on information controlled by the server.</p>\r\n  <h1>Why</h1>\r\n  <p>Client input comes in many forms, from direct input like form variables and query string parameters to less direct input like cookies and connection information. None of it can be trusted, and any information coming from the client can be completely controlled by an attacker, even with thick clients.</p>\r\n  <p>If security decisions are based directly on this information, an attacker can alter the outcome of those decisions. For example, if your thick client sends a list of roles held by the user, the user can alter that list. Role caching cookies are another example of this; unless the cookie is tamper-proofed via signing and encryption, the user can alter their role in the system at will. </p>\r\n  <h1>How to Check</h1>\r\n  <p>Use the following steps to ensure that your application does not delegate parts of its security decision mechanism to the client-side:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that there are no security decision points on the client. </strong>Review your application's design and requirements. Ensure application security decisions are not made on the client-side. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that user input does not affect security decisions. </strong>On the server, trace all user input from source to sink. Ensure that server-side application security decisions are not made based solely on user input that can be tampered with. Common mistakes to look out for include:</p>\r\n      <ul>\r\n        <li>Undocumented parameters that enable privileged functionality </li>\r\n        <li>Storing user privileges inside cookies</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check if security decisions can be tampered with by the client. </strong>Through the use of a test HTTP proxy tool — such as BURP proxy — ensure that tampering with client supplied data cannot directly influence your application's internal security decisions. Ensure that users cannot gain extra privileges by:</p>\r\n      <ul>\r\n        <li>Modifying URL query string or form-based parameters </li>\r\n        <li>Adding or modifying HTTP cookie values </li>\r\n        <li>Modifying other HTTP header variables such as the referrer or user agent headers</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that all exceptions have been marked. </strong>Ensure that all exceptions to this rule have been properly noted as such in your application's documentation. Ensure that your application's development team is aware of any exceptions. For example, if a user is allowed to change between specific roles via URL parameters, verify that such functionality is indeed intended.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following code illustrates an application that accepts user-supplied input. Unfortunately, the application obtains the user's ID from the client which&amp;nbsp;allows an attacker to tamper with data that influences security decisions.</p>\r\n  <p />\r\n  <pre>public Profile GetProfileForUser()<br />{<br />      HttpRequest request = HttpContext.Request;<br />      string userID = request.Params[\"userid\"];<br />      if(Roles.IsUserInRole(userID, \"Administrators\"))<br />      {<br />            ...<br />      }<br />       ...<br />}</pre>\r\n  <h1>Additional Resources</h1>\r\n  <p>To easily tamper with HTTP messages, see the <a href=\"http://www.portswigger.net/proxy/\">BURP Proxy.</a></p>\r\n  <ul>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}