{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1662576445",
      "Content_Hash": "20017673"
    },
    "Metadata": [
      {
        "Id": [
          "ddcc12c3-77b5-4819-b07e-99ac5e2317c3"
        ],
        "Id_History": [
          "ddcc12c3-77b5-4819-b07e-99ac5e2317c3,bfb55e39-d44d-42ff-aa62-895fbeefa8ec,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Application Is Partitioned into Public And Private Domains"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Application Is Partitioned into Public And Private Domains"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Ensure that there is a boundary defined to separate public and restricted content in both the URL namespace and file system namespace. </p>\n  <h1>Why</h1>\n  <p>Defining a boundary between public and restricted content simplifies the task of user authorization and is generally less prone to error. When the content is separated, server configuration can be used to automatically apply authorization rules without relying on the developer to explicitly add checks in the code.</p>\n  <h1>How to Check</h1>\n  <p>Take the following steps to ensure your application is partitioned into public and restricted domains:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Enumerate all web accessible resources.</strong>&amp;nbsp;Identify the protected resources from the public resources. Common protected resources include, but are not limited to:</p>\n      <ul>\n        <li>Resources that require authentication <li>Critical application resources <li>Sensitive/confidential data</li></li></li>\n      </ul>\n      <li>\n        <p>\n          <strong>Check the structure of the URL namespace.</strong> Ensure that your application's URL namespace is structured properly according to the level of protection and security needs of each resource. Verify that transitions between URL namespaces is performed using absolute URLs. For more information, see <a href=\"http://msdn2.microsoft.com/en-us/library/ms178116(vs.80).aspx\">ASP.NET Web Site Paths</a> in MSDN.</p>\n        <li>\n          <p>\n            <strong>Check if there is separation on disk between public and protected resources. </strong>Examine the local filesystem structure. Ensure that protected resources are not located inside a public directory and vice versa. </p>\n          <li>\n            <p>\n              <strong>Ensure that protected resources have the appropriate access controls.</strong> Use the <a href=\"/article/fd97f26a-1730-46c1-84ca-10fc44206c81\">Role-Based Security Checks are Performed</a> checklist to determine if all protected resources have the appropriate access controls assigned to them.</p>\n            <li>\n              <p>\n                <strong>Verify the local system permissions for all resources.</strong> For each resource, check that the local filesystem permissions are set accordingly. If the resource is public, verify that anonymous users can access it. If the resource is protected, verify that only authorized users can access it.</p>\n            </li>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>MyApp is a financial tool that generates reports based on sensitive data. It allows the user to upload the financial data and download the report. Since the application is small, all of its content is located within the same directory. The access control is enforced by the web application through checking the required permissions before a given call is executed.</p>\n  <p>Since both data and code are within the same directory, it may be possible for an attacker to gain access to the raw financial data.</p>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>To learn more about URL namespaces, see: <a href=\"http://msdn2.microsoft.com/en-us/library/ms178116(vs.80).aspx\">ASP.NET Web Site Paths</a>. </li>\n  </ul>\n  <h1>Related Guideline</h1>\n  <ul>\n    <li>\n      <a href=\"/article/a5b7e377-103e-4805-a567-6092cbbaeba7\">Guideline: Partition Application Between Public and Private Domains (ASP.NET) (Forms Authentication)</a>\n    </li>\n  </ul>\n  <hr />\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}