{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-540427069",
      "Content_Hash": "-1551061771"
    },
    "Metadata": [
      {
        "Id": [
          "df7392da-aa79-4275-af9d-6c288c6ff287"
        ],
        "Id_History": [
          "df7392da-aa79-4275-af9d-6c288c6ff287,dd185bc1-4c65-44d8-ad68-abb753a90acd,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Important Business Operations Are Logged"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Important Business Operations Are Logged"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Verify that important business operations are logged.</p>\r\n  <h1>Why</h1>\r\n  <p>Important business operations should be logged to help identify attacks in progress and to investigate attacks that have already occurred.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Perform the following actions to check if important business operations are logged.</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>List important business operations.</strong> Make a list of business operations carried out by the application, such as placing orders, manipulating inventory, etc. Identify which of these operations are the most important.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Identify code that performs important business operations.</strong> Use the list of important business operations to find code that matches each one. Make a list of functions in this code.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Identify logging functionality.</strong> Examine the application architecture to identify logging facilities, such as the logging API and where audit trails are actually stored. Make a list of APIs used to log events, document how to use them, and where they store logs.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Verify that code logs important business operations.</strong> Use the list of functions that carry out important business operations and verify that each one uses the logging API to make records when important business operations take place.</p>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Use the following steps to add code to log important business operations:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>List important business operations.</strong> Make a list of business operations carried out by the application, such as placing orders, manipulating inventory, etc. Identify which of these operations are the most important.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Identify code that performs important business operations.</strong> Use the list of important business operations to find code that matches each one. Make a list of functions in this code.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Add logging functionality.</strong> Create a separate class or library to handle auditing and logging. Take time to design this library or class carefuly. Consider functionality to send logs to a remote log server. One of the most common protocols for interfacing with a remote log server is syslog (RFC 5424). Create and document an API for logging events with an adequate amount of information.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Add code that logs important business operations.</strong> Use the list of functions that carry out important business operations and add code to each function to use the logging API to make records when important business operations take place. Log both successful and failed events. Record success and failure indications.</p>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about the syslog protocol, see <a href=\"http://tools.ietf.org/rfc/rfc5424.txt\">http://tools.ietf.org/rfc/rfc5424.txt</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}