{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "692869423",
      "Content_Hash": "882441737"
    },
    "Metadata": [
      {
        "Id": [
          "edcb9c8f-7ab4-4b24-aa2e-f186f3903332"
        ],
        "Id_History": [
          "edcb9c8f-7ab4-4b24-aa2e-f186f3903332,96813779-aba7-41bf-90f2-705f2592db8f,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "All Sensitive Communications Are Encrypted"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All Sensitive Communications Are Encrypted"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Make sure that all sensitive communications are encrypted.</p>\r\n  <h1>Why</h1>\r\n  <p>Encrypting the communication links allows the application to preserve confidentiality and integrity of the transmitted data.</p>\r\n  <h1>How To Check</h1>\r\n  <p>Perform the following actions to make sure that all sensitive communications are encrypted.</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the connections used for transmitting sensitive data.</strong> Enumerate all connections between the different entities. Identify the sensitive data that is sent over the network and the respective connections that are used for such communication. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the pages that handle sensitive information.</strong> Find all pages that handle sensitive information and make sure that they use TLS or another strong cryptographic security mechanism.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all code that handles sensitive information.</strong> Find all code that handles sensitive information and make sure that it uses TLS or another strong cryptographic security mechanism to transmit the sensitive data.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that the protection mechanisms are adequate.</strong> If possible, use the platform-provided TLS controls. If some other cryptographic mechanisms are implemented, review them to make sure they are implemented correctly, or switch to platform-provided TLS if possible.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How To Fix</h1>\r\n  <p>To encrypt the communication links:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the connections used for transmitting sensitive data.</strong> Enumerate all connections between the different entities. Identify the sensitive data that is sent over the network and the respective connections that are used for such communication. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Choose the appropriate encryption mechanism.</strong> Depending on the infrastructure, you may consider using IPSec or TLS.</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>IPSec.</strong> IPSec is used when the encryption needs to be applied across all involved parties. Because IPSec is designed to secure connections between static hosts that are \"always on\", use IPSec to secure the network connections between your application's servers. Use the following steps to utilize IPSec:</p>\r\n          <ol>\r\n            <li>\r\n              <p>\r\n                <strong>Create an IP Filter.</strong> This restricts what computers can communicate with each other, and require that specific communication protocols are used. A filter consists of:</p>\r\n              <ul>\r\n                <li>A source IP address or range of addresses. </li>\r\n                <li>A destination IP address or range of addresses. </li>\r\n                <li>An IP protocol, such as TCP, UDP, or \"any.\" </li>\r\n                <li>Source and destination ports (for TCP or UDP only).</li>\r\n              </ul>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Create Filter Actions.</strong> This procedure creates two filter actions. The first will be used to block all communications from specified computers and the second will be used to enforce the use of encryption between application server and database server computers.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Create Rules.</strong> This procedure creates two new rules that will be used to associate the filter that you created in Procedure 1, with the two filter actions you created in Procedure 2.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Export the IPSec Policy to the Remote Computer.</strong> The IPSec policy that you have created on the database server must now be exported and copied to the application server computer.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Assign Policies.</strong> An IPSec policy must be assigned before it becomes active. Note that only one policy may be active at any one time on a particular computer.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Verify that it Works.</strong> Use Network Monitor (netmon.exe) to verify that data sent between the two servers is encrypted.</p>\r\n            </li>\r\n          </ol>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>TLS.</strong> TLS provides granular protection. This allows the traffic containing sensitive data only to be encrypted. Because TLS has a certificate based design, it allows the protection of data between mobile hosts. Use TLS to secure the communication channel between your application and its users. While .NET provides APIs for handling TLS encrypted traffic, it is recommended to follow the manuals associated with any third party software that is being used. If your application uses TLS, ensure that only strong cypher suites are used.</p>\r\n          <p>Use the following steps to configure IIS for using TLS:</p>\r\n          <ol>\r\n            <li>\r\n              <p>\r\n                <strong>Create a certificate request. </strong>Using the IIS management console, generate an TLS certificate request. This request is then sent to a Certification Authority to be signed. Follow these steps to generate the certificate request. </p>\r\n              <ol>\r\n                <li>Start the <strong>IIS management console</strong>. To do this, click on <strong>Control Panel</strong> -&gt; <strong>Administrative Tools</strong> -&gt; <strong>Internet Information Services</strong>. </li>\r\n                <li>Right click on your application's virtual host and select <strong>Properties</strong>. </li>\r\n                <li>Click on <strong>Server Certificate</strong> under the <strong>Directory Security</strong> tab. </li>\r\n                <li>Select <strong>Create a new certificate</strong> and click <strong>Next</strong>. </li>\r\n                <li>Select <strong>Prepare the request now, but send it later</strong> and click <strong>Next</strong>. </li>\r\n                <li>Provide <strong>your application's FQDN</strong> and the desired bit length for your TLS certificate's encryption key, and then click <strong>Next</strong>. </li>\r\n                <li>Provide <strong>your organization's details</strong> and click <strong>Next</strong>. </li>\r\n                <li>Provide <strong>your application's FQDN</strong> and click <strong>Next</strong>. </li>\r\n                <li>Provide <strong>your organization's location details</strong> and click <strong>Next</strong>. </li>\r\n                <li>Specify the location where you would like the IIS management console to store your application's certificate request. </li>\r\n                <li>Click <strong>Finish</strong> to complete the process.</li>\r\n              </ol>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Present the request to a Certification Authority (CA).</strong> If all conditions for obtaining an TLS certificate are met, the CA will produce a new TLS certificate based on the certificate request. Because the requirements for obtaining an TLS certificate depend on the Certification Authority, consult with the Certification Authority in regards to the administrative steps necessary for obtaining such certificate.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Install the certificate.</strong> Follow these steps to properly install your application's TLS certificate.</p>\r\n              <ol>\r\n                <li>Start the <strong>IIS management console</strong>. To do this, click on <strong>Control Panel</strong> -&gt; <strong>Administrative Tools</strong> -&gt; <strong>Internet Information Services</strong>. </li>\r\n                <li>Right click on your application's virtual host and select <strong>Properties</strong>. </li>\r\n                <li>Click on <strong>Server Certificate</strong> under the <strong>Directory Security</strong> tab. </li>\r\n                <li>Select <strong>Process the pending request and install the certificate</strong> and click <strong>Next</strong>. </li>\r\n                <li>Specify the location of your application's TLS certificate and click <strong>Next</strong>. </li>\r\n                <li>Click <strong>Finish</strong> to complete the process. </li>\r\n              </ol>\r\n            </li>\r\n          </ol>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Apply the appropriate encryption mechanism. </strong>Apply the encryption mechanism of choice at the appropriate locations in the code. Such locations include all functionality that establishes a connection between your application and another entity.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/5bff1c23-47fc-46ad-84bd-130b822d9611\">Encrypt Communication Links</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}