{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-792844151",
      "Content_Hash": "89419906"
    },
    "Metadata": [
      {
        "Id": [
          "ee19ddfb-eccf-4f3e-90a6-331d5586574c"
        ],
        "Id_History": [
          "ee19ddfb-eccf-4f3e-90a6-331d5586574c,9fad2d3a-e53f-4d3b-afae-46a08dd1f6b7,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Log Files Are Protected"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Log Files Are Secured"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Verify that log files are secured.</p>\r\n  <h1>Why</h1>\r\n  <p>Log files should be secured to prevent tampering or destroying them. Log files often contain internal application details that could enable an attacker to more effectively target your application.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Use these steps to ensure log files are protected:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that log location is not disclosed.</strong> Scan your application's code base to verify that the location of the log files is known only to the internal logging framework.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check the file permissions of logs. </strong>Verify that the logs are set with the appropriate filesystem permissions. All entities, excluding your application and its administrators/developers, must be prohibited access to the logs. If your application backs up its logs, verify that log backups are stored into an environment that is as secure as the storage environment for the current logs.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check for common logging mistakes.</strong> Scan your application's code base for common logging mistakes such as:</p>\r\n      <ul>\r\n        <li>Logging data structures that contain user-supplied data </li>\r\n        <li>Appending user-supplied data to an exception's message and/or details </li>\r\n        <li>Opening logs in \"write\" mode and not in \"append\" mode</li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Peform the following actions to secure the log files:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Consider sending logs to a centralized log server.</strong> Using a centralized log server has many advantages. A centralized log server greatly simplifies securing and monitoring logs on a network that has many log-generating devices. One common protocol for sending logs to a logserver is syslog (RFC 5424).</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Avoid disclosing location of logs.</strong> The location of the log files should be known only by your application and its administrators. Avoid disclosing the location of the logs to users.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Set appropriate file permissions. </strong>Set the filesystem permissions so that only your application and its administrators/developers have access to its logs.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Keep logging framework away from users.</strong> Do not allow your application's users to interact directly with the logging framework. The logging framework should log information regarding the performance of the application, but should avoid storing user supplied data inside the logs. Some user-supplied information can aid an attacker into poisoning your application's logs.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Consider using log rotation.</strong> Log rotation prevents your application from working with large log files. It allows you to manage and audit your application's logged events without interfering in your application's workings. Use the following steps when utilizing log rotation:</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Define a rotation period.</strong> Schedule your log rotation on a regular basis. For example, rotate your logs every Monday.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Create a new log file.</strong> Create a new log file when your application needs to rotate its log files. It is recommended to associate the new log file to the period of its creation. For example, the log file corresponding to the week of October 16, 2010 would be named 20101016.log.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Back up the existing log files.</strong> Back up the existing log files when your application needs to rotate its log files. Consult your internal auditing policy to determine the period for which logs should be backed up. If your application backs up its logs, store them into an environment that is as secure as the storage environment for the current logs.</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n  </ol>"
        ]
      }
    ]
  }
}