{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "316168680",
      "Content_Hash": "-1464776343"
    },
    "Metadata": [
      {
        "Id": [
          "f4b36918-6de8-40a6-96d3-de9e3499c89e"
        ],
        "Id_History": [
          "f4b36918-6de8-40a6-96d3-de9e3499c89e,5f733f63-8490-484a-a64a-086afb828a53,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] SSL Is Used to Protect User Credentials And Authentication Cookies"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "SSL Is Used to Protect User Credentials And Authentication Cookies"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure that SSL is used to protect authentication credentials and authentication cookies passed between browser and server.</p>\r\n  <h1>Why</h1>\r\n  <p>By using SSL, you make it much more difficult for an attacker to monitor the network connection&amp;nbsp;to&amp;nbsp;capture authentication credentials and authentication cookies to gain spoofed access to your application. </p>\r\n  <p>SSL also can improve user trust in your application as it authenticates the server to the client, thus proving the end point for communications.</p>\r\n  <h1>How to Check</h1>\r\n  <p>To ensure the forms authentication credentials and the forms authentication cookie is passed from browser to server with SSL, use the following steps:</p>\r\n  <ol>\r\n    <li>Ensure that the authentication cookie is passed only over HTTPS connections. <li>Ensure that the <strong>SSLOnly</strong> attribute is set&amp;nbsp;on all authentication and authorization cookies.&amp;nbsp; <li>Ensure that all login forms, password change forms, role/authorization request, editing forms, or other authentication-required pages are only available over SSL and only accept submissions via SSL.&amp;nbsp; </li></li></li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Perform the following tasks to assure that SSL is used to protect user credentials and authentication cookies:</p>\r\n  <p>\r\n    <b>Restrict the authentication cookie to HTTPS connections. </b>Cookies support a \"secure\" property that determines whether or not browsers should send the cookie back to the server. With the secure property set, the cookie is sent by the browser only to a secure page that is requested using an HTTPS URL.</p>\r\n  <p>Set the secure property by using <b>requireSSL=\"true\"</b> on the <b>&lt;forms&gt;</b> element as follows:</p>\r\n  <pre>&lt;forms loginUrl=\"Secure\\Login.aspx\"<br />       requireSSL=\"true\" . . . /&gt;</pre>\r\n  <p>\r\n    <b>Encrypt the cookie and check its integrity. </b>Encrypt the cookie and check its integrity, even if you are using SSL. This prevents an attacker from viewing or modifying the cookie if he or she manages to steal it through a XSS exploit, which would allow&amp;nbsp;the attacker&amp;nbsp;to still use the cookie to gain access to your application. The best way to mitigate this risk is to implement the appropriate countermeasures to prevent XSS attacks (described under \"Cross-Site Scripting\" earlier in this chapter), and limit the cookie lifetime as described in the next recommendation.</p>\r\n  <p>To provide privacy and integrity for the cookie, set the <b>protection</b> attribute on the <b>&lt;forms&gt;</b> element as follows:</p>\r\n  <pre>&lt;forms protection=\"All\"    Privacy and integrity</pre>\r\n  <p>A secure &lt;<b>forms</b>&gt; element configuration is shown here:</p>\r\n  <pre>&lt;forms loginUrl=\"Secure\\Login.aspx\"<br />       protection=\"All\"<br />       requireSSL=\"true\"<br />       timeout=\"00:30:00\"<br />       slidingExpiration=\"true\"<br />       name=\"YourAppName\"<br />       path=\"/Secure\" /&gt;</pre>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/09f08059-6ebb-4317-9ed5-016cc1abd2a7\">Guideline: Use SSL to Protect User Credentials and Authentication Cookies</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}