{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1170549366",
      "Content_Hash": "-463117592"
    },
    "Metadata": [
      {
        "Id": [
          "f8586505-72f9-4c14-a365-3e5049e5ca57"
        ],
        "Id_History": [
          "f8586505-72f9-4c14-a365-3e5049e5ca57,c4a5a0c1-b9fc-423d-80fe-e31d0e2b3d90,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Usernames Are Validated Before Use"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Usernames Are Validated Before Use"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nEnsure user credentials are validated before processing them.\r\n\r\n\r\n## Why ##\r\n\r\nFailure to validate user credentials could cause improper authentication. This can allow an attacker to authenticate as another user without the need to steal credentials.\r\n\r\n\r\n## How to Check ##\r\n\r\nFollow these steps to ensure that your application validates user credentials before use:\r\n\r\n1. **Locate all code that handles user credentials.** Examine your application and identify all places inside its code base that handle user credentials. Common places include:\r\n\t* Creating new users\r\n\t* Modifying existing users\r\n\t* Changing credentials for existing users\r\n\t* Retrieving information related to existing users\r\n\t* Removing existing users\r\n\t* Authenticating users\r\n2. **Verify that validation is handled properly.** Ensure that your application addresses username validation throughout the different stages of your application's development lifecycle:\r\n\t* Policy Requirements: Verify that your application's security requirements have established a policy regarding acceptable usernames. Such policy should state the length and input set for valid usernames as well as password requirements. \r\n\t* Design: Verify that all username validation routines are positioned properly at the trust boundaries of all of your application's routines that handle user credentials. For instance, all validation should occur before the username is processed by any component within your application.\r\n\t* Implementation: Verify that all username validation routines implement your application's username policy. Verify that the implementation is using whitelist and not blacklist validation techniques. Ensure that all error or exception conditions are handled correctly. Verify that all authentication procedures exit immediately in a graceful manner upon failed username validation.\r\n\r\n\t\r\n## How to Fix ##\r\n\r\nUse the following steps when validating user credentials:\r\n\r\n1. **Establish username requirements.** Determine what is the acceptable character set and length that should be allowed within a username. For instance, require that usernames should be at least six characters long and must contain alpha-numeric characters only.\r\n2. **Use whitelist validation.** Whitelisting involves the establishment of what is good input for your application. Once good input is defined, compare all input against the established good input. If the input does not resemble good input, your application should discard it. This technique can be implemented using regular expressions."
        ]
      }
    ]
  }
}