{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1564009247",
      "Content_Hash": "-1750338063"
    },
    "Metadata": [
      {
        "Id": [
          "fd94eabb-1ee6-43c5-83d3-0228203554a8"
        ],
        "Id_History": [
          "fd94eabb-1ee6-43c5-83d3-0228203554a8,01e92642-7860-48e5-8b04-029beb150394,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Security Objectives Are Identified"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\n  <p>Check that security objectives and requirements are defined early in the application development process.</p>\n  <h1>Why</h1>\n  <p>Identification of security objectives is the first, best step you can take to help ensure the security of your application. The objectives, once created, can be used to direct all the subsequent security activities that you perform. Security objectives do not remain static, but are influenced by later design and implementation activities.</p>\n  <h1>How to Check</h1>\n  <p>Check project documentation to verify that it includes descriptions of security objectives.</p>\n  <h1>How to Fix</h1>\n  <p>Identifying security objectives is an iterative process that is initially driven by an examination of the application’s requirements and usage scenarios. By the end of the requirements and analysis phase, you should have a first set of objectives that are not yet tied to design or implementation details. During the design phase, additional objectives will surface that are specific to the application architecture and design. During the implementation phase, you may discover a few additional objectives based upon specific technology or implementation choices that have an impact on overall application security. </p>\n  <p>Each evolution of the security objectives will affect other security activities. You should review the threat model, architecture and design review guidelines, and general code review guidelines when your security objectives change.</p>\n  <br />"
        ]
      }
    ]
  }
}