{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "137094050",
      "Content_Hash": "1828376859"
    },
    "Metadata": [
      {
        "Id": [
          "18ac74df-602b-4a58-8998-52f638f3a045"
        ],
        "Id_History": [
          "18ac74df-602b-4a58-8998-52f638f3a045,2e68d5b7-4b53-48e0-9dac-a1fd1932ad07,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Input Validation Using SpringMVC"
        ],
        "Category": [
          "Input And Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Code Example"
        ],
        "DirectLink": [
          "Input Validation Using SpringMVC"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- JAVA\r\n- SpringMVC\r\n\r\n## Summary ##\r\n\r\nPerform input validation using SpringMVC within an application.\r\n\r\n## Objectives ##\r\n\r\nStrong input validation is a powerful control that can prevent various security issues within an application. This article will describe how to use the built-in mechanisms provided by SpringMVC to perform appropriate input validation.\r\n\r\n## Solution Example ##\r\n\r\nSpring provides the validator mechanism to perform input validation within SpringMVC (and throughout Spring for that matter). Additionally, the data binder mechanism can be used to strengthen your input validation controls. It is also possible to use the commons validator mechanism for Spring validation and it looks very similar to what is used in Struts2, but there are additional steps to integrate with SpringMVC and it is not part of the core model, and as such it is not covered here.\r\n\r\nIf you implement the validator interface, you'll need to have the supports and validate methods in your implementation. The supports method is trivial as shown below. The validate method is where the contents of your validations are placed. Spring has helpfully provided the 'ValidationUtils' class which contains many common validations you might want to support. An example is shown below.\r\n\r\n\timport Import Org.springframework.validation.Validator;\r\n\t...\r\n\tpublic Class UserValidator Implements Validator {\r\n\t  @Override\r\n\t  Public Boolean Supports(Class AClass) {\r\n\t\tReturn User.class.isAssignableFrom(aClass);\r\n\t  }\r\n\r\n\t  @Override\r\n\t  Public Void Validate(Object Target, Errors Errors) {\r\n\t\tValidationUtils.rejectIfEmptyOrWhitespace(errors, \"firstName\", \"First Name Can't Be Blank\");\r\n\t\tValidationUtils.rejectIfEmptyOrWhitespace(errors, \"lastName\", \"Last Name Can't Be Blank\");\r\n\t  }\r\n\t}\r\n\r\nIn order to tie this validation together with the associated controller, you simply update the configuration entry for the given controller.\r\n\r\n\t<bean Name=\"/user/create\" Class=\"com.me.MyController\">\r\n\t\t<property Name=\"commandClass\" Value=\"....\"/>\r\n\t\t<property Name=\"formView\" Value=\"....\"/>\r\n\t\t<property Name=\"successView\" Value=\"....\"/>\r\n\t\t<property Name=\"validator\">\r\n\t\t\t<bean Class=\"com.me.UserValidator\"/>\r\n\t\t</property>\r\n\t</bean>\r\n\r\nNow that the validations are in place, you simply update your view (ex. JSP) to display the errors If applicable.\r\n\r\n\t<form:errors Path=\"*Class=\"error\" />\r\n\r\nThe example above will show all errors, but you can change the path to show field specific errors.\r\n\r\n\t<form:errors Path=\"firstName\" cssClass=\"error\" />\r\n\r\nAnother important technology to be aware of, though it doesn't specifically fall within input validation, is the data binder mechanism in SpringMVC. You can use this mechanism to specifically allow, require or prevent certain fields from being bound in the controller. This is powerful in that it can prevent parameter tampering as well as other issues.\r\n\r\n\t//method added to controller class\r\n\t@InitBinder\r\n\tpublic void initBinder(WebDataBinder dataBinder) {\r\n\t  dataBinder.setDisallowedFields(new String[] {\"id\"});\r\n\t  dataBinder.setRequiredFields(new String[] {\"firstName\", \"lastName\"});\r\n\t  dataBinder.setAllowedFields(new String[] {\"firstName\", \"lastName\", \"dob\", \"address\", \"phone\"});\r\n\t}\r\n\r\nThe example above shows the use of a method annotated with @InitBinder being used to restrict the binding mechanism of SpringMVC. The methods called on the data binder are all simple, but for example, the setDisallowedFields method call prevents the user from binding the \"id\" field. This prevents a user from tampering with, say, hidden fields in order to overwrite data to which they do not have access. Again, while this is not strictly input validation, it does function as a security control on input and as such is a valuable resource when securing your SpringMVC application.\r\n\r\nIn conclusion, input validation can function as a strong security control if used properly and applied thoroughly throughout the application. The SpringMVC framework provides the Validator mechanism as well as the data binder for accomplishing this task.\r\n\r\n## More Information ##\r\n\r\n- For more information about input validation in Struts 2, see [http://struts.apache.org/2.x/docs/validation.html](http://struts.apache.org/2.x/docs/validation.html)"
        ]
      }
    ]
  }
}