{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "869931954",
      "Content_Hash": "-1236173539"
    },
    "Metadata": [
      {
        "Id": [
          "2dc1ab76-320b-47ec-a562-9e203d1b630f"
        ],
        "Id_History": [
          "2dc1ab76-320b-47ec-a562-9e203d1b630f,74ab443d-7046-4cb8-a34f-52220c578c8d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "SpringMVC Encode Untrusted Data in Output"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Code Example"
        ],
        "DirectLink": [
          "Output Encoding Using SpringMVC"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* JAVA\r\n* SpringMVC\r\n\r\n\r\n## Summary ##\r\n\r\nPerform output encoding using SpringMVC within an application. Strong output encoding is a control that is typically used to prevent encoding (primarily XSS on the web) issues within an application. This article will describe how to use the built-in mechanisms provided by SpringMVC to perform appropriate output encoding.\r\n\r\n\r\n## Solution Example ##\r\n\r\nIn general, SpringMVC tags perform HTML entity encoding by default if they are configured to do so. There are a few ways to enable this mechanism (newer versions of SpringMVC have this enabled by default).\r\n\r\nEnable html escaping on all form elements within the entire application. In order to do this, add this snippet to your web.xml.\r\n\r\n~~~~\r\n<context-param>\r\n    <param-name>defaultHtmlEscape</param-name>\r\n    <param-value>true</param-value>\r\n</context-param>\r\n~~~~\r\n\r\nEnable html escaping on all form elements within a single page. In order to do this, add this snippet at the top of your jsp page.\r\n\r\n~~~~\r\n<spring:htmlEscape defaultHtmlEscape=\"true\" /> \r\n~~~~\r\n\r\nEnable html escaping on all form elements within a single form. In order to do this, attribute your form in this way.\r\n\r\n~~~~\r\n<form:input path=\"someFormField\" htmlEscape=\"true\" /> \r\n~~~~\r\n\r\nAn important point to be aware of is that some tags that allow you to disable the encoding performed by the tag. This is sometimes useful, the most common case being where you are allowing administrators for a site add HTML formatted messages to be displayed to users. There may also be cases where users can create formatted messages for other users. These approaches are often not handled properly to prevent XSS. However, through strong input validation, it is possible to allow users to enter limited HTML and still display that safely to users without allowing XSS.\r\n\r\nYou can determine if this is being done by simply looking for the htmlEscape=\"false\" attribute in individual SpringMVC tags. If it is set to false, then the HTML entity encoding is disabled (the default is true).\r\n\r\n\r\n## Guideline ##\r\n\r\n* [Encode Untrusted Data in Output](9b0ef1a5-c143-4e64-81cc-9e02ccbd9fbd)"
        ]
      }
    ]
  }
}