{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "950470723",
      "Content_Hash": "-1027318860"
    },
    "Metadata": [
      {
        "Id": [
          "08d9e9ed-bb8a-496a-b564-72344812d445"
        ],
        "Id_History": [
          "08d9e9ed-bb8a-496a-b564-72344812d445,ce3c71fc-0e7e-4719-b961-e563d0346563,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Account Administration Is Separated from the Main Application Interface"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Account Administration Is Separated from the Main Application Interface"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Check For</h1>\r\n  <p>Ensure your application separates the account administration from the main application interface.</p>\r\n  <h1>Why</h1>\r\n  <p>Account administration requires higher privileges than the main application interface. Separating the two interfaces decreases the risk of a normal user being able to escalate privileges to that of an administrator.</p>\r\n  <h1>How to Check</h1>\r\n  <p>Take the following steps to verify that the account administration interface is separate from the main application interface: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that your application allows only privileged users to administer all accounts. </strong>Review your application's design and verify that it specifies separation of administrative and main application interfaces.</p>\r\n      <ul>\r\n        <li>Check that only valid privileged users can access your application's administrative interface. <li>Ensure that your application's administrative interface uses a separate authentication module than the rest of your application, as this decreases the risk of privilege escalation attacks. <li>Check that different session IDs are used for the administrative and main application interfaces.</li></li></li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Ensure that your application allows users to administer their own accounts. </strong>Check that your application has been designed to let users administer their own accounts. Verify the following to enforce extra security precautions as users are allowed access to sensitive data:</p>\r\n        <ul>\r\n          <li>\r\n            <p>\r\n              <strong>User ID is tracked on server</strong>: Ensure that a user is tracked using a unique, randomly generated session ID, which is verified on the server side.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Re-authentication is enforced</strong>: Verify that privileged users are forced to re-authenticate when performing actions such as changing passwords.</p>\r\n              <li>\r\n                <p>\r\n                  <strong>Account is modified in sections</strong>: Check that account information is split into separate sections such as credentials, personal data, contact information, and additional information, and is modified on a per-section basis to reduce the risk of information leakage when the user is updating his or her account.</p>\r\n                <li>\r\n                  <p>\r\n                    <strong>Connection is secure</strong>: Verify that your application uses SSL when privileged users are performing transactions of sensitive nature.</p>\r\n                  <li>\r\n                    <p />\r\n                    <strong>Server Configuration</strong>: Verify that your application's environment has enabled HTTPS so that transactions of a&nbsp;sensitive nature are transmitted only over HTTPS connections. Check if the <strong>&lt;forms&gt;</strong> element in your application's web.config file has the <strong>requireSSL</strong> attribute set to <strong>true</strong> when performing forms-based authentication:<br /><pre>&lt;authentication mode=\"Forms\"&gt;<br />&nbsp; &lt;forms loginUrl=\"login.aspx\"<br />&nbsp;&nbsp;&nbsp;&nbsp; protection=\"All\"<br />&nbsp;&nbsp;&nbsp;&nbsp; timeout=\"20\"<br />&nbsp;&nbsp;&nbsp;&nbsp; requireSSL=\"true\"&gt;<br />&nbsp; &lt;/forms&gt;<br />&lt;/authentication&gt;</pre><p /></li>\r\n                </li>\r\n              </li>\r\n            </li>\r\n          </li>\r\n        </ul>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following snippet shows the HTTP requests that an administrator makes when accessing the main and administrative interfaces of the application. Because the administrative interface is not separated from the application, an administrator can use a single session to use and to administer the application. Therefore, a vulnerability such as cross-site scripting in the main application interface will expose the administrative interface as well.</p>\r\n  <pre>GET /myapp/ HTTP/1.1<br />Accept: &#42;/&#42;Accept-Encoding: gzip, deflate<br />User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1)<br />Host: <a href=\"http://www.example.com/\">www.example.com</a><br />Connection: Keep-Alive<br />Cookie: <strong>ASP.NET_SessionId=b25tnpbv1wwzp355rddxodv0<br /></strong>GET /myapp/admin.aspx HTTP/1.1<br />Accept: &#42;/&#42;<br />Accept-Encoding: gzip, deflate<br />User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; .NET CLR 2.0.50727; .NET CLR 1.1.4322)<br />Host: <a href=\"http://www.example.com/\">www.example.com</a><br />Connection: Keep-Alive<br />Cookie: <strong>ASP.NET_SessionId=b25tnpbv1wwzp355rddxodv0</strong></pre>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To learn more about securing forms authentication, see <a href=\"http://support.microsoft.com/kb/813829\">Help Secure Forms Authentication by Using Secure Sockets Layer (SSL)&nbsp;</a>.</li>\r\n  </ul>\r\n  <h1>Related Guideline</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/fc7f567f-bbfc-434c-aaa5-23d79b458605\">Guideline: Separate Account Administration from the Main Application Interface (ASP.NET)</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}