{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-30683164",
      "Content_Hash": "1333244825"
    },
    "Metadata": [
      {
        "Id": [
          "51b0ac88-ebc0-4447-b839-a8792e3664d6"
        ],
        "Id_History": [
          "51b0ac88-ebc0-4447-b839-a8792e3664d6,7436460e-415d-4502-884b-31ef155da39a,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Test Interfaces Are Removed"
        ],
        "Category": [
          "Other"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Test Interfaces Are Removed"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure all public interfaces used solely for testing the application are removed.</p>\r\n  <h1>Why</h1>\r\n  <p>Test interfaces add extra functionality that is not intended for the released application. Often these interfaces will be used by a test team to gain information or drive functionality that would be dangerous in the hands of an attacker.</p>\r\n  <h1>How To Check</h1>\r\n  <p>Verify that all test interfaces have been removed by doing the following:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all test APIs.</strong> Enumerate all public APIs. Identify which APIs are intended for application use and which APIs are intended for test purposes. Use documentation and specifications to help.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that all testing code is removed from the code base.</strong> Locate the implementation for the identified test code. Ensure that it has been isolated from the application.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that the application was compiled with the release flag.</strong> Open the project for the application with Visual Studio. From the <em>Build</em> Menu select <em>Configuration Manager</em>. Check that the <em>active solution configuration</em> is set to <em>Release</em>.</p>\r\n    </li>\r\n  </ol>\r\n  <p>Care should be taken when managing different versions of builds to ensure that only release builds are used in production, as it is difficult (although possible) to determine whether a build was configured as release or debug after the fact.</p>\r\n  <h1>How To Fix</h1>\r\n  <p>To remove all test interfaces:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all test APIs</strong>: Enumerate all public APIs. Identify which APIs are intended for application use and which APIs are intended for test purposes. Ideally these interfaces will already be documented as test interfaces and can be discovered through specifications.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Remove the test interfaces</strong>: Code removal is a straight forward procedure. Once the test code is identified, it should be isolated from the application and removed from your code base. This should happen before final functional and integration testing to ensure that the system still works as intended with the test code missing.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Compile your application with release flag</strong>: Always compile your application with a release flag before shipping. This ensures that your application does not contain extra debug information in its assemblies.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <em>You may find these additional articles useful</em>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/f959d06a-0ae8-4e5e-b984-18173f6721c3\">Remove Test Interfaces</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>\r\n  <h1>\r\n  </h1>\r\n  <h1>\r\n  </h1>"
        ]
      }
    ]
  }
}