{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1813394709",
      "Content_Hash": "-2080721686"
    },
    "Metadata": [
      {
        "Id": [
          "cfa471eb-1365-4ea5-80a0-0a0d112719bc"
        ],
        "Id_History": [
          "cfa471eb-1365-4ea5-80a0-0a0d112719bc,82f3e1e0-66c5-4fb2-874e-d20bf6598094,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Security Decisions Are Not Based on Client-Accessible Parameters"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Security Decisions Are Not Based on Client-Accessible Parameters"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Check For</h1>\r\n  <p>Verify that your application does not make security decisions based on parameters that are accessible by the client and&nbsp;that all security decisions are made based purely&nbsp;on information controlled by the server.</p>\r\n  <h1>Why</h1>\r\n  <p>Client input comes in many forms, from direct input like form variables and query string parameters to less direct input like cookies and connection information. None of it can be trusted, and any information coming from the client can be completely controlled by an attacker, even with thick clients.</p>\r\n  <p>If security decisions are based directly on this information, an attacker can alter the outcome of those decisions. For example, if your thick client sends a list of roles held by the user, the user can alter that list. Role caching cookies are another example of this; unless the cookie is tamper-proofed via signing and encryption, the user can alter their role in the system at will. </p>\r\n  <h1>How To Check</h1>\r\n  <p>Use the following steps to ensure that your application does not delegate parts of its security decision mechanism to the client-side:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that there are no security decision points on the client. </strong>Review your application's design and requirements. Ensure application security decisions are not made on the client-side. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that user input does not affect security decisions. </strong>On the server, trace all user input from source to sink. Ensure that server-side application security decisions are not made based solely on user input that can be tampered with. Common mistakes to look out for include:</p>\r\n      <ul>\r\n        <li>Undocumented parameters that enable privileged functionality </li>\r\n        <li>Storing user privileges inside cookies</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check if security decisions can be tampered with by the client. </strong>Through the use of a test HTTP proxy tool — such as BURP proxy — ensure that tampering with client supplied data cannot directly influence your application's internal security decisions. Ensure that users cannot gain extra privileges by:</p>\r\n      <ul>\r\n        <li>Modifying URL query string or form-based parameters </li>\r\n        <li>Adding or modifying HTTP cookie values </li>\r\n        <li>Modifying other HTTP header variables such as the referrer or user agent headers</li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>How To Fix</h1>\r\n  <p>It's not difficult to ensure that security decisions are not based on client data.&nbsp;These steps will lead you through the process: </p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all of your security decision points.</strong> Identify all points where you place someone into a role or decide if an action should proceed.&nbsp;Be thorough here, because understanding this element is critical to the security of your application.&nbsp;A design review specifically aimed at this aspect, possibly including a threat model to ensure completeness, is a good way to start, but you'll need to review the actual implementation as well to make sure the design was executed properly.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Trace data.</strong> Trace the data used to make those decisions back until you can prove that none of it is based on client input. If data is round-tripped through the client, prove that it cannot be modified by the client (i.e. the data is cryptographically signed).</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Pay extra attention to dangerous areas.</strong> If there are any places where you do make security decisions based on client input, like a role editing component, document those exceptions and spend extra care auditing those code paths. Ensure that any exceptions function according to the business rules they are intended implement.&nbsp;Make sure that all input with security implications is handled carefully—only ask for it immediately before its use, don't cache it, and validate it before use. Also, use <em>ViewStateUserKeys</em> to protect forms, don't put the data in the query string, and generally treat the data like you would any other sensitive information.</p>\r\n    </li>\r\n  </ol>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>\r\n  <h1>\r\n  </h1>\r\n  <h1>\r\n  </h1>"
        ]
      }
    ]
  }
}