{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1869692430",
      "Content_Hash": "132850360"
    },
    "Metadata": [
      {
        "Id": [
          "04dab521-7dc7-4ec7-a2bd-c5fbe0378510"
        ],
        "Id_History": [
          "88134c36-4e54-47ca-8a83-fafe271ca05a,04dab521-7dc7-4ec7-a2bd-c5fbe0378510,fd2a53cb-ef51-418d-b10f-3da15eff2641,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6204f2d47eb7"
        ],
        "Title": [
          "Luring Attack"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Attack"
        ],
        "DirectLink": [
          "Luring Attack"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "wikitext"
        },
        "Data": [
          "=Applies To\r\n\r\nAll applications and platforms that use and support security based on code identity, such as the Code Access Security mechanism available in the Microsoft .NET Framework and similar mechanisms in Java.\r\n\r\n=Description\r\n\r\nThe traditional way of building applications so that they run with the current user privileges has helped increase the impact of some attacks. Attacks such as API hijacking and other attacks that result in escalation of privilege come about because the called module usually assumes the authority of its caller.\r\n\r\nJava and the .NET Framework provide code access security mechanisms that allow enforcement of security based on **code identity** instead of on the user executing the code. These mechanisms allow developers to write and package code in a fashion that controls the security aspect of their invocation and execution. Using this, a developer can state the minimum security requirements that a calling module must meet before it can execute the protected module. One of the main advantages that this mechanism offers is the fact that mobile code (code downloaded from the internet) will not be able to execute protected modules that already exist on the local machine.\r\n\r\nIn a luring attack, the attacker 'lures' an application component with higher privileges than the attacker's code to do something on its behalf. This happens when a snippet of code with restricted security privileges calls a component with higher privileges into executing restricted operations. Such behavior is usually the result of lack of or insufficient permission checks on the caller of the privileged component. Luring attacks can also be a result of a privileged library calling malicious code from an untrusted library.\r\n\r\n=Impact\r\n\r\n    *Elevation of privilege.\r\n\r\n=Vulnerabilities\r\n\r\n    *Calling un-managed modules from protected managed modules: This can result in escalation of privilege, as the calling module may not be able to verify the authenticity of the unmanaged module.\r\n    *Failure to check the authority of the calling module: Depending upon the security options selected, the called module may check:\r\n        **No caller permissions: If no permissions are checked, then this could be used in a luring attack.\r\n        **Permissions granted to the immediate caller of the module: If the module is capable of performing dangerous actions on the machine, an attacker may call another module, which in turn may call the protected module in order to launch a luring attack.\r\n        **The permissions granted to every caller in the call-stack: In this case, luring attacks will be prevented.\r\n\r\n=Countermeasures\r\n\r\n    *When creating packages or assemblies that could be loaded by malicious code, use platform-supplied techniques to explicitly define the security restrictions of your module (see Example below).\r\n    *Use LinkDemand or StackWalk techniques in both frameworks to check the permissions on any calling module.\r\n\r\n=Example\r\n\r\nBelow is the code for Module P which calls an external module to perform some file operations. The functionality of the external module is beyond the control of Module P.\r\n\r\n{{{\r\n  public static void doOperationPriv()\r\n{\r\n   string dir = @\"c:\\temp\\\";\r\n   Console.WriteLine(\"PrivilegedCode: Allowing read-only access to the directory {0}\",dir);\r\n   //allow read-only access to the current directory only\r\n   FileIOPermission read = new FileIOPermission(FileIOPermissionAccess.Read |\r\n                                                FileIOPermissionAccess.PathDiscovery, dir);\r\nread.PermitOnly();\r\n   Console.WriteLine(\"PrivilegedCode: Calling external module for operation on dir {0}\",dir);\r\n   Operations.doOperation(dir);\r\nFileIOPermission.RevertPermitOnly();\r\n}\r\n}}}\r\n\r\nHere, the module explicitly states that it has given up its rights to write to the disk for a short while. Now, when the following external module is called:\r\n\r\n{{{\r\n public class Operations\r\n {\r\n  public static void doOperation(string dir)\r\n  {\r\n   Console.WriteLine(\"Rogue Utility: Deleting all text files in dir {0}\",dir);\r\n   DirectoryInfo di = new DirectoryInfo(dir);\r\n   // delete each text file in that directory\r\n   FileInfo[] fiArr = di.GetFiles(\"*.txt\");\r\n\r\n   foreach (FileInfo fri in fiArr)\r\n   {\r\n    Console.WriteLine(\"Rogue Util deleting file: {0}\",fri.Name);\r\n    fri.Delete();\r\n   }\r\n  }\r\n }\r\n}}}\r\n\r\na security exception will be thrown, since the calling module does not have the permission to delete files from the disk.\r\n\r\n=Additional Resources\r\n\r\n    *For more information about Code Protection and Code Access Security, see: http://www.onjava.com/pub/a/onjava/2004/01/28/javavsdotnet.html\r\n    *For more information about Enforcing Code Access Rights with the Common Language Runtime, see: http://msdn.microsoft.com/en-us/magazine/cc301467.aspx\r\n    *For more information about Code Access Security in Practice, see: http://msdn.microsoft.com/en-us/library/aa302424.aspx\r\n\r\n=Related Items\r\n\r\n    *[[da5df934-30f1-453b-9d5b-9a9288ef78c1|Attack: API Hijacking Attack]]\r\n    *[[0089dded-bd3d-4513-b479-624629634b4a|Attack: Reflection Injection Attack]]\r\n    *[[9d60faca-687b-4c69-91ba-f5712af0fd02|Attack: Server-Side Code Injection Attack]]\r\n    *[[4d3185fd-1e48-40af-bc07-71206c40806b|Attack: Trust Relationship Attack]]\r\n\r\n"
        ]
      }
    ]
  }
}