{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "672302440",
      "Content_Hash": "-1543582333"
    },
    "Metadata": [
      {
        "Id": [
          "103a4c8d-0664-491a-9d1d-10035b035e92"
        ],
        "Id_History": [
          "eae9b65b-9032-44b2-bf87-b7bad67a38d8,103a4c8d-0664-491a-9d1d-10035b035e92,51e536b3-4253-442a-a222-1fb5eb53a443,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6204f2d47eb7"
        ],
        "Title": [
          "Reflection Attack"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Attack"
        ],
        "DirectLink": [
          "Reflection Attack"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "wikitext"
        },
        "Data": [
          "=Applies To\n\nClient/server applications using cryptographic mutual authentication schemes (described below) where the server uses the same protocol as the clients.\n\n=Description\n\nA reflection attack uses the fact that both sides of a protocol work the same way to authenticate to the server using its own credentials, without ever seeing those credentials. The server and a normal client share a secret, which allows them to authenticate each other. To perform this authentication without simply sending the secret, they each pick a value and request that the other party hash that value with the secret. An attacker can attempt to take advantage of the symmetry in the protocol to circumvent the system, causing the server to authenticate against itself. The attack works like this:\n\n    #The attacker connects to the server.\n    #The server sends a challenge to the attacker.\n    #The attacker connects to the server again, but this time sends the challenge they received from the server previously.\n    #The server completes the challenge correctly and sends the result back to the attacker.\n    #The attacker uses that correct response and replies to the initial, still open challenge.\n    #The server checks the response and allows the attacker access to the resource being protected.\n\nThis sequence allows the attacker to authenticate to the server without ever knowing the secret.\n\n=Impact\n\n*An attacker, without proper credentials, will be able to authenticate and communicate with the server.\n\n=Vulnerabilities\n\n*Poor implementation of the challenge-response authentication system that uses the same protocol and same key in both directions.\n\n=Countermeasures\n\n*Require the key or protocol to be different in each direction.\n\n=Example\n\nFrom an attacker’s perspective this attack may look something like the following:\n\nFirst the attacker opens a connection to the server.\n\n|Client Sends in connection 1:\\\\{{{REQ: initialize connection}}}|\n\nSo, the server sends a challenge value which must be used to generate the response to be authenticated. The server sends a packet that may look like the following:\n\n|Server Sends in connection 1:\\\\{{{AUTH: domain=test@testdomain.comFunction: initiate/authenticatechallenge=6F1ED002AB5595859014EBF0951522D9}}}|\n\nNow the attacker has a challenge that she can send back to the server to force the server to create a valid response. So the attacker opens a second connection and sends the same packet to the server and waits for a response:\n|Client Sends in connection 2:\\\\{{{AUTH: domain=test@testdomain.comFunction: initiate/authenticatechallenge=6F1ED002AB5595859014EBF0951522D9}}}|\n\nThe server sends the following response back in the second connection:\n|Server Sends in connection 2:\\\\{{{AUTH: username=”demo”Function: authenticateResponse= 23D5C7C0BAB95DE5AFB0E6CDDA275D3A}}}|\n\nNote: In this example, the response hash is an MD5 hash of a valid username, password, domain, and the challenge. The attacker doesn’t need to know any more information than the challenge since the server is providing its credentials in hashed form.\n\nFrom this point, the attacker responds to the first connection that was opened with the response that the server provided in the second connection, and the authorization for the first connection is complete.\n|Client Sends in connection 1:\\\\{{{AUTH: username=”demo”Function: authenticateResponse= 23D5C7C0BAB95DE5AFB0E6CDDA275D3A}}}|\n\n=Additional Resources\n\n    *For more information on reflection attacks, see: http://en.wikipedia.org/wiki/Reflection_attack\n    *For more information on Reflection Attacks in an Authentication Protocol, see: https://www.owasp.org/index.php/Reflection_attack_in_an_auth_protocol\n\n=Related Items\n\n    *[[edea26f5-72e9-40fb-a2d3-00224a9a84cd|Attack: HTTP Replay Attack]]\n\n"
        ]
      }
    ]
  }
}