{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1242283169",
      "Content_Hash": "1136862825"
    },
    "Metadata": [
      {
        "Id": [
          "41ff6525-2cae-40a5-91e9-365d2d26feb9"
        ],
        "Id_History": [
          "a048eed9-ad5a-4dac-a8d3-68f42da69dbd,41ff6525-2cae-40a5-91e9-365d2d26feb9,25564870-77bd-43d8-9ccd-e6fc476feb24,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Man in the Middle Attack"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Attack"
        ],
        "DirectLink": [
          "Man in the Middle Attack"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "wikitext"
        },
        "Data": [
          "=Applies To\r\n\r\nAny two applications which communicate over any networked channel, such as the internet.\r\n\r\n=Description\r\n\r\nA man in the middle (MiTM) attack occurs when an attacker intercepts messages sent between two parties without their knowledge. The attacker is usually capable of reading, inserting and modifying the messages it intercepts. MiTM attacks can be carried out on various protocols and against various technologies to intercept and modify data being exchanged between two parties. This is done in such a way that the attacker compromises the confidentiality, integrity and/or availability of protected information. Any network request involving client-server communication -- including web requests, distributed component object model (DCOM) requests, and calls to remote components and Web services -- is subject to MiTM attacks. MiTM attacks can be used to attack unencrypted channels as well as encrypted channels (such as TLS) under certain circumstances.\r\n\r\n=Impact\r\n\r\n    *Loss of confidentiality: The attacker will be able to view potentially sensitive information by sitting in between the server and the client.\r\n    *Loss of integrity: The attacker will be able to change the data being sent to or from the server.\r\n    *Loss of availability: If the attacker can send unexpected data to a host and cause it to crash, then it could lead to a denial of service on the affected host.\r\n    *Alteration of keys: Modification of public keys during key exchanges between two parties.\r\n\r\n=Vulnerabilities\r\n\r\n    *Network vulnerabilities: A man in the middle attack is usually carried out by means of one of the following:\r\n        **ARP spoofing attack\r\n        **DNS hijacking or DNS Cache Poisoning\r\n        **DHCP message subversion/take-over\r\n        **Wireless packet injection attack\r\n        **Gateway takeover using various packet redirects\r\n        **Subversion of a gateway, router, or proxy between the victim and the server.\r\n\r\n*In addition to these network vulnerabilities, MiTM attacks become much easier to conduct if unencrypted or weakly encrypted communication channels are being used.\r\n\r\n=Countermeasures\r\n\r\n*Since the network weaknesses described above cannot be controlled for all potential users, it is recommended that cryptographic suites be used. Below are some examples at different layers:\r\n**At the network layer: IPSec\r\n**At the application layer: TLS, PGP\r\n\r\n*Use of these suites requires careful consideration of the key length and key store. Correct ways of doing so are provided in the Related Items section of this article.\r\n\r\n=Example\r\n\r\nA few examples are described below to demonstrate the various types of problems that MiTM attacks can cause:\r\n\r\n    *Code or command injection: Malicious code could be inserted into web-pages or email, which would be executed on the client application.\r\n    *Key exchange: Public keys exchanged by the server and the client could be modified and replaced with the attacker's public key. The attacker would then be able to read and modify traffic to and from both entities.\r\n    *Parameter substitution: Parameters to applications running on the client or the server could be modified by the attacker to alter the behavior of an application. A common attack here is to substitute the TLS version supported by the server. By forcing the client and server to negotiate on a weaker version of TLS, an attacker can easily compromise the confidentiality of the data.\r\n    *IPSec Failure: By blocking the key material exchange on UDP port 500, the end point will think that the other cannot start an IPSec connection. Worse, if the client is configured in rollback mode, there is a good chance that the user will not notice that the connection is in clear text.\r\n\r\n=Additional Resources\r\n\r\n    *For more information on Man In The Middle attacks, see: http://www.blackhat.com/presentations/bh-europe-03/bh-europe-03-valleri.pdf\r\n\r\n=Related Items\r\n\r\n    *[[0d3f3bbd-6442-4fd2-bb54-2ac10b64695c|Attack: ARP Spoofing Attack]]\r\n    *[[380b7108-0c16-4fbf-a914-6d37acf55421|Attack: DNS Cache Poisoning]]\r\n    *[[378080c8-3a72-4d2f-bf5e-a5cc6bd5f54b|Attack: Wireless Packet Injection Attack]]"
        ]
      }
    ]
  }
}