{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1118508499",
      "Content_Hash": "1985416068"
    },
    "Metadata": [
      {
        "Id": [
          "ff04b61b-734c-4298-8c75-777bf5419cbf"
        ],
        "Id_History": [
          "d190e4a5-6f18-409a-9c0d-a06156c47e6e,ff04b61b-734c-4298-8c75-777bf5419cbf,2cbb0ee7-af18-4f3c-bcbf-d1e28a2a4ce6,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6204f2d47eb7"
        ],
        "Title": [
          "Integer Underflow Attack"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Attack"
        ],
        "DirectLink": [
          "Integer Underflow Attack"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "wikitext"
        },
        "Data": [
          "=Applies To\r\n\r\nApplications written in any language that does not perform automatic bounds checking.\r\n\r\n=Description\r\n\r\nAn integer underflow occurs when an integer is decremented under the limit that the data type can hold. The most common result of an integer underflow is that instead of the resulting value becoming smaller, the data structure \"wraps\" and becomes as large as the data type can hold.\r\n\r\n=Impact\r\n\r\n    *Denial of service: Most often, the integer underflow will cause the application to crash after a memory address de-reference.\r\n    *Data corruption: If the result is used in a file read or write operation, the application may read or write from the wrong place in disk or memory, resulting in corruption.\r\n    *Remote code execution: In some cases, remote code may be executed if the calculated result is used for memory management or indexing into a buffer.\r\n\r\n=Vulnerabilities\r\n\r\n    *Improper arithmetic.\r\n    *Failure to validate integer input.\r\n    *Integer calculations or assignments used to determine the size of a buffer.\r\n    *Insufficient bounds checking and failure to consider sign.\r\n    *Program logic that makes assumptions about the value of integers.\r\n\r\n=Countermeasures\r\n\r\n    *Arithmetic checking: Always ensure that, when subtracting two numbers, the result is smaller than either operands. Take extra care when performing arithmetic operations with values near the maximum or minimum of the data type.\r\n    *Use a language or framework that does integer checking: Frameworks like .NET and Java can be set to automatically check for integer overflows and underflows (e.g. CheckForOverflowUnderflow in C# and RemoveIntegerChecks in VB.NET).\r\n    *Validate input: Always check the untrusted input for upper and lower limits and sign.\r\n    *Verify logic: Ensure that, in all cases, all integer logic will operate appropriately for the accepted limits.\r\n\r\n=Example\r\n\r\nThe following code segment shows a simple method whose job is to strip the the last character and the null terminator from a string, and return the result in a new character array.\r\n\r\n{{{\r\nchar* stripString(char* sentence)\r\n{\r\nif (!sentence) return 0;    \r\n//need one less, since we're stripping last character    unsigned int newLength = strlen(sentence) - 1;    \r\nchar* newBuffer = (char*) malloc (newLength);    \r\nif (newBuffer != NULL){ strncpy (newBuffer, sentence, newLength);\r\n}    \r\nreturn newBuffer;\r\n}\r\n}}}\r\n\r\nWhat happens when the string sentence is of zero-length? The strlen() call will return 0. Subtracting 1 from 0 when the data type is an unsigned integer will cause the value to wrap around to 4GB. So, in this code we would then attempt to allocate a 4 gigabyte buffer in the next line.\r\n\r\nWith a little care the problem can be avoided. Consider the following fixed version of the code:\r\n\r\n{{{\r\nchar* stripString(char* sentence)\r\n{\r\nchar* newBuffer = NULL;   \r\nunsigned int strLength = 0;\r\n\r\nif (!sentence) return 0;\r\n   strLength = strlen(sentence);   \r\nif (strLength > 0)\r\n{\r\nunsigned int newLength = strLength - 1;\r\nnewBuffer = (char*) malloc (newLength);       \r\nif (newBuffer != NULL)\r\n{          \r\nstrncpy (newBuffer, sentence, newLength);\r\n}\r\n}   \r\nreturn newBuffer;\r\n}\r\n}}}\r\n\r\n=Additional Resources\r\n\r\n    *For more information on Arithmetic Underflow, see: http://en.wikipedia.org/wiki/Arithmetic_underflow\r\n    *For more information on Java Data Types. see: http://www.unix.org.ua/orelly/java/langref/ch03_01.htm\r\n\r\n=Related Items\r\n\r\n    *[[46278060-865a-4882-b640-52f004064d5d|Attack: Integer Overflow Attack]]\r\n    *[[1408d3c3-7fc1-4ff0-910e-cdf0e191b669|Attack: Client-side Validation Attack]]\r\n"
        ]
      }
    ]
  }
}