{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "144405085",
      "Content_Hash": "-969087399"
    },
    "Metadata": [
      {
        "Id": [
          "21297bd0-81fc-4e10-97c9-d61afbdf76dd"
        ],
        "Id_History": [
          "21297bd0-81fc-4e10-97c9-d61afbdf76dd,74e78ea6-5deb-499e-9c5f-281f243728c7,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Forceful Browsing Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Forceful Browsing Vulnerabilities"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\n  <p />\n  <ul>\n    <li>Web applications </li>\n  </ul>\n  <p />\n  <h1>Summary</h1>\n  <p>Forceful browsing is an extremely common bug in web applications and services. This vulnerability is straight forward. Web site applications and servers usually follow a specific flow by design. For example, a hotel reservation web service follows the sequence below to allow guests to book rooms online. The application doesn't expect that customers pay (3) before selecting their rooms and dates (1), nor does it expect customers to receive a confirmation page (4) without making a payment (3).</p>\n  <p>Attackers commonly use forceful browsing to:</p>\n  <ol>\n    <li>Bypass authentication. </li>\n    <li>Exploit web based services. </li>\n    <li>Access confidential pages.</li>\n  </ol>\n  <p>We recommend the following steps in testing against forceful browsing bugs:</p>\n  <ul>\n    <li>Step 1: Understand Attack Scenarios. </li>\n    <li>Step 2: Identify high risk components. </li>\n    <li>Step 3: Start testing and exploring. </li>\n    <li>Step 4: Tune test cases. </li>\n  </ul>\n  <h1>Step 1: Understand Attack Scenarios</h1>\n  <p>Start by understanding the details of forceful browsing attack scenarios. The scenarios below portray the three most common forceful browsing attack steps:</p>\n  <ol>\n    <li>Bypassing authentication by breaking the sequence of use cases. </li>\n    <li>Exploiting web based services by tampering with URL parameter values. </li>\n    <li>Browsing directly to a restricted page.</li>\n  </ol>\n  <h2>\n    Authentication bypass by breaking the sequence of use cases\n  </h2>\n  <h3>\n    <b>Summary</b>\n  </h3>\n  <p>Most modern software employs use cases to define its behavior and functionality. In web applications, use cases involve a sequence of pages that perform a certain task. For instance, an online banking application uses the following sequence to implement the login use case. First it asks a valid client to login with their user name and password through the first page in the sequence (<i>index.asp</i>). If login is successful, the application sends the user (e.g. 'John') their account summary using a second page in the sequence (<i>personalinfo.asp</i>). If login fails the application sends John a login error message in <i>index.asp</i>. The use case is simple since its sequence has just two pages:</p>\n  <ol>\n    <li>\n      <i>index.asp\n    \n    </i>\n    </li>\n    <li>\n      <i>personalinfo.asp</i>\n    </li>\n  </ol>\n  <p>These steps illustrate the use case expected scenario:</p>\n  <h3>Expected Behavior</h3>\n  <ol>\n    <li>The site asks for the user name and password of the banking client through a web form in the following URL: <i>http://www.example.com/index.asp</i></li>\n    <li>The victim (real name John Cohen, user name cohen) enters their user name and password in <i>index.asp</i>. </li>\n    <li>If the login succeeds, the application code in <i>index.asp</i> invokes <i>personalinfo.asp</i> and sends it in response to the user. It employs the <i>user</i> URL parameter to differentiate personal information from all its valid users. Since John is a valid user, he logs in and gets a summary of his accounts. </li>\n    <li>If authentication fails the web application sends <i>index.asp</i> back to the user with an error message. </li>\n  </ol>\n  <h3>Attack Scenario</h3>\n  <p>The problem arises when the attacker breaks the web site's intended flow by directly jumping to the <i>personalinfo.asp </i>(2) page without starting in the expected order by the <i>login.asp </i>(1) page. In this case the flow of the application has two steps: </p>\n  <p>\n    <font face=\"'Courier New'\">(1)index.asp -&gt; (2)personalinfo.asp</font>\n  </p>\n  <p>The application server is vulnerable to authentication bypass because it allows an attacker to forcefully browse to <i>personalinfo.asp </i>(2) directly (without a successful login in <i>index.asp </i>(1)). This allows an attacker to forcefully browse the victim's personal account.  </p>\n  <p>Below are the steps for this attack:</p>\n  <ol>\n    <li>The attacker directly types the following URL in his browser's address bar:<i> http://www.example.com/personalInfo.asp?user=cohen</i></li>\n    <li>The vulnerable server sends <i>personalinfo.asp </i>with the victim's (John's) information to the attacker's browser. Now the attacker can access the victim's personal banking info from his browser</li>\n  </ol>\n  <p>Note that this attack succeeds because the server accesses the requested <i>personalinfo.asp </i>(2) page without checking if the login step (1) succeeded. Most web applications protect against this attack by using session management to restrict users to specific pages based on their authentication state. </p>\n  <h2>Exploiting web based services by tampering with URL parameter values</h2>\n  <p>Like mentioned above web applications employ use cases involving a sequence of pages to perform a certain task. This web application lets you rent movies and watch them online. There are different use cases such as registering, browsing movies, renting a movie, watching a movie, and managing your account just to list a few.  </p>\n  <p>The order of use cases is important. For example, you can't browse the movies without logging on to the site, and you can't watch a movie without renting it. This scenario concentrates on the watching a movie use case.</p>\n  <h3>Expected Behavior</h3>\n  <p>After creating an account, a benign client logs in and receives his home page with links to the movies he has rented. He then chooses one of his rented movies to watch. It follows the following sequence:</p>\n  <ol>\n    <li>\n      <i>login.asp \n    \n    </i>\n    </li>\n    <li>\n      <i>home.asp \n    \n    </i>\n    </li>\n    <li>\n      <i>rentedMovies.asp \n    \n    </i>\n    </li>\n    <li>\n      <i>watchMovie.asp</i>\n    </li>\n  </ol>\n  <p>Steps: </p>\n  <ol>\n    <li>A registered user (he registered in a user registration use case) logs in to receive a session key and authenticate (1) </li>\n    <li>The server then sends the user's home page <i>home.asp</i> (2) to the user. </li>\n    <li>The user receives a page with a list of his rented movies: <i>rentedMovies.asp</i> (3) and selects a movie by clicking one in his list. This results in the client sending this URL request to the server with the movie name in the <i>movie </i>URL <i></i>parameter value: <i>http://www.example.com/selectMovie.asp?movie=shrek </i></li>\n    <li>The server responds by playing the movie in the user's browser.</li>\n  </ol>\n  <p>Note: the application previously used the \"rent a movie\" <i></i>use case to add movies to his list.  </p>\n  <h3>Attack Scenario</h3>\n  <p>A bug in the web application allows an attacker to register and log in (1). Once logged in, the attacker directly jumps to step 4 (<i>selectMovie.asp</i>) passing any film name in the <i>movie </i>URL <i></i>parameter value. The application doesn't check if the movie passed in the URL was actually rented by the user and starts playing it right away.</p>\n  <p>These steps show the details of the attack scenario:</p>\n  <ol>\n    <li>The attacker registers in the movie site using the user registration use case </li>\n    <li>The attacker logs in to the movie site through <i>login.asp</i> (1)  </li>\n    <li>The attacker wants to watch <i>Braveheart </i>and notices he hasn't rented this movie. </li>\n    <li>Since he doesn't want to pay the rental fee, the attacker forcefully browses to the location of this movie in <i>selectMovie.asp</i><b></b>(3) modifying the URL's <i>movie </i>parameter like this:<i> http://www.example.com/watchMovie.asp?name=braveheart</i></li>\n    <li>The application's next page,<b></b><i>watchMovie.asp</i> doesn't check that the movie passed in the URL was rented by the attacker and starts playing the movie in the attacker's browser for free. </li>\n  </ol>\n  <h2>\n    Browsing hidden and restricted pages and files    <em></em></h2>\n  <p>By now you should know that most web application designers develop services and applications as a sort of storyboard where the user does something and goes somewhere. There are usually a certain number of different flows or use cases.  Each flow is a walk through different pages. However, there are pages that are not included in the specified behavior such as configuration files or private document folders. In this scenario the attacker forcefully browses to these restricted areas.</p>\n  <h3>Expected Behavior</h3>\n  <ol>\n    <li>A user enters a URL in an application site that contains private information:<i> www.example.com/webapp/hidden/privatestore </i></li>\n    <li>The site sends the user a 401 (<i>access denied</i>) response </li>\n  </ol>\n  <h3>Attack Scenario</h3>\n  <ol>\n    <li>An attacker enters a URL in an application site that contains private information:<i> www.example.com/webapp/hidden/privatestore </i></li>\n    <li>The site allows the attacker to browse to this location and read its contents.</li>\n  </ol>\n  <p>This application is vulnerable since the permissions are nonexistent or too loose and allow the attacker to gain access to the private store. </p>\n  <h1>Step 2: Identify High Risk Components</h1>\n  <p>In step 2 you must start by recognizing good programming practices that protect against this bug (mitigations), listing the high risk pages and their mitigations so that you can test them later, identifying all entry points for forceful browsing attacks, and creating a test plan for systematic and comprehensive testing.  </p>\n  <h2>\n    Review the application code \n  </h2>\n  <p>To start this task you need to properly understand the mitigations (appropriate programming) to protect against forceful browsing bugs. A secure application mitigates this bug by:</p>\n  <ul>\n    <li>Setting web server security on files and folders. </li>\n    <li>Restricting browsing to a set of sequenced multi-step operations enforced by session management. </li>\n    <li>Rechecking authentication before displaying critical pages.</li>\n  </ul>\n  <p>All pages of web applications are potentially at risk of forceful browsing vulnerabilities. List all pages in your application: the ones that use mitigations mentioned here as well as the ones that don't.  </p>\n  <h2>\n    \n      Setting web server security on files and folders<b></b></h2>\n  <p>Start by looking at the web server administrator's console and individual file/directory permissions. Web servers such as Apache and IIS provide access control to web folders. For example, IIS allows access to Windows Authenticated users only or any anonymous user. Ideally anonymous should only be able to access low risk pages. All other pages must use some form of authentication. <i>Integrated Windows Authentication</i> is recommended since it is based on Windows local or domain accounts, which are implemented safely using existing Access Control Lists (ACL's). ASP.NET also allows for permission to be set in the <i>Web.config</i> file using specific users or roles (role based security). This W<i>eb.config</i> code allows Bob only and denies any other user:<font face=\"'Courier New'\"><br /></font></p>\n  <p>\n    <font face=\"'Courier New'\">&lt;configuration&gt;<br />  &lt;system.web&gt;<br />    &lt;authorization&gt;<br />      &lt;allow users=\"domainname\\Bob\" /&gt;<br />      &lt;deny users=\"*\" /&gt;<br />    &lt;/authorization&gt;<br />  &lt;/system.web&gt;<br />&lt;/configuration&gt; </font>\n  </p>\n  <p>The following <i>Web.config</i> example illustrates how to code role-based permissions:<font face=\"'Courier New'\"><br /></font></p>\n  <p>\n    <font face=\"'Courier New'\">&lt;configuration&gt;<br />  &lt;system.web&gt;<br />    &lt;authorization&gt;<br />      &lt;allow roles=\"domainname\\Managers\" /&gt;<br />      &lt;deny users=\"*\" /&gt;<br />    &lt;/authorization&gt;<br />  &lt;/system.web&gt;<br />&lt;/configuration&gt; </font>\n  </p>\n  <p>In Apache, you can also restrict access to files and directories by usernames, passwords, and by IP address using <i>.htaccess </i>files or within the Apache configuration. Below is an example of password protection with a <i>.htaccess </i>file in Apache:</p>\n  <p>\n    <font face=\"'Courier New'\">AuthUserFile /home/newuser/www/stash/.htpasswd<br />AuthGroupFile /dev/null<br />AuthName \"Protected Directory\"<br />AuthType Basic<br />&lt;Limit GET POST&gt;<br />require user newuser<br />&lt;/Limit&gt;</font>\n  </p>\n  <p>You can also deny users based on IP addresses:<font face=\"'Courier New'\"><br /></font></p>\n  <p>\n    <font face=\"'Courier New'\">Order allow, deny<br />Deny from 123.45.67.8<br />Deny from 123.123.7<br />Allow from all</font>\n  </p>\n  <p>Make sure to go through all your server's files, directories, private directories, and other objects that require special permissions. </p>\n  <h2>\n    <b>\n      Restricting browsing to a set of sequenced multi-step operations\n    </b>\n    <b>\n      with session management\n    </b>\n  </h2>\n  <p>A good mitigation is to match use cases with client sessions. Create a table that matches use cases with the navigation state for each user session. Then enforce the model in the table before allowing any user to browse to any new page.  Reject access to the requested page if the user's session doesn't match the expected session for the requested page. The following steps illustrate this mitigation:</p>\n  <h3>Step 1. The application creates a  model for the check email use case:</h3>\n  <p>Use case: check email<br />Session ID: (client-based session created in <i>login.asp</i>)<br />Expected steps:<br /><span style=\"font-family: 'Courier New'; \">login.asp - client session<br /></span><span style=\"font-family: 'Courier New'; \">welcome.asp - client session<br /></span><span style=\"font-family: 'Courier New'; \">checkaccount.asp - client session</span></p>\n  <div>\n    <ul>\n    </ul>\n    <div>Use case: manage accounts</div>\n  Session ID: (admin-based session created in <i>login.asp</i>)<br />Expected steps:</div>\n  <div>\n    <font face=\"'Courier New'\">admin.asp - admin session</font>\n  </div>\n  <div>\n    <font face=\"'Courier New'\">welcome.asp - admin session</font>\n  </div>\n  <div>\n    <font face=\"'Courier New'\">manage.asp - admin session</font>\n  </div>\n  <div>\n    <h3>Step 2. The attacker attempts to jump to the admin console using this sequence:</h3>\n    <p>\n      <font face=\"'Courier New'\">login.asp -&gt; welcome.asp -&gt; manage.asp</font>\n    </p>\n    <p>Although this attacker has a session and can login and access his account, he is trying break into the admin console with a client session instead of an admin session. The web application recognizes the invalid sequence and stops the attacker from accessing<i> manage.asp</i>.<b><i></i></b></p>\n    <h2>\n    \n      Rechecking authentication before displaying critical pages<b></b></h2>\n    <p>Review the application code to see it rechecks the authentication state of clients. For example, the following pseudo-code rechecks authentication before displaying any critical info:\n    </p>\n    <pre>/* start session management */\nsession_start();\nif (user_authenticated_against_session)\n/* allow access to user */\nelse\n/* deny access */\n</pre>\n    <p>In addition, look for code that checks if the requesting client is using the appropriate session:</p>\n    <pre>/* start session management */\nsession_start();\nif (current_session_matches_required_session)\n/* allow access to user */\nelse\n/* deny access */</pre>\n    <h2>\n    \n      Identify all entry points<b></b></h2>\n    <p>Entry points are the roads that an attacker might use to send forceful browsing attack paths. The common entry points for forceful browsing are these:</p>\n    <ul>\n      <li>URL contents. </li>\n      <li>Web form input fields. </li>\n      <li>Web service methods. </li>\n      <li>Network packets sent from HTTP(s) client.</li>\n    </ul>\n    <h2>\n    \n      List high risk components, mitigations, and entry points<b></b></h2>\n    <p>Finish this step by making a list of all of your application web pages files and folders.  For each entry in the list, indicate if the page uses a specific forceful browsing mitigation.  In addition, indicate what entry points relate to the specific page, folder, or file under test: </p>\n    <table>\n      <tbody>\n        <tr>\n          <td>\n            <b>File Name</b>\n          </td>\n          <td>\n            <b>Mitigated</b>\n          </td>\n          <td>\n            <b>Mitigation</b>\n          </td>\n          <td>\n            <b>URL</b>\n          </td>\n          <td>\n            <b>Web form</b>\n          </td>\n          <td>\n            <b>Service</b>\n          </td>\n          <td>\n            <b>Network</b>\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>Login.asp</i>\n          </td>\n          <td>\n            Yes\n          </td>\n          <td>\n            Creating authenticated session\n          </td>\n          <td>\n            X\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>Adminconsole.asp</i>\n          </td>\n          <td>\n            Yes\n          </td>\n          <td>\n            Session tracking\n          </td>\n          <td>\n            X\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>Index2.asp</i>\n          </td>\n          <td>\n           Yes\n          </td>\n          <td>\n            Rechecking authenticated session\n          </td>\n          <td>\n            X\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>getMoney.asp</i>\n          </td>\n          <td>\n            Yes\n          </td>\n          <td>\n            .htaccess\n          </td>\n          <td>\n            X\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>Profile.asp</i>\n          </td>\n          <td>\n            Yes\n          </td>\n          <td>\n            IIS Integrated Windows Authentication\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            X\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>Privatefolder</i>\n          </td>\n          <td>\n            No\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            X\n          </td>\n          <td>\n            <br />\n          </td>\n        </tr>\n        <tr>\n          <td>\n            <i>Configuration.ini</i>\n          </td>\n          <td>\n            No\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            <br />\n          </td>\n          <td>\n            X\n          </td>\n        </tr>\n      </tbody>\n    </table>\n    <p>A table like this helps you guide you testing. It is important that you test the mitigations as they can be poorly implemented and allow for forceful browsing vulnerabilities. </p>\n    <h1>Step 3: Start Testing and Exploring</h1>\n    <p>This section contains recommendations on how to set up your test environment, and then start testing and exploring:</p>\n    <h2>\n    Discover web application directory structure\n  </h2>\n    <p>If you don't have the benefit of design documents or source access, you will need to find a way to discover all the folders and files in the application under test. This can be very time consuming so it's better to automate.  </p>\n    <p>A good way to do this is to utilize a web crawler/spidering bot. This type of tool allows you to list many of the resources on the server by following internal links, and it will then create an index of the site under test.</p>\n    <p>Another way to tackle directory structure discovery is through brute force discovery. Here, the attacker needs to use a tool that creates directory names using brute force and check if they exist in the application under test.</p>\n    <h2>Test all mitigations</h2>\n    <p>The next section covers basic methods to test all mitigations from the table made in Step 2.</p>\n    <h3>\n      <b>Test protected directories </b>\n    </h3>\n    <p>You'll need to start testing with the lowest privileges possible. Make sure you are logged out of the site, so that you have the lowest access possible. Then find out what directories are accessible by higher privileged clients. Try forcefully browsing to them. Remember to test both users and roles since a coding mistake may allow roles that contain dangerous elements. Finally make sure to test all of the directories protected by the web server (IIS, Apache, etc.)</p>\n    <h3>\n      <b>Try to break the sequence of multi-step operations</b>\n    </h3>\n    <p>Try breaking logical sequences of pages. For instance, as our example movie rental site did, a bank site might use the following sequence of pages to display a client's account:</p>\n    <ol>\n      <li>\n        <i>www.example.com/accounts/login.asp \n      </i>\n      </li>\n      <li>\n        <i>www.example.com/accounts/accountSummary.asp \n      </i>\n      </li>\n      <li>\n        <i>www.example.com/ accounts/GiveAccountNumber.asp \n      </i>\n      </li>\n      <li>\n        <i>www.example.com/accounts/displayAccountInfo.asp</i>\n      </li>\n    </ol>\n    <p>During this step, try breaking the sequences above in multiple ways. Don't waste your time in breaking sequences that don't pose a danger to the application.</p>\n    <h3>\n      <b>Recheck authentication before displaying critical pages</b>\n    </h3>\n    <p>Here are some steps to test if an application properly verifies authentication before displaying critical pages:</p>\n    <ol>\n      <li>Log in, authenticate, and receive a session. </li>\n      <li>Browse to a critical page which only you should have access to:<i> http://www.example.com/accountInfo.asp?name=yourname </i></li>\n      <li>Log out.</li>\n      <li>Enter the same URL you were led to above, without logging in:<i> http://www.example.com/accountInfo.asp?name=yourname</i></li>\n    </ol>\n    <p>This is similar to session hijacking but there are no sessions hijacked. The attacker exploits the fact that the application doesn't recheck authentication before displaying critical pages. A forceful browsing vulnerability exists if the victim's account information is loaded.<b></b></p>\n    <h1>Step 4: Tune your test cases</h1>\n    <p>The final testing step is to tune your testing for both coverage and speed.</p>\n    <h2>\n    Cover all encodings in all entry points\n  </h2>\n    <p>During this step you must test all variations to request restricted pages. For example, URL's can be represented in different ways; one application may use the plus (+) sign to substitute spaces:</p>\n    <p>\n      <font face=\"'Courier New'\">www.example.com/profile/Jonny+Smith+Robinson</font>\n    </p>\n    <p>While another uses the characters %20 to represent the same spaces:</p>\n    <p>\n      <font face=\"'Courier New'\">www.example.com/profile/Jonny%20Smith%20Robinson</font>\n    </p>\n    <p>To be able to forcefully browse to a certain site you need the correct encoding or else you may get page not found errors (404) and fail to cover the entire site. Alternatively, checks may not be in place for certain encodings, and canonicalization vulnerabilities may be present which could lead to successful forceful browsing attacks while using unexpected encodings.</p>\n    <h2>\n    Automate your testing\n  </h2>\n    <p>You can easily automate forceful browsing tests. The steps are the following:</p>\n    <p>\n    </p>\n    <ol>\n      <li>Create a model with a list of pages in your application, the state, and the privileges needed to access them.</li>\n      <li>Write a test generator that creates URL's based on the list of pages, and with different encodings.</li>\n      <li>Write a test program that submits URL's to the server application under test.</li>\n      <li>Write a test verifier that observes how the server responds to each test, and if it matches the model. <b></b></li>\n    </ol>\n    <p />\n    <h1>\n      <b>Conclusions</b>\n    </h1>\n    <p>In order to test for forceful browsing bugs you need to understand what look like by revising attack scenarios and their mitigations. Then, generate a list of all pages in your application and check if they, as well as the entry points that relate to them, are mitigated against forceful browsing attacks. </p>\n    <p>During the testing phase, start by finding out the directory structure and listing all files served by the application. It is important that you test and verify all existing mitigations. Finish by tuning you test cases based on different entry point encoding techniques. </p>\n    <p>To successfully test for forceful browsing bugs you need to be very thorough. Use tools and develop automation to aid with your testing and get the most coverage possible.</p>\n    <p />\n  </div>"
        ]
      }
    ]
  }
}