{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "764644486",
      "Content_Hash": "-1522149549"
    },
    "Metadata": [
      {
        "Id": [
          "3c358178-a14f-4d19-b579-83a393220153"
        ],
        "Id_History": [
          "3c358178-a14f-4d19-b579-83a393220153,1bcdf4ea-8149-4be0-a78b-ac3a9bff3954,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "How to Determine Trust Boundaries"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Determine Trust Boundaries"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Description</h1>\r\n  <p>To help identify trust boundaries, start by identifying your outer system boundaries. For example, your application can write to files on server <i>x</i>, it can make calls to the database on server <i>y</i>, and it can call Web service <i>z</i>. This defines your system boundary. Next, identify access control points, or the key places where access requires additional privileges or role membership. For example, a particular page might be restricted to managers. The page requires authenticated access and requires that the caller is a member of a particular role. Finally, identify trust boundaries from a dataflow perspective. </p>\r\n  <p>For each subsystem, consider whether the upstream data flow or user input is trusted, and if it is not, consider how the data flow and user input can be authenticated and authorized. Knowing which entry points exist between trust boundaries enables you to focus your threat identification on these key entry points. For example, you are likely to have to perform more validation on data passed through an entry point at a trust boundary. </p>\r\n  <p>Trust boundaries indicate where trust levels change. You can think of trust from the perspective of confidentiality and integrity. For example, a change in access control levels in your application, where a specific role or privilege level is required to access a resource or operation, would be a change in a trust boundary. Another example would be at an entry point in your application where you might not fully trust the data passed to the entry point. </p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}