{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-195385162",
      "Content_Hash": "104798141"
    },
    "Metadata": [
      {
        "Id": [
          "40771780-be59-4d4c-b283-5ec3cc286357"
        ],
        "Id_History": [
          "40771780-be59-4d4c-b283-5ec3cc286357,a169c537-391e-4881-9359-45b064a8fa5f,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Session Prediction Bugs in Java"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Session Prediction Bugs in Java"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>\r\n     Applies to: \r\n  </h1>\r\n  <ul>\r\n    <li>J2EE applications </li>\r\n  </ul>\r\n  <h1>\r\n     Summary \r\n  </h1>\r\n  <p>Java web applications use sessions to relate authentication and authorization decisions with the subsequent activities of a user.  Sessions are tracked with session identifiers (or session IDs), ensuring they have been authenticated before allowing access certain areas of an application or performing particular transactions.</p>\r\n  <p>For example, an online banking application requires a valid session ID before its clients can access their account details or make transfers.  An application commonly creates and assigns a session ID to its clients at login time, after their credentials have been checked.   Later, before allowing the clients to browse through different pages or execute specific functionality, the application checks the session ID sent in the client’s request against a server copy of the client’s session ID and allows the request if they match. </p>\r\n  <p>During a session prediction attack, an attacker observes the algorithm the application uses to create new session identifiers in an attempt to discover a pattern.   The attacker’s goal is to predict a valid session ID corresponding to another user in order to impersonate or spoof the user.    </p>\r\n  <p>It is recommended to follow these steps to test for session prediction bugs:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Start testing and exploring </li>\r\n    <li>Step 4: Execute additional testing</li>\r\n  </ul>\r\n  <h1>\r\n     Step 1: Understand Attack Scenarios \r\n  </h1>\r\n  <p>The first step in testing for session prediction bugs is to identify its attack scenario.     </p>\r\n  <p>Before reviewing a session prediction it is important to understand how and why Internet applications use session identifiers.  Internet applications such as e-commerce sites require their clients to enter valid usernames and passwords to log in to the application.  To avoid prompting clients to re-enter their credentials as they navigate through the application and execute transactions, the application creates a session ID for the logged-in client and checks it to verify the client’s authenticity with every request.     </p>\r\n  <p>After successful logins, new session IDs are usually sent to clients as a cookie (using the Set-Cookie header) or in the URL.  Once the client receives the session ID, it sends it in future HTTP requests.</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>A client enters valid username and password in response to an application request. </li>\r\n    <li>The application creates a session ID and sends it to client. </li>\r\n    <li>The client receives session ID. </li>\r\n    <li>The client makes an HTTP(S) request to application that requires authentication, and it includes the session ID received in Step 4. </li>\r\n    <li>The application checks that the session ID sent by the client is valid and replies to the request based on the value of the valid session ID.</li>\r\n  </ol>\r\n  <p>A session prediction attack begins with an attacker selecting a target Internet application.  The attacker will then monitor that application’s session ID generation scheme.  The attacker looks for a pattern in the collected session IDs such as incrementing characters, time stamps, or parts of the client’s name used in the session ID.  If the attacker discovers a weak session ID generation algorithm, they may be able to predict a valid session and replace their own current-session ID with the value of the predicted one.  If the application is vulnerable and this is successful, the attacker will be able to impersonate another logged in user.     </p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>An attacker starts monitoring network traffic. </li>\r\n    <li>The attacker logs in to the target application by entering valid username and password. </li>\r\n    <li>The application creates a session ID and sends it to client. </li>\r\n    <li>Repeat Steps 2 and 3, reviewing valid session IDs until determining if predicting future session IDs is possible. </li>\r\n    <li>If Step 4 shows that session prediction is possible, the attacker will continue with a <i>session hijacking</i> attack. </li>\r\n  </ol>\r\n  <h1>\r\n     Step 2: Analyze Causes and Countermeasures \r\n  </h1>\r\n  <p>The next step in testing for session prediction bugs is to understand what causes them and how to protect against them.</p>\r\n  <h2>\r\n    <em>Session Prediction Causes</em>\r\n  </h2>\r\n  <p>J2EE applications and servlets provide a framework for authentication and session ID management using the <i>Session</i> object.   However, developers might also implement their own using cookies. First, a session ID is set:</p>\r\n  <pre>Cookie cookie = new Cookie(\"Session ID\", \"user01\");<br />response.addCookie(cookie);</pre>\r\n  <p>Then, before allowing the client to perform a request, the code checks the value of the cookie against the expected value:</p>\r\n  <pre>Cookie[] cookies = request.getCookies();<br />String sessionID  = cookies[0].getValue();\r\nif (sessionID.equals(\"user01\"))\r\n{out.print(\"authenticated\");\r\n}</pre>\r\n  <p>Developers should not implement their own session ID generation scheme as they can suffer from low entropy and similarly poor security issues that make them easy to predict.</p>\r\n  <h2>\r\n    <em>J2EE Misconfiguration</em>\r\n  </h2>\r\n  <p>J2EE applications must be careful to run with a secure configuration.    By default a J2EE session ID is of 128 bits in size with 64 bits of entropy.  However, web servers such as Tomcat or WebLogic can change the length of the session ID and lower the bits of entropy, allowing session prediction attacks.    Research performed by OWASP shows that setting the session identifier length to 128 protects J2EE applications against session prediction attacks [i].          </p>\r\n  <h2>\r\n    <em>Low entropy session IDs</em>\r\n  </h2>\r\n  <p>The principal cause of session prediction bugs is that sessions are not random enough - they have low entropy.  For instance, a session ID generation algorithm might create user sessions like this:</p>\r\n  <pre>AWEG00013BCD\r\nAWFG00014BCD\r\nAWGG00015BCD\r\nAWHG00016BCD\r\nAWIG00017BCD </pre>\r\n  <p>By analyzing the above session IDs, an attacker can easily predict the sequential session IDs to be:</p>\r\n  <pre>AWJG00018BCD\r\nAWKG00019BCD\r\nAWLG00019BCD </pre>\r\n  <p>Low entropy session IDs include sessions that are too short in length or use predictable time stamps. </p>\r\n  <h2>\r\n    <em>Using client credentials as session IDs</em>\r\n  </h2>\r\n  <p>Some applications construct their session IDs using client’s credentials.  For instance, an application might build its session IDs by  using the client’s email address:</p>\r\n  <pre>sid=user01@example.com</pre>\r\n  <p>An attacker might be able to execute a successful attack by replacing his own session ID with the email of the target client.  Applications should use client credentials as part of the session ID only if they are combined with an additional high entropy string.</p>\r\n  <pre>JSESSIONID: user01   Wrong\r\nJSESSIONID: AA932n90f20dfwuih1QAxxy-user01   OK</pre>\r\n  <h2>\r\n    <em>Session Prediction Countermeasures</em>\r\n  </h2>\r\n  <p>To protect against session prediction attacks in J2EE, developers should take advantage of J2EE built-in session functionality.  J2EE applications and servlets can automatically create a session ID with enough entropy to protect it against session prediction attacks.   In addition, make sure to set the length of J2EE session IDs to at least 128 bits if the underlying web server has changed it.</p>\r\n  <p>Note that protecting against session prediction is different from protecting against session hijacking.  Session prediction protection focuses on creating high entropy session IDs while session hijacking protection includes using additional defenses like forms authentication and SSL.   .</p>\r\n  <h1>\r\n     Step 3: Start Testing and Exploring \r\n  </h1>\r\n  <p>Now that you have understood session prediction attack scenarios as well as the causes and how to protect against them, it is necessary to execute basic test cases and explore their results.</p>\r\n  <h2>\r\n    <em>Test for session IDs of short length and low entropy </em>\r\n  </h2>\r\n  <p>Follow these steps:</p>\r\n  <ol>\r\n    <li>Download and run the Burp suite, a toolkit for internet security testing, at <a href=\"http://portswigger.net/sequencer/help.html\">http://portswigger.net/sequencer/help.html</a>, turning intercept off. </li>\r\n    <li>Open a web browser and set connection options to use the Burp proxy. </li>\r\n    <li>Log in to the target application with a valid username and password. </li>\r\n    <li>Wait for application to reply with a session ID (can be in cookie, URL, or body). </li>\r\n    <li>In the Burp suite, click on the <em>Proxy</em> tab and the <em>History</em> sub-tab. </li>\r\n    <li>Identify the HTTP authentication request, right-click on it, and select <em>Send to Sequencer</em>. </li>\r\n    <li>In the Burp suite, click on the <em>Sequencer</em> tab and the <em><strong></strong>Live capture</em> sub-tab. </li>\r\n    <li>Select the request and identify the session ID. </li>\r\n    <li>Click <em>start capture</em> and wait for the Burp sequencer to give a report.</li>\r\n  </ol>\r\n  <p>Expected results: The session ID length should be at least 128 bits and have a minimum of 64 bits of effective entropy.  If the Burp sequencer reports a rating of medium or poor, the application is vulnerable to session prediction.</p>\r\n  <p>For detailed information about using the Burp sequencer to test session ID entropy, refer to the Burp Sequencer Help page, which has simple instructions and screenshots:    <a href=\"http://portswigger.net/sequencer/help.html\">http://portswigger.net/sequencer/help.html</a></p>\r\n  <h2>\r\n    <em>Test for client credentials in session IDs</em>\r\n  </h2>\r\n  <p>Follow these steps:</p>\r\n  <ol>\r\n    <li>Download Wireshark, a network protocol analyzer, at <a href=\"http://www.wireshark.org/\">http://www.wireshark.org/</a> then launch it. </li>\r\n    <li>Open a web browser. </li>\r\n    <li>Log in to the target application with a valid username and password. </li>\r\n    <li>In Wireshark, identify the session ID. </li>\r\n    <li>Look for client credentials in the session ID.</li>\r\n  </ol>\r\n  <p>Expected results:  The session ID should not consist of client credentials, usernames, or any other fixed strings unless a sufficient amount of random data is also present, as fixed strings are easy to predict.    </p>\r\n  <h1>\r\n     Step 4: Execute Additional Testing \r\n  </h1>\r\n  <p>Make sure you cover all entry points for session prediction attacks.    Although many applications commonly send session IDs in cookies, some applications use other methods such as hidden variables or parameters in the URL.  In either case, it is necessary for attackers to identify the location used by the application.  Below are two examples of URLs containing a session ID:</p>\r\n  <pre>http://example.com/34i77i2af12xxz/example.jsp\r\nhttp://example.com/example.jsp?sid=34i77i2af12xxz</pre>\r\n  <p>The first example uses the session ID as a URL directory mapping while the second employs a URL parameter.</p>\r\n  <p>The code below shows a session ID passed as a <em>POST</em> request variable using a hidden input tag:</p>\r\n  <pre>     \r\n\r\n&lt;form method=\"post\" action=\"example \" /&gt;<br />...<br />&lt;input value=\"user01\" type=\"hidden\" name=\"sid\" /&gt;<br />&lt;input value=\"324802581\" type=\"hidden\" name=\"user-account\" /&gt;<br />&lt;input name=\"Continue\" type=\"submit\" /&gt;\r\n&lt;/form&gt;<br /></pre>\r\n  <h1>\r\n     Conclusions \r\n  </h1>\r\n  <p>Session prediction bugs affect J2EE applications that implement their own session ID generation scheme instead of using J2EE built-in sessions.  To test for session prediction vulnerabilities in J2EE applications it is necessary to understand how a session prediction attack is executed as well as the causes and how to protect against one in J2EE environments.   Then you must measure the entropy of the session ID generation and test for the session IDs consisting of only fixed strings like client credentials.  Finally, make sure to cover all the different entry points for session prediction bugs including URLs and hidden input tags. </p>\r\n  <div>\r\n    <br />\r\n    <hr />\r\n  </div>\r\n  <p>[i]  Insufficient Session-ID Length.   OWASP.    <a href=\"http://www.owasp.org/index.php/J2EE_Misconfiguration:_Insufficient_Session-ID_Length\"> http://www.owasp.org/index.php/J2EE_Misconfiguration:_Insufficient_Session-ID_Length </a></p>"
        ]
      }
    ]
  }
}