{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-622148334",
      "Content_Hash": "-200092667"
    },
    "Metadata": [
      {
        "Id": [
          "444d8af1-472a-40f5-8f6c-76ca1685a044"
        ],
        "Id_History": [
          "444d8af1-472a-40f5-8f6c-76ca1685a044,3caec7b0-4382-4169-87cd-7506e90fc6f4,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Alternate Data Stream Bugs in Java"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Alternate Data Stream Bugs in Java"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\r\n    Applies to\r\n  </h1>\r\n  <ul>\r\n    <li>J2EE applications</li>\r\n  </ul>\r\n  <h1>\r\n    Summary\r\n  </h1>\r\n  <p>J2EE applications running in an NTFS file system may be vulnerable to Alternate Data Stream (ADS) bugs that allow attackers to access alternate file streams in order to hide data and executable programs or to steal the source code of J2EE applications.  </p>\r\n  <p>It is recommended to follow these steps to test for ADS bugs in J2EE:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Execute test cases </li>\r\n    <li>Step 4: Fine-tune test case data</li>\r\n  </ul>\r\n  <h1>\r\n    Step 1: Understand Attack Scenarios\r\n  </h1>\r\n  <p>The first step in learning how to test for Alternate Data Stream bugs is to understand the different attack scenarios involved:</p>\r\n  <ul>\r\n    <li>Hiding attacker data </li>\r\n    <li>Disclosing application source code</li>\r\n  </ul>\r\n  <h2>\r\n    <em>Scenario 1:  Hiding attacker data</em>\r\n  </h2>\r\n  <p>During this scenario, the attacker uses an Alternate Data Stream to hide data that is useful for the attacker. This can occur when a J2EE application uses input taken from the client to create a new file, allowing the client to name the file that will be created at the server. Consider this code:</p>\r\n  <pre>response.setContentType(\"text/html;charset=UTF-8\");<br />PrintWriter out = response.getWriter();<br /><br />String filename = \"c:\\\\user_files\\\\\" +<br />      request.getParameter(\"filename\").toString();<br />String contents = request.getParameter(\"contents\").toString();<br /><br />File file = new File(filename);<br /><br />if(!file.exists())<br />{<br />      file.createNewFile();<br />      FileWriter fw = new FileWriter(file);<br />      BufferedWriter bw = new BufferedWriter(fw);<br />      bw.write(contents);    <br />      bw.close();<br />      fw.close();<br />}</pre>\r\n  <p>The code above uses the URL to request a filename and data from an Internet client.It creates a new file based on the <em>filename </em>URL parameter and writes the contents specified by the <em>contents</em> URL parameter to the new file.   For example, the following URL creates a file named <em>test.txt</em> in the output directory and writes the string <i>this is a test file</i> to the new file:</p>\r\n  <pre>http://some_site/example/createFile?filename=<strong>test.txt</strong>&contents=any\r\n</pre>\r\n  <p>The Windows <em>dir </em>command can be used to see what file was created:</p>\r\n  <pre>C:\\user_files&gt;dir /r<br /><br />12/02/2008  01:08 PM    &lt;DIR&gt;          .<br />12/02/2008  01:08 PM    &lt;DIR&gt;          ..<br />12/02/2008  01:08 PM                 3 test.txt </pre>\r\n  <p>Nevertheless, an attacker can exploit the above URL to create a file with an Alternate Data Stream to store secret attack data:</p>\r\n  <pre>http://some_site/example/createFile?filename=<strong>test.txt:hidden.txt</strong>&contents=attack_data</pre>\r\n  <p>The Windows <em>dir</em> command only shows a <em>test.txt.</em></p>\r\n  <pre>C:\\user_files&gt;dir /r<br /><br />12/02/2008  01:08 PM    &lt;DIR&gt;          .<br />12/02/2008  01:08 PM    &lt;DIR&gt;          ..<br />12/02/2008  01:08 PM                 3 test.txt \r\n  </pre>\r\n  <p>However, using the recursive flag shows the presence of an ADS named <em>hidden.txt:</em></p>\r\n  <pre>    C:\\user_files&gt;<strong>dir /r</strong><br /><br />12/02/2008  01:08 PM    &lt;DIR&gt;          .<br />12/02/2008  01:08 PM    &lt;DIR&gt;          ..<br />12/02/2008  01:10 PM                 3 test.txt<br />                                    11 <strong>test.txt:hidden.txt:$DATA</strong></pre>\r\n  <p>Furthermore, the Alternate Data Stream can be opened using Notepad:</p>\r\n  <pre>C:\\user_files&gt;notepad test.txt:hidden.txt\r\n</pre>\r\n  <p>In detail, the attack scenario follows these steps:</p>\r\n  <ol>\r\n    <li>The attacker finds an application functionality in which the application uses client-supplied input to create a new file. </li>\r\n    <li>The attacker passes the filename of an alternate data stream file to create the ADS hidden stream. </li>\r\n    <li>The attacker writes data to the ADS hidden stream.</li>\r\n  </ol>\r\n  <h2>\r\n    <em>Scenario 2: Disclosing application source code</em>\r\n  </h2>\r\n  <p>J2EE applications running in outdated versions of Windows and hosted by Internet Information Services (IIS) are vulnerable to source code disclosure.An attacker can access the application’s source code using the <i>Windows:DATA</i> Alternate Data Stream (ADS) which is the default data stream that Windows creates in all NTFS files.</p>\r\n  <p>The attack is possible due to older versions of IIS failing to prevent direct access to the <i>:$DATA</i> Alternate Data Stream.For example, IIS correctly prevented files with the <i>.jsp</i> extension to be accessed from the URL:</p>\r\n  <pre>http://some_site/default.jsp\r\n</pre>\r\n  <p>But allowed attackers to use the <i>:$DATA</i> ADS to access the contents of the source code file:</p>\r\n  <pre>http://some_site/<strong>default.jsp::$DATA</strong></pre>\r\n  <h1>\r\n    Step 2: Analyze Causes and Countermeasures\r\n  </h1>\r\n  <p>The second step in learning how to test for ADS attacks is to understand what causes the different attack variations and how to protect against them.This knowledge will help you identify ADS bugs in code and prepare you for executing the necessary test cases.</p>\r\n  <h2>\r\n    <em>Validating and sanitizing client input</em>\r\n  </h2>\r\n  <p>The first scenario, in which the application uses client-supplied input as a filename to create a new file, is a clear case of improper input validation and sanitization.In the case above, the J2EE application directly uses a URL parameter to create a text file without checking if the input is safe to use for a filename. Since the code lacks the proper input validation, the application allows attackers to create an Alternate Data Stream to hide attack data.</p>\r\n  <p>To protect against this attack variation, it is recommended to validate all input parameters used to create a new file using a <i>white list</i> approach. A white list consist of all the allowed file names and constructs to be used when creating the new file and can be implemented as a regular expression or string matching function.Before creating the file, the application must check if the parameters that will be used for the file creation are contained in or match the white list.Any parameters not contained in or matching the white list must be disallowed.  </p>\r\n  <h2>\r\n    <em>Windows and IIS version</em>\r\n  </h2>\r\n  <p>The source code disclosure scenario above is caused due to an NT IIS bug in older versions of Windows such as NT 4.0, 95, and 98.To protect against this variation, administrators must install the appropriate Microsoft patch or update Windows and IIS to a more recent version. For more information about the vulnerable Windows versions and patch download location, refer to Symantec's Security Focus incidence page <a href=\"http://www.securityfocus.com/bid/149\">http://www.securityfocus.com/bid/149</a>.</p>\r\n  <h1>\r\n    Step 3: Execute Test Cases\r\n  </h1>\r\n  <p>Now that you’ve reviewed the theoretical aspects of ADS bugs in J2EE applications, it is necessary to execute the appropriate test cases to check if your application is vulnerable.</p>\r\n  <h2>\r\n    <em>Test for ADS bugs by hiding attack data</em>\r\n  </h2>\r\n  <p>Follow these steps:</p>\r\n  <ol>\r\n    <li>Find an application’s functionality where client-supplied input is used to create and write to a file. </li>\r\n    <li>Supply a filename containing an ADS streams as input to the application such as <em>test.txt:hidden.txt</em>. </li>\r\n    <li>Verify if the application created the file with the ADS by executing <em>dir /r.</em></li>\r\n  </ol>\r\n  <p>Expected results: The application is vulnerable if it allows the creation of an Alternate Data Stream from client-supplied input.</p>\r\n  <h2>\r\n    <em>Test for ADS source code disclosure bugs</em>\r\n  </h2>\r\n  <p>Follow these steps:</p>\r\n  <ol>\r\n    <li>Open a Web browser. </li>\r\n    <li>Navigate to a JSP page by supplying a normal URL: <a href=\"http://some_site/default.jsp\">http://some_site/default.jsp</a></li>\r\n    <li>Enter a URL to the address bar that tries accessing the Windows:DATA stream of the JSP file: http://some_site/default.jsp::%DATA</li>\r\n    <li>Verify if the browser displays the source code of<em><strong> default.jsp</strong>.</em></li>\r\n  </ol>\r\n  <p>Expected results: The application is vulnerable if discloses the source code contained in <em>default.jsp.</em></p>\r\n  <h1>\r\n    Step 4: Fine-tune Test Case Data\r\n  </h1>\r\n  <p>Finally, it is suggested that you modify the test case data to allow for different URL encodings as well as double-encoding scenarios.Some characters necessary to insert additional ADS, such as the colon (:), might be disallowed by the application in their ASCII form but allowed in other encodings.</p>\r\n  <p>Try different encodings for an attack stream including:</p>\r\n  <p />\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          <strong>Test case data</strong>\r\n        </td>\r\n        <td>\r\n          <strong>Encoded test case data</strong>\r\n        </td>\r\n        <td>\r\n          <strong>Encoding</strong>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          test.txt:hidden.txt\r\n        </td>\r\n        <td>\r\n          test.txt%3Ahidden.txt\r\n        </td>\r\n        <td>\r\n          Hex/URL encoding\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          test.txt:hidden.txt\r\n        </td>\r\n        <td>\r\n          test.txt%253Ahidden.txt\r\n        </td>\r\n        <td>\r\n          Double encoding\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          default.asp::%DATA\r\n        </td>\r\n        <td>\r\n          default.asp%3A%3A%25DATA\r\n        </td>\r\n        <td>\r\n          Hex/URL encoding\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          default.asp::%DATA\r\n        </td>\r\n        <td>\r\n          default.asp%253A%253A%2525DATA\r\n        </td>\r\n        <td>\r\n          Double encoding\r\n        </td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <p>Note that additional encoding/decoding schemes might be in use.It is always useful to investigate the specifics encoding scheme used by the application to fine-tune the test case data appropriately.</p>\r\n  <h1>\r\n    Conclusions\r\n  </h1>\r\n  <p>Alternate Data Stream bugs affect applications running in NTFS and may allow attackers to hide attack data or disclose the application’s source code. To test for ADS bugs, it is suggested to start by understanding the attack scenarios involved as well as the causes and how to protect against them. Then you must execute the necessary test cases by submitting input containing an Alternate Data Stream in an attempt of hiding attack data or accessing the application’s source code.Finally, you must fine-tune test case data to cover additional encoding scenarios.<b><i></i></b></p>"
        ]
      }
    ]
  }
}