{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "267335713",
      "Content_Hash": "-1498584234"
    },
    "Metadata": [
      {
        "Id": [
          "6b3f9263-67f3-48fb-8247-c8a9a915ac03"
        ],
        "Id_History": [
          "6b3f9263-67f3-48fb-8247-c8a9a915ac03,b31ee531-7bea-47b5-9aa6-b6c696f4a6fb,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Network Credential Sniffing Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Network Credential Sniffing Vulnerabilities"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Summary ##\r\n\r\nNetwork credential sniffing attacks are network eavesdropping attacks where the attacker’s goal is to capture authentication packets in order to reveal data that might be used in an authentication scheme, such as username and password. Applications that don’t take the necessary measures to encrypt client credentials before transmitting them over the wire or to secure the connection through which authentication occurs are vulnerable to this attack.\r\n\r\nFollow these steps to test for network credential sniffing bugs:\r\n\r\n1. Understand attack scenarios\r\n2. Analyze causes and countermeasures\r\n3. Execute test cases \r\n\r\n## Step 1: Understand Attack Scenarios ##\r\n\r\nFirst, it is necessary to understand the different attack scenarios related to network credential sniffing bugs.\r\n\r\nA network credential sniffing attack starts with an attacker selecting a victim client that authenticates with an ASP .NET application by providing a username and password combination over the network. The next step is for the attacker to eavesdrop the network connection in order to monitor -or sniff- the authentication packets exchanged by the client and the application during login. The attacker chooses a specific network eavesdropping attack depending on the attacker’s access to the target network as well as the type of target network (hub-based, switch-based, etc.). Network eavesdropping attacks include but are not limited to:\r\n\r\n- Hub-based networks such as promiscuous mode sniffing\r\n- Switch-based networks attacks such as ARP poisoning or DHCP spoofing\r\n- WLANs attacks including attacks that require compromise of a wireless key\r\n- Attacks where the attacker sniffs packets from the Internet such as attacking a BGP router.\r\n\r\nNote that a credential sniffing attack is an extension of a network eavesdropping attack.   Thus, the attack scenario described here as well as the test cases in the testing section will not go into detail about network eavesdropping attack. To learn how to execute network eavesdropping attacks refer to Team Mentor’s article How to Test for Network Eavesdropping Bugs.\r\n\r\nWhile eavesdropping the target’s client connection, the attacker uses a network monitoring tool to capture and read the authentication packets. If the application doesn’t properly encrypt the connection, the attacker retrieves the client’s credentials in clear text or in weak encryption that can be broken later.\r\n\r\nHow to Test for Network Credential Sniffing Bugs:\r\n\r\n1. The attacker selects a target client.\r\n2. The attacker executes a network eavesdropping attack on the connection between the target client and the application.\r\n3. The attacker uses packet monitoring tool to capture authentication packets\r\n4. If the application is vulnerable, the attacker reads the client credentials in clear text or with weak encryption, which is trivial to break and recover the clear text. \r\n\r\n## Step 2: Analyze Causes and Countermeasures ##\r\n\r\nThere are different authentication schemes available to web applications. Applications that choose a weak authentication scheme such as basic or digest authentication are prone to network credential sniffing. The common authentication schemes available are: basic, digest, web forms, and authentication using a secure channel such as TLS or IPSec. \r\n\r\nBasic authentication sends the password as a base-64 encoded value which can be trivially decoded by attackers. Most web applications won’t use this authentication scheme for remote clients; however, applications might choose to use basic authentication for local network users. Digest authentication is more secure since it uses an MD5 hash with a nonce (number used once) to encrypt the password before sending it over the wire; nonetheless, digest authentication is only secure if properly configured and it can fall victim to man-in-the-middle (MitM) attacks where an attacker that is intercepting authentication packages can tell the client to use Basic authentication or legacy digest authentication.    \r\n\r\nWeb applications can also implement authentication using common HTML web forms. Here developers must add the necessary code to the application to ask for the client’s username and password and send the request to the application once the form is submitted. The username and password will travel in clear text unless the application encrypts the password before sending it to the server of if the authentication packet is sent over a secure connection such as TLS. To properly protect against network credential sniffing attacks applications must perform authentication through a secure channel. This means that before any authentication packets are exchanged between the client and the server, the client and server must establish an encrypted channel using public key encryption using digital certificates like those used in TLS, HTTPs, or through Kerberos authentication (integrated Windows Authentication through IIS). To properly protect against network credential sniffing attacks, applications must select one of the mentioned methods. \r\n\r\nNetwork credential sniffing attacks are possible because attackers are able to eavesdrop the connection between the target client and web applications. To mitigate the risk of eavesdropping attacks, network administrators can deploy security defenses at the network layer. For example, by properly deploying and configuring IPSec makes attacker unable to eavesdrop a connection. To defend against promiscuous mode sniffing administrators can execute tools that check for network interfaces running in promiscuous modes, or they can run a client application like Xarp to protect against ARP poisoning attacks in switched networks.  \r\n\r\n## Step 3: Execute Test Cases ##\r\n\r\nNow that you’ve learned the theoretical aspects of network credential sniffing bugs, it is necessary to execute the following test cases to check in your application is vulnerable.\r\n\r\n### Test for Network Credential Sniffing ###\r\n\r\nFollow these steps to test for network credential sniffing in ASP.NET applications.\r\n\r\n1. Select a target client\r\n2. Execute an eavesdropping attack between a client and a web application.\r\n3. Use network monitoring tools to check if credentials are transmitted in clear text.\r\n\r\nExpected results: the application is vulnerable if credentials are sent in clear text or using weak encryption. \r\n\r\n### Test for Secure Transport Layer ###\r\n\r\nAn additional test that is relevant to network credential sniffing testing is to check if authentication occurs over a secure transport layer such as TLS. In most cases, web browsers display a padlock (or any other comparable visual indicator) in the browser’s window if the connection is secure; however, there are cases where the lock doesn’t show so the tester must monitor authentication packets to check if they are really going over HTTPs.\r\n\r\nProper testing for a secure transport layer can be done by using an HTTP proxy tool and examining the URL of authentication requests. Execute the following steps to test for secure transport layer.\r\n\r\n1. Download a HTTP proxy tool and execute it.\r\n2. Open a web browser.\r\n3. Set web browser’s connection options to use HTTP proxy.\r\n4. Navigate to the web application login/authentication page.\r\n5. In the HTTP proxy, turn intercept option ON.\r\n6. In the web browser, enter username and password and make request.\r\n7. In the HTTP proxy, check if the authentication request’s URL is transmitted in plain-text.\r\n\r\nExpected results: The application is vulnerable if the request URL is made over plain HTTP and not HTTPS. If the application uses plain HTTP, the authentication request’s URL will start with http. The application is secure if the request URL is over HTTPS. If the application uses HTTPS, the authentication request’s URL will start https and it will contain the network port used by HTTPS (443 by default).\r\n\r\n## Conclusions ##\r\n\r\nWeb applications that don’t use strong encryption or a secure channel to transmit credentials over the network are vulnerable to credential sniffing attacks. To test for this vulnerability, it is recommended that you familiarize with the different attack scenarios involved as well as why this bug occurs and how to protect against it. Then you must execute practical test cases using network monitoring tools such as sniffers and tools necessary to execute network eavesdropping attacks. It is also recommended to double check the usage of a secure channel by intercepting and examining authentication packets using an HTTP client proxy tool. For unencrypted HTTP traffic, testers can use a network monitoring tool such as Wireshark."
        ]
      }
    ]
  }
}