{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1757210101",
      "Content_Hash": "-788187792"
    },
    "Metadata": [
      {
        "Id": [
          "6f4e927b-bd45-498b-95c4-78fd2c3287c1"
        ],
        "Id_History": [
          "6f4e927b-bd45-498b-95c4-78fd2c3287c1,b6a5547a-ae36-4be3-a1d3-bfd7263e06fe,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Integer Overflows in Java"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Integer Overflows in Java"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>J2EE applications and services</li>\r\n  </ul>\r\n  <h1>Summary</h1>\r\n  <p>During an integer overflow attack, an attacker exploits an unchecked arithmetic condition that leads the application to try to store in an integer variable a result larger than the maximum integer value. In the case of unsigned integers, the value of the integer variable wraps up to a small integer value; in the case of signed integers, the value of the integer variable wraps up to a negative integer value. In both cases, the target integer variable holds an incorrect value. In Java, attackers can use integer overflow bugs to execute logical attacks on the application. </p>\r\n  <p>Follow these steps to test for integer overflow bugs in Java:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Start testing and exploring </li>\r\n    <li>Step 4: Execute additional testing</li>\r\n  </ul>\r\n  <h1>Step 1: Understand Attack Scenarios</h1>\r\n  <p>First, it is necessary to understand the different integer overflow attack scenarios in Java. Although attackers commonly use integer overflows to execute buffer overrun or denial-of-service attacks in applications written in unmanaged code such as C/C++. Although these attacks are not possible in J2EE environments, attackers can exploit integer overflow conditions to execute logical attacks on J2EE applications.</p>\r\n  <p>In Java, attackers use integer overflow conditions to alter the logic of an application and force it into executing a logical path that benefits the attacker. This attack occurs when the application chooses an execution path based on the value of an integer operation, where at least one of the integers is user-accessible. An attacker who passes a large enough integer value might overflow the integer operation and store an incorrect integer value in the variable used by the application to determine its execution path.</p>\r\n  <p>A logical attack in which the application executes an unintended path can lead to consequences ranging from mild to severe. For example, an application may give the attacker a special offer or, in more severe examples, may deposit an incorrect sum of money in a bank account or may allow the attacker to bypass a security check. </p>\r\n  <p>The following code calculates a customer charge based on an integer provided in the URL below:</p>\r\n  <pre>http://example.com/example/calculateCharge?items=50</pre>\r\n  <p>The function below calculates the amount to withdraw from the customer’s bank account:</p>\r\n  <pre>protected void CalculateCharge()\r\n{\r\nint itemPrice = 50;\r\nint numberOfItems = Integer.parseInt(request.getParameter(\"items\"));\r\nint balance = 0;\r\n\r\nif (numberOfItems &gt; 0)\r\n{\r\nbalance = itemPrice * numberOfItems;\r\n}\r\nout.println(\"The customer account will be charged \" + balance);\r\n}</pre>\r\n  <p>If a client passes a normal number of items, such as 50, the balance is less than the maximum 32-bit signed integer (2147483647) and is correctly calculated: </p>\r\n  <pre>http://example.com/example/calculateCharge?items=50         (input)\r\nThe customer account will be charged 2500                   (output)</pre>\r\n  <p>However, an attacker can use the <em>items</em> parameter to pass a large integer, with the goal of overflowing the <em>balance</em> variable. As a result, the balance calculated exceeds the maximum integer and wraps to a negative value: </p>\r\n  <pre>http://example.com/example/calculateCharge?items=42949673   (input)\r\nThe customer account will be charged -2147483646            (output)</pre>\r\n  <p>This can result in the application attempting to make a huge deposit into the attacker’s bank account.</p>\r\n  <h1>Step 2: Analyze causes and countermeasures</h1>\r\n  <p>Next, before executing practical test cases, it is necessary in testing for integer overflows in Java code to understand what causes integer overflows in Java and how to protect against them.</p>\r\n  <p>Integer overflows happen when a Java application or servlet uses a client-supplied value in an integer operation without checking the input against the upper boundaries of the operation. For instance, in the scenario shown above, the application calculated the balance by getting the value of <em>numberOfItems</em> from a URL parameter.</p>\r\n  <pre>int balance = itemPrice * numberOfItems; </pre>\r\n  <p>The application checks the input against a negative value, but doesn’t check it against an upper boundary.  As a result, the attacker can pass an exceedingly large number, such as 42949673. </p>\r\n  <p>One method of preventing integer overflows in Java is to check any input integer values against a reasonable maximum. For instance, the code above could be corrected like this:</p>\r\n  <pre>if ((numberOfItems &gt; 0) && (numberOfItems &lt; 5000)\r\n{\r\nint balance = itemPrice * numberOfItems;\r\n}</pre>\r\n  <h1>Step 3: Start Testing and Exploring</h1>\r\n  <p>Now that you understand the attack scenarios for Java integer overflows as well as the causes and how to protect against them, it is necessary to continue by executing test cases and observing their behavior in your Java application or servlet.</p>\r\n  <p>Follow these steps to test for integer overflows:</p>\r\n  <ol>\r\n    <li>Identify an input variable that takes an integer variable. </li>\r\n    <li>Submit a small integer, such as 50. </li>\r\n    <li>Check how the application reacts. </li>\r\n    <li>Submit a large integer value (see Table 1). </li>\r\n    <li>Check how the application reacts.</li>\r\n  </ol>\r\n  <p>Expected result: If the application is vulnerable to an integer overflow, the results of checking how the application reacts in steps 3 and 5 will be different; the application will execute a different logic after submitting a large integer. </p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          Data type\r\n        </td>\r\n        <td>\r\n          Maximum value\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          int\r\n        </td>\r\n        <td>\r\n          2147483647\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          short\r\n        </td>\r\n        <td>\r\n          32767\r\n        </td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <p>\r\n    <b>Table 1 - Maximum integer values for integer-related types in Java</b>\r\n  </p>\r\n  <h1>Step 4: Execute Additional Testing</h1>\r\n  <p>The final step in testing for integer overflows is to execute additional testing based on variations in the attack scenarios.</p>\r\n  <p>An application might take a client-supplied integer and multiply it by a negative number or subtract it from an accumulated number. Consider the following code:</p>\r\n  <pre>int points = 5000;\r\nint penalized = Integer.parseInt(request.getParameter(\"penalized\"));\r\nint pointsPenalized = 10 * penalized;\r\nint totalPoints = points - pointsPenalized;\r\nout.println(\"The player's total points are: \" + totalPoints); </pre>\r\n  <p>An attacker can pass a large integer number in the <em>penalized</em> parameter in an attempt to change the total number of points penalized to a negative integer; if successful, the points penalized are added instead of subtracted. For example, the URL below subtracts 20 times 10 penalty points from the 5,000 points that the player has, leaving 4800 points:</p>\r\n  <pre>http://example.com/example/calculatePoints?penalized=20           (input)\r\nThe player's total points are: 4800                               (output)</pre>\r\n  <p>However, exploiting the integer overflow bugs results in adding more points to the player:</p>\r\n  <pre>http://example.com/example/calculatePoints?penalized=214748364    (input)\r\nThe player's total points are: 5080                               (output)</pre>\r\n  <h1>Conclusions</h1>\r\n  <p>Attackers exploit integer overflow bugs to execute logical attacks in Java applications. To test for them, it is first necessary to understand the attack scenarios as well what causes them, and how to protect against them. Then you must look for any input variable that takes a numeric value and execute test cases while observing how the application reacts, using both exceedingly large positive and negative values. </p>\r\n  <br />"
        ]
      }
    ]
  }
}