{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1559834734",
      "Content_Hash": "-569880904"
    },
    "Metadata": [
      {
        "Id": [
          "7497f1ef-a587-4772-be7a-c1fda766a7f8"
        ],
        "Id_History": [
          "7497f1ef-a587-4772-be7a-c1fda766a7f8,52cf51f4-e80f-4f33-86f0-fb505c9b3bf1,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Server-Side Code Injection"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Server-Side Code Injection"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>Summary</h1>\r\n  <p>ASP.NET applications are hosted by a web server capable of interpreting and executing server-side code such as Active Server Pages (ASP files). A server-side code injection bug occurs when an attacker is able to inject additional server-side code that is then interpreted and executed as part of the application’s code; for instance, when the application dynamically evaluates data sent by its clients. An attacker might be able to submit malicious code and have the ASP.NET application dynamically evaluate the injected code. Attackers can exploit server-side code injection bugs to execute logical attacks on ASP.NET applications.</p>\r\n  <p>Follow these steps to test for server-side code injection in ASP.NET applications:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Execute test cases&nbsp;</li>\r\n  </ul>\r\n  <h1>Step 1: Understand attack scenarios</h1>\r\n  <p>The first step in learning how to test for server-side code injection bugs is to understand well the anatomy of a server-side code injection vulnerability in ASP.NET.</p>\r\n  <p>It is important to understand the difference between client-side code injection and server-side code injection. Client-side code injection occurs when an attacker uses a vulnerable web application to execute remote code in the client’s browser context.&nbsp;This is why client-side code injection exploits such as cross-site scripting (XSS) as well as AJAX injection attacks are written in JavaScript; the victim client’s browser must be able to interpret the exploit code.&nbsp;Server-side code injection aims at having the application’s web engine (such as ASP, JSP, etc.) interpret and execute the malicious code as part of the application.&nbsp;This means that an attacker that successfully exploits a server-side code injection bug will add an extra application functionality that executes with the same privileges of the application’s code.&nbsp;</p>\r\n  <p>ASP.NET web applications that dynamically evaluate scripts might be vulnerable to this attack. Consider an application that uses the following code:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">&lt;%<br />&nbsp; &nbsp; If Not Request(\"Code\") = Nothing Then<br />&nbsp; &nbsp; &nbsp; &nbsp; Dim fso, f<br />&nbsp; &nbsp; &nbsp; &nbsp; 'User input Code is written to a file named input.aspx<br />&nbsp; &nbsp; &nbsp; &nbsp; fso = CreateObject(\"Scripting.FileSystemObject\")<br />&nbsp; &nbsp; &nbsp; &nbsp; f = fso.OpenTextFile(Server.MapPath(\"input.aspx\"), 8, True)<br />&nbsp; &nbsp; &nbsp; &nbsp; f.Write(Request(\"Code\") & vbCrLf)<br />&nbsp; &nbsp; &nbsp; &nbsp; f.close()<br />&nbsp; &nbsp; &nbsp; &nbsp; f = Nothing<br />&nbsp; &nbsp; &nbsp; &nbsp; fso = Nothing<br /><br />&nbsp; &nbsp; &nbsp; &nbsp; 'input.aspx is executed<br />&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Server.Execute(\"input.aspx\")<br />&nbsp; &nbsp; Else<br />%&gt;<br />&lt;form&gt;<br />&lt;input name=\"Code\" size=\"100px\" /&gt;&lt;input type=\"submit\" name=\"Enter code\" /&gt;<br />&lt;/form&gt;<br />&lt;%<br />End If<br />%&gt;</font>\r\n  </p>\r\n  <p>The application dynamically evaluates the input data entered in the <i>Code</i> web form parameter. As a result, an attacker can pass malicious code that will be executed by the application at the server-side.</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>The attacker discovers an application functionality where client supplied input is dynamically evaluated and executed. </li>\r\n    <li>The attacker passes malicious code as input so that the application executes it at the server-side.&nbsp;</li>\r\n  </ol>\r\n  <h1>Step 2: Analyze Causes and Countermeasures</h1>\r\n  <p>The following step in learning how to test for server-side code injection bugs is to understand what causes this attack and how to protect against it.&nbsp; </p>\r\n  <p>Server-side code injection in ASP.NET applications is possible due to dynamic code evaluation vulnerabilities. A dynamic code evaluation vulnerability occurs when the application uses client-supplied input for code evaluation and execution without doing proper input validation and sanitization. For example, in the previous scenario the application blindly constructs an input text file and, without checking for malicious code, invokes the <i>Server.Execute</i> function to evaluate and execute the newly created text file.</p>\r\n  <p>To protect against this bug, ASP.NET must properly validate any data before using it for dynamic evaluation such as when executing functions of the <i>Server.Execute</i> family.&nbsp;Developers are encouraged to create a <i>white list </i>containing a list of the valid data and code constructs. The application must then check that all parameters used in the dynamic evaluation appear in the white list and reject any input data that is not white-listed.&nbsp;</p>\r\n  <h1>Step 3: Execute Test Cases</h1>\r\n  <p>Now that you’ve reviewed the theoretical aspects of server-side code injection bugs in ASP.NET it is necessary to execute the necessary test cases to check if your application is vulnerable.</p>\r\n  <h2>\r\n    Test for Server-side code injection in ASP .NET\r\n  </h2>\r\n  <p>Follow these steps:</p>\r\n  <ol>\r\n    <li>Discover a functionality in the application that performs dynamic code evaluation based on client supplied input. </li>\r\n    <li>Pass a small proof-of-concept ASP.NET code as input such as:<br /><font face=\"'Courier New'\">&lt;% Response.Write(\"Application is vulnerable\") %&gt;</font></li>\r\n    <li>Observe how the application reacts to the injected code.</li>\r\n  </ol>\r\n  <p>Expected results: The application is vulnerable if it evaluates and executes the code passed in step 2 and displays the message <i>Application is vulnerable.</i>&nbsp;</p>\r\n  <h1>Conclusions</h1>\r\n  <p>Server-side code injection bugs allow attackers to inject code that will be executed by the ASP.NET engine that hosts the vulnerable application.&nbsp;Attackers can use server-side code injection to execute logical attacks on the target application. To learn how to test for this vulnerability it is necessary to understand its attack scenario and how it is possible in ASP.NET applications, as well as how to protect against it.&nbsp;Testing for this bug requires passing a small proof-of-concept code as input to the application under test while observing how the application reacts.</p>"
        ]
      }
    ]
  }
}