{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-987390888",
      "Content_Hash": "-1070041103"
    },
    "Metadata": [
      {
        "Id": [
          "74fae691-e3c7-4063-a0ef-978be364ca32"
        ],
        "Id_History": [
          "74fae691-e3c7-4063-a0ef-978be364ca32,4996fbef-7ac9-40a6-982d-31b121e85b35,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "How to Use PermCalc To Calculate Permissions"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Use PermCalc To Calculate Permissions"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Description</h1>\n  <p>You use the permission calculator tool (also known as the minimum grant set determination tool) to calculate the code access security permissions that callers must be granted to access the public entry points of an assembly. To use Permcalc.exe, specify the assembly name to analyze together with any dependent assemblies. </p>\n  <p>The following command reports the minimum permissions that the Myapp.exe application needs to run. It displays the output in the default viewer for XML files. The target file is Myapp.exe, and the dependent files are Mydep1.dll and Mydep2.dll. </p>\n  <pre>Permcalc.exe -sandbox -show myapp.exe mydep1.dll mydep2.dll </pre>\n  <p>The <b>-sandbox </b>switch reports the minimum-permission sandbox in which an application can run instead of the permissions required by callers of the assembly's entry points. The <b>-show</b> switch displays the output file when the calculations are complete. </p>\n  <p>The following command reconstructs all cache files and includes call stacks for the Mylib.dll assembly. It displays the output in the default viewer for XML files. </p>\n  <pre>Permcalc.exe -cleancache -stacks -show mylib.dll </pre>\n  <p>In situations where exact permission values cannot be determined, the default behavior of the tool is to overestimate by using an unrestricted permission state. The following options can be helpful in such situations. Use the <b>-Internet</b> switch to cause the Internet zone permissions to be used as an estimate. Use the <b>-Under</b> switch to override default behavior and to force an underestimation of the permissions. </p>\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}