{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-990449233",
      "Content_Hash": "2053040956"
    },
    "Metadata": [
      {
        "Id": [
          "8eb90816-0d3c-4826-89d6-e83f0c298405"
        ],
        "Id_History": [
          "8eb90816-0d3c-4826-89d6-e83f0c298405,2bff1951-c556-454f-8c68-3c516e8656d9,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "How to Use Code Access Security"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Use Code Access Security"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Description</h1>\r\n  <p>You can use code access security to restrict what your code can do, to restrict which code can call your code and to create a restricted execution environment for untrusted code like plug-ins. </p>\r\n  <p>For example, in hosted environments, you can use ASP.NET code access security policy to isolate applications from one another and from accessing shared system resources. Restricting what code can do is also useful when you need to run untrusted code, such as third-party components and plug-ins.&nbsp; </p>\r\n  <p>You can use permission demands to help ensure that only code with the appropriate permissions can call your code. </p>\r\n  <p>You do not need to be concerned with code access security if your code is locally installed because code installed on a computer runs with full trust. Code access security is applicable in the following scenarios: </p>\r\n  <ul>\r\n    <li>Using ClickOnce to deploy and execute applications. <li>Running partial trust ASP.NET Web applications, for example on hosted servers. <li>Running managed controls inside Internet Explorer. <li>Running code from an intranet file share. <li>Running code inside a Microsoft Office application. <li>Developing a class library to be used by other applications, including partial trust applications.</li></li></li></li></li></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}