{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1421698600",
      "Content_Hash": "-485705728"
    },
    "Metadata": [
      {
        "Id": [
          "8f8a4bbd-5504-4860-b68f-81ab7b273565"
        ],
        "Id_History": [
          "8f8a4bbd-5504-4860-b68f-81ab7b273565,00bc5e6f-db34-4c45-be6e-8d409c7a54c7,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "How to Perform A Security Architecture And Design Review"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Perform A Security Architecture And Design Review"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Description</h1>\n  <p>To perform security-focused architecture and design reviews, you need to consider three major elements:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Deployment and infrastructure.</strong> Review the design of your application as it relates to the target deployment environment and the associated security policies. Consider the constraints imposed by the underlying infrastructure-layer security and the operational practices in use. </p>\n      <li>\n        <p>\n          <strong>Security frame.</strong> Review the security approach that was used for the critical areas of your application. An effective way to do this is to focus on the set of categories that have the most impact on security, particularly at an architectural and design level, and where mistakes are most often made. These include authentication, authorization, input validation, exception management, and other areas. Use a patterns-based security frame as a roadmap, which will enable you to perform reviews consistently and to make sure that you do not miss any important areas during the review. </p>\n        <li>\n          <p>\n            <strong>Layer-by-layer analysis.</strong> Review the logical layers of your application, and evaluate your security choices in your presentation, business, and data-access logic.</p>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}