{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "242767847",
      "Content_Hash": "-873125962"
    },
    "Metadata": [
      {
        "Id": [
          "9a8216b0-46ec-49e0-88f7-5a1ca50a5f96"
        ],
        "Id_History": [
          "9a8216b0-46ec-49e0-88f7-5a1ca50a5f96,a0e2df41-ea6e-40bc-bfaa-d77774383919,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Memory Sniffing Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Memory Sniffing Vulnerabilities"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\r\n    <span>Applies To</span>\r\n  </h1>\r\n  <ul>\r\n    <li>All software applications&nbsp;</li>\r\n  </ul>\r\n  <h1>\r\n    <span>Summary</span>\r\n  </h1>\r\n  <p>Applications must store sensitive data such as passwords or cryptographic values in system memory in order to properly operate. However, secrets may be stored in memory that is accessible to an attacker or swapped out of memory and into swaps files. During this attack, the attacker sniffs the different types of memory available, including random access memory (RAM), virtual memory, dump files, and swap files in an attempt to recover sensitive information such as passwords or cryptographic keys.</p>\r\n  <p>It is recommended that you follow these steps in order to test for this bug:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Start testing and exploring </li>\r\n    <li>Step 4: Execute additional testing<b>&nbsp;</b></li>\r\n  </ul>\r\n  <h1>\r\n    <span>Step 1: Understand attack scenarios</span>\r\n  </h1>\r\n  <p>First, it is necessary to properly understand the types of temporary memory related to this vulnerability:</p>\r\n  <ul>\r\n    <li>RAM - physical memory that stores data used by running processes. </li>\r\n    <li>Virtual memory - logical address space given by the system to each running process. It gets copied into random access memory and swapped out to swap files by the operating system. </li>\r\n    <li>Swap files - RAM’s auxiliary storage. The operating system performs paging to swap the contents of RAM in and out of swap files. </li>\r\n    <li>Memory dumps - Memory dumps are snapshots of a process’s virtual memory; they are created by the system when the process crashes.&nbsp;</li>\r\n  </ul>\r\n  <p>Note that permanent storage of user files, databases, and the Windows registry is outside of the scope of this vulnerability. Permanent memory can be protected using permissions and relate to information disclosure attacks.</p>\r\n  <p>Memory sniffing bugs commonly relate to local attacks requiring access to the target computer. Once the attacker is logged in, he uses a tool to recover sensitive data such as passwords or keys from temporary memory.</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>Attacker logs in to target machine.* </li>\r\n    <li>Attacker uses a script or tool to search memory for sensitive data. The attack ends if sensitive data is recovered is an unhashed/unencrypted form. </li>\r\n    <li>If sensitive data is hashed or encrypted, the attacker uses a cryptographic attack to recover sensitive data in plain-text.</li>\r\n  </ol>\r\n  <p>* Variations of this attack focus on capturing sensitive information without access to the target machine. For instance, forensic research shows that the contents of a computer’s RAM can be retrieved through a FireWire cable. Furthermore, recent discoveries indicate that sensitive information from DRAM chips can be restored by removing them after the computer has been turned off.&nbsp;</p>\r\n  <h1>\r\n    <span>Step 2: Analyze Causes and Countermeasures</span>\r\n  </h1>\r\n  <p>The next step in testing for memory sniffing is to understand what causes this vulnerability and how to countermeasure it.</p>\r\n  <h2>\r\n    <span>Clearing data structures containing sensitive information </span>\r\n  </h2>\r\n  <p>A classic approach to protect against memory sniffing attacks is to clear data structures, such as arrays, used to temporarily store sensitive information. For instance, the code below is insecure:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">void GetData(char *MFAddr) {&nbsp;<br />&nbsp;char pwd[64];<br />&nbsp; if (GetPasswordFromUser(pwd, sizeof(pwd))) {<br />&nbsp; &nbsp; if (ConnectToMainframe(MFAddr, pwd)) {<br />&nbsp; &nbsp; // Interaction with mainframe<br />&nbsp; &nbsp; }<br />&nbsp; }<br />}</font>\r\n  </p>\r\n  <p>The function <i>GetPasswordFromUser</i> copies a password provided by the user to the <i>pwd</i> character array. The application then returns from the function without cleaning the password from memory. To mitigate this attack, developers are encouraged to set the memory contents to zero after the process is done with the structure used to store it:&nbsp;</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">void GetData(char *MFAddr) {&nbsp;<br />&nbsp;char pwd[64];<br />&nbsp; if (GetPasswordFromUser(pwd, sizeof(pwd))) {<br />&nbsp; if (ConnectToMainframe(MFAddr, pwd)) {<br />&nbsp; &nbsp; // Interaction with mainframe<br />&nbsp; &nbsp; }<br />&nbsp; }<br />&nbsp;&nbsp;memset(pwd, 0, sizeof(pwd));<br />}</font>\r\n  </p>\r\n  <p>However, it is extremely important to know that <i>memset</i> might not work as intended if compiler optimizations are on. Make sure to turn off compiler optimizations if protecting your code using <i>memset</i> as shown above.</p>\r\n  <p>Another way of clearing out memory is by traversing the array and setting each element to zero:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">void erase_string(char *s) {<br />&nbsp;while(*s) { *s++ = 0; }<br />}</font>\r\n  </p>\r\n  <p>This technique is recommended, because it doesn’t depend on compiler optimizations or knowledge of the array’s size. To properly secure your application, it is suggested that you add similar zeroing-out techniques after returning from function calls that deal with sensitive data and also in every destructor of classes that deal with secrets such as passwords and cryptographic elements.</p>\r\n  <h2>\r\n    <span>\r\n      Locking sensitive memory \r\n    </span>\r\n  </h2>\r\n  <p>Zeroing out sensitive memory is an effective technique to keep sensitive data in virtual memory (and consequently in RAM and swap files) as briefly as possible. However, this data might still get swapped by the operating system’s paging system into swap files before the application has a chance to clean it, increasing the risk of harm from a memory sniffing attack. </p>\r\n  <p>It is possible to mitigate this condition by locking virtual address pages from being swapped. This can be achieved in the UNIX platforms by using <i>mlock</i> as below:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">#include &lt;sys/mman.h&gt;<br /><br />void *locking_alloc(size_t numbytes){<br />&nbsp; static short have_warned = 0;<br />&nbsp; void *mem = malloc(numbytes);<br /><br />&nbsp; if(mlock(mem, numbytes) && !have_warned) {<br />&nbsp;\t\t/* We probably do not have permission.<br />&nbsp; &nbsp;* Sometimes, it might not be possible to lock enough memory.<br />&nbsp; &nbsp;*/<br />&nbsp; fprintf(stderr, \"Warning: Using insecure memory!\\n\");<br />&nbsp; have_warned = 1;<br />&nbsp;}&nbsp;<br />&nbsp;return mem;<br />}</font>\r\n  </p>\r\n  <p>\r\n    <span>\r\n      In Windows, the Win32 API <i>VirtualLock </i>is used for the same purpose.\r\n    </span>\r\n  </p>\r\n  <h2>\r\n    <span>\r\n      Disable the creation of dump files\r\n    </span>\r\n  </h2>\r\n  <p>An attacker might execute a memory sniffing attack by crashing an application and accessing the core dumps created by the system upon the crash. Any sensitive data loaded by the application into any data structure will appear in dump files for the attacker to leverage. To mitigate this condition, processes must disable the creation of dump files right from the start. This is achieved using the <i>setrlimit</i> API both in UNIX and Windows platforms:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">char pwd[MAX_PWD_LEN];<br />if(setrlimit(RLIMIT_CORE, 0) != 0) {<br />&nbsp;/* deal with error */<br />}<br />fgets(pwd, MAX_PWD_LEN, stdin);</font>\r\n  </p>\r\n  <h2>\r\n    <span>\r\n      Additional countermeasures\r\n    </span>\r\n  </h2>\r\n  <p>Additional defenses against memory sniffing attacks include deleting the page file on reboot or shutdown (this can be done by setting a registry value in Windows), and using forensic tools to scrub all different types of system memory. In addition, research is moving towards encrypting the contents of RAM and swap files and storing the encryption key in hardware.</p>\r\n  <h1>\r\n    <span>Step 3: Start Testing and Exploring</span>\r\n  </h1>\r\n  <p>Now that you understand the basic theory behind memory sniffing attacks, it is necessary to execute practical test cases to check if your application is vulnerable. If you have implemented countermeasures, it is important to execute these tests before and after adding the countermeasures to test their effectiveness.</p>\r\n  <h2>\r\n    <span>\r\n      Test for sensitive data in RAM\r\n    </span>\r\n  </h2>\r\n  <p>In Windows platforms, follow these steps to create a record of physical memory in a text file:</p>\r\n  <ol>\r\n    <li>Log into a Windows host running the application under test. </li>\r\n    <li>Download and install ManTech’s <i>Memory DD</i> from&nbsp;<a href=\"https://sourceforge.net/projects/mdd/)\">https://sourceforge.net/projects/mdd/)</a></li>\r\n    <li>Open command prompt with administrative privileges. </li>\r\n    <li>Run <i>mdd </i>as follows: <font face=\"'Courier New'\">mdd_1.3.exe -o c:\\ram.txt -v</font></li>\r\n    <li>Once <i>mdd</i> finishes executing, read output file<i> ram.txt</i> for sensitive information.</li>\r\n  </ol>\r\n  <p>Expected results: <i>ram.txt</i> must not show any sensitive data.</p>\r\n  <h2>\r\n    <span>\r\n      Test for sensitive data in virtual memory\r\n    </span>\r\n  </h2>\r\n  <p>The best way to search your application’s virtual memory for secrets is to use a debugger to create a dump of the virtual memory space at any given time:</p>\r\n  <ol>\r\n    <li>Log into a Windows host running the application under test. </li>\r\n    <li>Download and run user-mode Windows debugging <i>windbg.</i></li>\r\n    <li>Attach <i>windbg </i>to the application under test. </li>\r\n    <li>Break into the debugger and specify the option to create a full dump for the application’s virtual memory:<font face=\"'Courier New'\"> .dump /f c:\\dump.txt</font></li>\r\n  </ol>\r\n  <p>Expected results: <i>dump.txt</i> must not show any sensitive data.</p>\r\n  <h2>\r\n    <span>\r\n      Test for sensitive data in swap files\r\n    </span>\r\n  </h2>\r\n  <p>In Windows, swap files are stored in the <i>pagefile:</i></p>\r\n  <ol>\r\n    <li>Log into a Windows host running the application under test. </li>\r\n    <li>Find pagefile<i>. </i>It is named <i>pagefile.sys</i> and is usually on the root drive of the Windows partition (i.e. <i>c:\\pagefile.sys</i>). </li>\r\n    <li>Open read-only copy of a file. </li>\r\n    <li>Search for sensitive information in pagefile.</li>\r\n  </ol>\r\n  <p>Expected results: pagefile must not show sensitive information.</p>\r\n  <h2>\r\n    <span>\r\n      Test for sensitive data in dump files\r\n    </span>\r\n  </h2>\r\n  <p>Follow these steps test for sensitive information in dump files:</p>\r\n  <ol>\r\n    <li>Log into a Windows host running the application under test. </li>\r\n    <li>Find the dump files (in Windows, this is indicated in <i>HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\CrashControl</i>). </li>\r\n    <li>Open a dump file and search for sensitive information. </li>\r\n    <li>Repeat for each of the dump files</li>\r\n  </ol>\r\n  <p>Expected results: dump files must not show sensitive information.&nbsp;</p>\r\n  <h1>\r\n    <span>Step 4: Execute Additional Testing</span>\r\n  </h1>\r\n  <p>If the sensitive data cannot be easily recognized, you must do additional testing. During each of the tests above, the attacker needs to interpret the output. Running each of the tools creates an output file with a large quantity of data that is irrelevant to the test. A good way to find secrets is running a command such <i>strings</i> on the output file in order to display all character arrays in the file:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">C:\\Documents and Settings\\All Users\\Documents\\DrWatson&gt;strings user.dmp<br />12<br />…<br />kernel32.dll<br />RASAPI32<br />C:\\WINNT\\tracing<br />C:\\Documents and Settings\\Administrator\\My Documents\\PGP\\pubring.pkr<br />C:\\Documents and Settings\\Administrator\\My Documents\\PGP\\secring.skr<br />& !<br />IN PGP MESSAGE-----<br />Version: PGP 7.1<br />qANQR1DBwU4DSL6Q3OHRwOYQB/9pKnnhZGQRFwykWzBO1EWkzW336QOkUaHj0aVj<br />P1MgxDWQWi3kZpOfGnDg6kbQriWBiIgD/z8p5xGN+WcksytlLJv8OxvTGMepx7u8<br />h5aVRXZd8YPM+h5ROpbnNw+SiT/w9oCy/ChWeiCHV1swQSzwBHx2Ye+yxO70Moxc<br />...<br />frAG3nM7kOnChQp4jxhv2J0p7fL1vteI9EGbcimC9QCVBwC1U++mQIqbTyIw5gWK<br />Io11yl8P+wKjcHsLfi2hTE+NIRb+VORWhVoCDHgNKV1nSFNTK0LEnvz84OFyRc1z<br />-----END PGP MESSAGE-----<br />&lt;pgppassphrase!&gt;<br />…&nbsp;</font>\r\n  </p>\r\n  <p>Hex editors and similar low-level file processing tools must be used to identify sensitive data. Additional techniques include performing dictionary or linear searches.&nbsp;</p>\r\n  <h1>\r\n    <span>Conclusions</span>\r\n  </h1>\r\n  <p>Memory sniffing attacks aim at recovering sensitive data in system memory, including virtual memory, RAM, and swap files.In order to properly test for this bug, it is necessary to understand the anatomy of the attack scenario as well as why it is caused and how to protect against it.Then, you must use a set of available tools to check for it in your application by making records of the different types of memory and searching them for sensitive data.</p>"
        ]
      }
    ]
  }
}