{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-42195147",
      "Content_Hash": "1403788136"
    },
    "Metadata": [
      {
        "Id": [
          "a32f619f-9507-4260-8ab6-7f5e987f4c27"
        ],
        "Id_History": [
          "a32f619f-9507-4260-8ab6-7f5e987f4c27,8b4dc2b9-62b4-4685-ab26-eaa238523977,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for HTTP Response Splitting Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for HTTP Response Splitting Vulnerabilities"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "Andres De Vivanco"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* Web applications and services\r\n\r\n\r\n## Summary ##\r\n\r\nHTTP response splitting bugs are a relatively rare vulnerability class that allows an attacker to control the response of a vulnerable web server by splitting it and adding an additional response. Attackers use the additional response to perform different types of attacks such as cross user defacement, web cache poising, and cross site scripting (XSS). \r\n\r\nHTTP response splitting vulnerabilities involve three common parties: the attacker, the vulnerable web server, and the target. The attacker uses the vulnerable server to carry the attack on the target. The target is usually an Internet browser client (in cases of XSS and cross user defacement) or a cache server (in cases of cache poisoning).\r\n\r\n## Step 1: Understand Attack Scenarios ##\r\n\r\nThe first step in testing for HTTP response splitting vulnerabilities is to understand their attack scenarios. There are two common scenarios to execute an HTTP response splitting attack:\r\n\r\n* HTTP response splitting using redirect.\r\n* HTTP response splitting by exploiting header construction.\r\n\r\n\r\nIn addition, HTTP response splitting vulnerabilities can be used for any of the following payloads:\r\n\r\n* Cross user defacement\r\n* Cross-site scripting (XSS)\r\n* Web cache poisoning\r\n* Page hijacking \r\n\r\n\r\n### Scenario 1: HTTP response splitting using redirect ###\r\n\r\nThe first and most popular response splitting attack targets an Internet client browser and uses a redirect to accomplish the attack. In order to understand this scenario you must understand how a redirect works. A simple PHP redirect page (redirect.php) looks like this:\r\n\r\n~~~~\r\n<?php\r\n    header (\"Location: \" . $_GET['page']);\r\n?>\r\n~~~~\r\n\r\nThe following link redirects an Internet browser client to www.yahoo.com:\r\n\r\n~~~~\r\nhttp://vulnsite.com/redirect.php?page=http://www.yahoo.com\r\n~~~~\r\n\r\nWhen the client clicks on the link above, the browser sends the following request to the server:\r\n\r\n~~~~\r\nGET http://vulnsite.com/redirect.php?page=http://www.yahoo.com HTTP/1.1\r\nHost: vulnsite.com\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 6.0; es-ES; rv:1.8.1.14) Gecko/20080404 Firefox/2.0.0.14\r\nAccept: text/xml,application/xml,application/xhtml+xml,text/html;q=0.9,text/plain;q=0.8,image/png,*/*;q=0.5\r\nAccept-Language: es-es,es;q=0.8,en-us;q=0.5,en;q=0.3\r\nAccept-Encoding: gzip,deflate\r\nAccept-Charset: ISO-8859-1,utf-8;q=0.7,*;q=0.7\r\nKeep-Alive: 300\r\nProxy-Connection: keep-alive\r\n~~~~\r\n\r\nThe redirect in the server responds with the following packet indicating the client that the resource has been moved:\r\n\r\n~~~~\r\nHTTP/1.1 302 Found\r\nDate: Tue, 13 May 2008 20:22:28 GMT\r\nServer: Apache/2.2.6 (Win32) PHP/5.2.5\r\nX-Powered-By: PHP/5.2.5\r\nLocation: http://www.yahoo.com\r\n~~~~\r\n\r\nThe client then sends a request to the address specified by the Location header:\r\n\r\n~~~~\r\nGET http://www.yahoo.com:80/ HTTP/1.1\r\nHost: www.yahoo.com\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 6.0; es-ES; rv:1.8.1.14) Gecko/20080404 Firefox/2.0.0.14\r\nAccept: text/xml,application/xml,application/xhtml+xml,text/html;q=0.9,text/plain;q=0.8,image/png,*/*;q=0.5\r\nAccept-Language: es-es,es;q=0.8,en-us;q=0.5,en;q=0.3\r\nAccept-Encoding: gzip,deflate\r\nAccept-Charset: ISO-8859-1,utf-8;q=0.7,*;q=0.7\r\n~~~~\r\n\r\nDuring an HTTP response splitting attack the attacker sends a malicious link that will originate an additional response:\r\n\r\n~~~~\r\nhttp://vulnsite.com/redirect.php?page=abc%0d%0aContent-Length:%200%0d%0a%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2047%0d%0a%0d%0a<html><font%20color=red>Attacked!!!</font></html>\r\n~~~~\r\n\r\nThe injected data can also be written like this:\r\n\r\n~~~~\r\nabc\\r\\n\r\nContent-Type: text/html\\r\\n\r\n\\r\\n\r\nHTTP/1.1 200 OK\\r\\n\r\nContent-Type: text/html\\r\\n\r\n\\r\\n\r\n<html><font color=red>Attacked!!!</font></html>\r\n~~~~\r\n\r\nNow, when the client clicks on the malicious link above, the browser sends the following request to the server:\r\n\r\n~~~~\r\nGET http://vulnsite.com/redirect.php?page=abc%0d%0aContent-Length:%200%0d%0a%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2047%0d%0a%0d%0a<html><font%20color=red>Attacked!!!</font></html>\r\n\r\nHost: vulnsite.com\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 6.0; es-ES; rv:1.8.1.14) Gecko/20080404 Firefox/2.0.0.14\r\nAccept: text/xml,application/xml,application/xhtml+xml,text/html;q=0.9,text/plain;q=0.8,image/png,*/*;q=0.5\r\nAccept-Language: es-es,es;q=0.8,en-us;q=0.5,en;q=0.3\r\nAccept-Encoding: gzip,deflate\r\nAccept-Charset: ISO-8859-1,utf-8;q=0.7,*;q=0.7\r\nKeep-Alive: 300\r\nProxy-Connection: keep-alive\r\n~~~~\r\n\r\nThe server responds with the following two packets instead of one. The server responds like this because it parses the double CR/LF after the Content - Length into a separate packet:\r\n\r\n~~~~\r\nHTTP/1.1 302 Found\r\nDate: Tue, 13 May 2008 20:22:28 GMT\r\nServer: Apache/2.2.6 (Win32) PHP/5.2.5\r\nX-Powered-By: PHP/5.2.5\r\nLocation: abc\r\nContent-Length: 0\r\n~~~~\r\n\r\n~~~~\r\nHTTP/1.1 200 OK                    (separate packet)\r\nContent-Type: text/html\r\nContent-Length: 47\r\n<html><font color=red>Attacked!!!</font></html>\r\n~~~~\r\n\r\nThe target browser now displays a page that says \"Attacked!!!\". The attacker can select more complex pages to use during the defacement such as a page that phishes for bank accounts or a cross-site scripting script that sends the victim’s session cookie to an attacker’s site.   \r\n\r\n\r\n### Scenario 2: HTTP response splitting by exploiting header construction ###\r\n\r\nDuring this scenario the attacker doesn’t need a redirect page. Many applications build response headers such as Set-Cookie or Location by reading data from a temporary store such as a URL parameter or a permanent store such as database. For example the following Java code sets a cookie by reading an ID value from a database:\r\n\r\n~~~~\r\nSqlCommand sqlComm = new SqlCommand(\"SELECT userid FROM users WHERE username LIKE \" + Request.QueryString[\"user\"], sqlConn);\r\nSqlDataReader sqlReader = sqlComm.ExecuteReader();\r\nstring userid = sqlReader.GetString(\"userid\");\r\nCookie cookie = new Cookie(\"ID\", userid);\r\nresponse.addCookie(cookie); \r\n~~~~\r\n\r\nIf the user id has a normal value such as 10-300-565 the server sends a single response to the user.\r\n\r\n~~~~\r\nHTTP/1.1 200 OK\r\n...\r\nSet-Cookie: id=10-300-565\r\n...\r\n~~~~\r\n\r\nHowever, the attacker can force the server to send additional responses by adding a double CR/LF to the database record :\r\n\r\n~~~~\r\n10-300-5650d%0a%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2047%0d%0a%0d%0a<html><font%20color=red>Attacked!!!</font></html>\r\n~~~~\r\n\r\nForcing the server to reply like this:\r\n\r\n~~~~\r\nHTTP/1.1 200 OK\r\n...\r\nSet-Cookie: id=10-300-565\r\nContent-Length: 0\r\n~~~~\r\n~~~~\r\nHTTP/1.1 200 OK                    (separate packet)\r\nContent-Type: text/html\r\nContent-Length: 47\r\n<html><font color=red>Attacked!!!</font></html>\r\n~~~~\r\n\r\n\r\n### Payload 1:  Phishing ###\r\n\r\nThis payload is seen in the previous two scenarios and consists of sending an additional page to the victim. The goal is trick victims into believing that the second response is legitimate and that they are safely browsing the original site. The attacker then modifies the second response for specific phishing purposes such a retrieving a username and password or a bank account and PIN number. The target browser parses the second response and it appears to the web client as if this response is coming from a legitimate server.  The attack data used for this payload shows a second page (as seen above):\r\n\r\n~~~~\r\n0d%0a%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2047%0d%0a%0d%0a<html><font%20color=red>Attacked!!!</font></html>     \r\n~~~~\r\n\r\n\r\n### Payload 2:  Cross site scripting ###\r\n\r\nIn response splitting vulnerabilities the second response is absolutely controlled by the attacker. The attacker can sent a split page with a script that executes in the context of victim. This leads to a cross-site scripting attack (XSS). The attack data may look like this:\r\n\r\n~~~~\r\n0d%0a%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2052%0d%0a%0d%0a<html><script>alert('document.cookie')</script></html>\r\n~~~~\r\n\r\nThe payload of this attack is relatively harmless, just an alert box. More advanced payloads would include sending session credentials to a site controlled by the attacker.\r\n\r\n\r\n### Payload 3: Web cache poisoning ###\r\n\r\nThis popular scenario doesn’t target an Internet browser client; its targets are web cache servers. The attacker makes the first request through the web cache server and receives the two split packets. The attacker then sends a second request to any resource. The cache server will match the second request with the split response (controlled by the attacker). This will propagate the attack to any users of the web cache server. The attack string manipulates cache-related headers:\r\n\r\n~~~~\r\n%0d%0aContent-Type: text/html%0d%0a%0d%0aHTTP/1.1 200 OK%0d%0aLast-Modified: Wed, 13 Jan 2010%0d%0aContent-Type: text/html%0d%0a%0d%0a<html><font color=red>hey</font></html>\r\n~~~~\r\n\r\nThe scenario follows these steps:\r\n\r\n1. Attacker sends a request A to the web cache server that will be split by the vulnerable server (into a1 and a2).\r\n2. Cache server forwards this request A to the vulnerable server.\r\n3. Vulnerable server sends two responses to cache server: first a1 and then a2.\r\n4. Cache server adds entry in the cache associating resource A to a1.\r\n5. Attacker sends a request B to the web cache server.\r\n6. Cache server adds entry in the cache associating resource B to a2.\r\n7. Since the attacker fully controls a2, he can poison resource B in the cache with anything.\r\n\r\nSetting the Last-Modified header to a future date makes the cache server return the attacker’s page instead of contacting the origin server to request the page from its valid domain. The attacker can also use the Cache-Control or the Pragma header to control how a cache server handles responses and updates its records.\r\n\r\n### Payload 4: Page Hijacking ###\r\n\r\nThis attack is achieved through a proxy server. The attacker needs to pay extra attention to timing since it needs to make a request at the correct time to get back a response that was previously made by a legitimate user. The scenario follows these specific steps:\r\n\r\n1. Attacker sends a request to the proxy server A that will be split by the vulnerable web server (into a1 and a2).\r\n2. Proxy server forwards this request A to the vulnerable server.\r\n3. Vulnerable server sends two responses: first a1 and then a2.\r\n4. Proxy server forwards a1 it to the attacker and keeps a2.\r\n5. Victim client sends a request B for a confidential page to the web server through the proxy.\r\n6. Proxy forwards B to the web server.\r\n7. Proxy sends the second response from the server a2 to the victim client (instead of the response b).\r\n8. Proxy receives response b from the web server.\r\n9. Attacker sends a request C to the web server over the proxy.\r\n10. Proxy server sends the response b to the attacker (instead of the response c).\r\n11. Since the attacker was able to insert an unexpected response to the communication flow, the proxy server gets sends the response b containing confidential data to the wrong client (the attacker).  \r\n\r\n\r\n## Step 2: Analyze Causes and Countermeasures ##\r\n\r\nThe next step is to comprehend what causes HTTP response splitting vulnerabilities and how to defend against them. This knowledge will aid you in recognizing this attack class in the source codebase and use best coding practices.\r\n\r\n### HTTP Response Splitting Causes ###\r\n\r\nHTTP protocol specifications indicate that each header is separated by a carriage return character (CR, ASCII 0x0D) followed by a line feed character (LF, ASCII 0x0A) represented as the string CR/LF . In addition, the response headers are separated by the body by two ( CR/LF/CR/LF).\r\n\r\nHTTP response splitting attacks work by injecting CR/LF strings into HTTP headers. Web applications that build headers without checking for CR/LF are vulnerable to this attack. Failing to check data used for header construction and remove malicious CR/LF is what allows the attack and the cause of this vulnerability. It is important to note that, even victims of this attack are web clients, this is a server-side bug.\r\n\r\n\r\n### HTTP Response Splitting Countermeasures ###\r\n\r\nThere is a simple solution for response splitting bugs: check the data in the headers before sending them to the client. Absolutely don’t write any data to the headers before checking the data for CR/LF characters ( %0d%0a ) and other HTTP special characters.   An alternative approach is to have a white list that indicates the safe patterns to write to the headers. The server checks the data to be written to the header to see if it matches one of the white list’s safe patterns. The server allows the data into the header only if it matches one of the safe patterns while disallowing any data that doesn’t match a safe pattern. \r\n\r\n\r\n## Step 3: Start Testing and Exploring ##\r\n\r\nThis step focuses on executing a first round of test cases to find HTTP response splitting bugs.\r\n\r\n### Testing for Response Splitting through a redirect ###\r\n\r\nHardware Requirements: One client computer and one server computer running the web application.\r\n\r\nTools: Web browser, network monitoring tool (Wireshark).\r\n\r\nTesting steps:\r\n\r\n1. Find a page in the web application that does a redirect.\r\n2. Determine what parameter is written to the Location header (this parameter is usually passed through a URL but maybe forwarded another way).\r\n3. Build an HTML page with a link containing a URL with the address of the redirect page (from step 1) and pass a double CR/LF and an additional HTTP 200 (OK) response with an injected page through the Location header’s parameter. \r\n4. In the client computer, start monitoring network traffic using Wireshark.\r\n5. Open the page built using an Internet browser and click on the link.\r\n6. Wait until the client receives all the responses from the server (this takes less than ten seconds in an average speed network).\r\n7. Stop monitoring network traffic and analyze packets exchanged between the web server and the client.\r\n\r\nExpected results: the application is vulnerable to HTTP response splitting if the web server sends two HTTP responses (a 200 OK and 302 Redirect) and if the client browser displays the injected page.\r\n\r\n\r\n### Testing for Response Splitting through header construction from a permanent store ###\r\n\r\nHardware Requirements: One client computer and one server computer running the web application.\r\n\r\nTools: Web browser, network monitoring tool (Wireshark), database client.\r\n\r\nTesting steps:\r\n\r\n1. Find a response sent by the web application that uses a database record to as part of a header.\r\n2. Connect to database using the database client.\r\n3. Update the vulnerable record with a double CR/LF and an additional HTTP 200 (OK) response containing a defaced page.\r\n4. In the client computer, start monitoring network traffic using Wireshark.\r\n5. Browse to page that sends the response from database data (from step 1).\r\n6. Wait until the client receives all the responses from the server (this takes less than ten seconds in an average speed network).\r\n7. Stop monitoring network traffic and analyze packets exchanged between the web server and the client.\r\n\r\nExpected results: Same as first test case.\r\n\r\n\r\n### Testing for Response Splitting through header construction using the URL ###\r\n\r\nHardware Requirements: One client computer and one server computer running the web application.\r\n\r\nTools: Web browser, network monitoring tool (Wireshark).\r\n\r\nTesting steps:\r\n\r\n1. Find a response sent by the web application that uses a URL parameter as part of a header.\r\n2. Build a page containing a link that invokes the page in step 1 passing a string containing a double CR/LF and an additional HTTP 200 (OK) response containing an injected page in the URL parameter.\r\n3. In the client computer, start monitoring network traffic using Wireshark.\r\n4. Open the page built using an Internet browser and click on the link.\r\n5. Wait until the client receives all the responses from the server (this takes less than ten seconds in an average speed network).\r\n6. Stop monitoring network traffic and analyze packets exchanged between the web server and the client.\r\n\r\nExpected results: Same as first test case.\r\n\r\n\r\n### Testing for Reflective Cross-site Scripting (XSS) through HTTP Response Splitting ###\r\n\r\nHardware Requirements: One client computer and one server computer running the web application.\r\n\r\nTools: Web browser.\r\n\r\nTesting steps:\r\n\r\n1. Find a page vulnerable to HTTP response splitting through a redirect or the URL (fails either test case one or three).\r\n2. Build a page containing a link that invokes the vulnerable page in step 1 passing a string containing a double CR/LF and an additional HTTP 200 (OK) response containing a script that pops an alert box through the redirect or URL parameter.\r\n3. In client computer, open the page built using an Internet browser and click on the link.\r\n4. Wait until the client receives all the responses from the server.\r\n\r\nExpected results: The test case fails if an alert box pops up. \r\n\r\n\r\n### Testing for Persistent Cross-site Scripting (XSS) through HTTP Response Splitting ###\r\n\r\nHardware Requirements: One client computer and one server computer running the web application.\r\n\r\nTools: Web browser, database client.\r\n\r\nTesting steps:\r\n\r\n1. Find a page vulnerable to HTTP response splitting through a database record or permanent store (fails test case two).\r\n2. Modify the database record or permanent store with a string containing a double CR/LF and an additional HTTP 200 (OK) response containing a script that pops an alert box through the redirect or URL parameter.\r\n3. In client computer, browse to the page found in step 1 using a Web browser.\r\n4. Wait until the client receives all the responses from the server.\r\n\r\nExpected results: The test case fails if an alert box pops up. \r\n\r\n\r\n### Testing for Web Cache Poisoning through HTTP Response Splitting ###\r\n\r\nHardware Requirements: Two client computers, one web cache server computer, and one web application server. The two clients use the same web cache server.\r\n\r\nTools: Web browser.\r\n\r\nTesting steps:\r\n\r\n1. Find a page vulnerable to HTTP response splitting (fails one the first three tests).\r\n2. In client A use an Internet browser to send a request to the application server containing a double CR/LF and an additional injected HTTP 200 (OK) response with an injected HTML page. Set the cache header in the additional response so that the page is cached by the server. The client sends this request to the web cache server which in turns forwards the request to the application server.\r\n3. In client A, wait until the client receives all the responses from the server (this takes less than ten seconds in an average speed network) and observe the last response rendered in the browser.\r\n4. In client A, make another request to the client to a target resource. This will trigger the attack. If the application server is vulnerable, the cache server will associate this request with the injected response from step 2.\r\n5. In client B, make a request to the same resource targeted in step 4.\r\n\r\nExpected results: The test case fails if the client B gets the injected response from step 2 to the request made in step 5.\r\n\r\n\r\n### Testing for Page Hijacking through HTTP Response Splitting ###\r\n\r\nHardware Requirements: Two client computers, one web cache server computer, and one web application server. The two clients use the proxy server.\r\n\r\nTools: Web browser.\r\n\r\nTesting steps:\r\n\r\n1. Find a page vulnerable to HTTP response splitting (fails one the first three tests).\r\n2. Hook the network intercepting tool to the proxy and intercept any outgoing packets.\r\n3. In client A use an Internet browser to send a request to the application server containing a double CR/LF and an additional injected HTTP 200 (OK) response with a defaced HTML page. The client will send this request through the proxy.\r\n4. In client B, open an Internet browser and browse to a confidential page.\r\n5. In client A, make a request to any web page.\r\n\r\nExpected results: The test case fails if the client A gets the response to the confidential page requested by client B in step 4. \r\n\r\n\r\n### Step 4: Fine-tune Test Case Data ###\r\n\r\nDuring this step you need to repeat the test cases from the previous step while tuning the test case data per entry point and making sure to split the responses by finishing the first HTTP response. The format of test case data varies depending on the entry point used to submit it. For example, if you are testing through the URL the next two strings are equivalent depending on the URL-encoding schema in use:\r\n\r\n~~~~\r\n%0d%0aContent-Type:%20text/html%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2047%0d%0a%0d%0a%3Chtml%3E%3Cfont%20color=red%3EAttacked!!%3C/font%3E%3C/html%3E\r\n\r\n%0d%0aContent-Length:%200%0d%0a%0d%0aHTTP/1.1%20200%20OK%0d%0aContent-Type:%20text/html%0d%0aContent-Length:%2047%0d%0a%0d%0a<html><font%20color=red>Attacked!!!</font></html>\r\n~~~~\r\n\r\nSimilarly, you must tune test data depending on the data format of any of these possible entry points such as redirect pages, URL parameters, web form input fields, web service methods, environment variables, and database contents.\r\n\r\nA challenge in HTTP response splitting testing is to be able to tell the web server to terminate the original response and start the split one. Some web servers have a minimum required length for a response. This means that responses cannot be smaller than a certain size. You must tune the injected data to pad the first response so that the server knows to finish it and start a new one. Other web application servers will finish the response if the Content-Length is set to zero.\r\n\r\n\r\n## Conclusions ##\r\n\r\nHTTP resource splitting is an attack class that facilitates different attacks such as phishing, XSS, and web cache poisoning. Testing for resource splitting bugs needs to cover all these different attacks. It is important that you understand attack scenarios and to execute each test case in detail. Finally make sure to cover all entry points and fine-tune the test data according to their format."
        ]
      }
    ]
  }
}