{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-2086432578",
      "Content_Hash": "1288560341"
    },
    "Metadata": [
      {
        "Id": [
          "a7373e6c-847e-4184-8a3c-d45757fb1b22"
        ],
        "Id_History": [
          "a7373e6c-847e-4184-8a3c-d45757fb1b22,553c5a66-0ebf-4118-ba7a-060ca7af0fb9,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Known Plaintext Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Known Plaintext Vulnerabilities"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\r\n    <span>Applies To</span>\r\n  </h1>\r\n  <ul>\r\n    <li>\r\n      <span>Public and private key encryption systems</span>\r\n      <b>&nbsp;</b>\r\n    </li>\r\n  </ul>\r\n  <h1>\r\n    <span>Summary</span>\r\n  </h1>\r\n  <p>\r\n    <span>In known plaintext attacks the adversary knows both the plaintext and its equivalent ciphertext, and then uses both to calculate a secret cryptographic variable such as the encryption key.<span>&nbsp;</span>Known plaintext bugs are simple to exploit as the attacker doesn’t need to force the victim into encrypting any particular chosen plaintext.</span>\r\n  </p>\r\n  <p>\r\n    <span>The following steps are recommended to test for known plaintext bugs:</span>\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      <span>Step 1:&nbsp;Understand Attack Scenarios</span>\r\n    </li>\r\n    <li>\r\n      <span>Step 2:<span>&nbsp;</span>Analyze Root Causes and Mitigations</span>\r\n    </li>\r\n    <li>\r\n      <span>Step 3:<span>&nbsp;</span>Start Testing and Exploring</span>\r\n    </li>\r\n    <li>\r\n      <span>Step 4:<span>&nbsp;</span>Tune Test Cases</span>\r\n      <b>&nbsp;</b>\r\n    </li>\r\n  </ul>\r\n  <h1>\r\n    <span>Step 1:&nbsp;Understand Attack Scenario </span>\r\n  </h1>\r\n  <p>\r\n    <span>First, you need to understand the details of known plaintext attacks.<span>&nbsp;</span>In the common known plaintext attack scenario the adversary’s goal is to recover the encryption key.<span>&nbsp;</span>The scenario starts with the attacker selecting the victim and discovering the plaintext that the victim encrypts.<span>&nbsp;</span>The attacker then waits until the victim encrypts the plaintext and observes the resulting ciphertext.<span>&nbsp;</span>Then, the attacker uses both the plaintext and ciphertext to recover the encryption key that satisfies the next equation:</span>\r\n  </p>\r\n  <p>\r\n    <i>\r\n      <span>C = E(K, P)</span>\r\n    </i>\r\n  </p>\r\n  <p>\r\n    <span>Where </span>\r\n    <i>\r\n      <span>E </span>\r\n    </i>\r\n    <span>stands for the encryption routine that converts plaintext </span>\r\n    <i>\r\n      <span>P</span>\r\n    </i>\r\n    <span> in to ciphertext </span>\r\n    <i>\r\n      <span>C</span>\r\n    </i>\r\n    <span> using the encryption key</span>\r\n    <i>\r\n      <span> K.&nbsp;</span>\r\n    </i>If the adversary is able to compute the encryption key, he can use it to decrypt an unknown ciphertext, as the following equation demonstrates:</p>\r\n  <p>\r\n    <i>\r\n      <span>Pu</span>\r\n    </i>\r\n    <i>\r\n      <span>&nbsp;= D(K, Ck)</span>\r\n    </i>\r\n    <span>\r\n    </span>\r\n  </p>\r\n  <p>\r\n    <span>Where </span>\r\n    <i>\r\n      <span>D </span>\r\n    </i>\r\n    <span>stands for the decryption routine that converts a known ciphertext </span>\r\n    <i>\r\n      <span>Ck </span>\r\n    </i>\r\n    <span>to the unknown plaintext </span>\r\n    <i>\r\n      <span>Pu</span>\r\n    </i>\r\n    <span> to using the encryption key</span>\r\n    <i>\r\n      <span> K.&nbsp;</span>\r\n    </i>The adversary is able to decrypt any ciphertext created using the stolen key, including potentially sensitive data such as passwords and credit card numbers.<b>&nbsp;</b></p>\r\n  <h1>\r\n    <span>Step 2:&nbsp;Analyze Root Cause and Mitigations</span>\r\n  </h1>\r\n  <p>\r\n    <span>As the section’s name indicates, the success of plaintext attacks depends on knowing the plaintext that is encrypted.<span>&nbsp;</span>It may seem improbable that an adversary gains knowledge of any plaintext, yet there are some circumstances where this can happen.<span>&nbsp;</span>For instance, if the victim is out of the office and has an auto-reply email message configured; the attacker may very well know what the message looks like before it’s encrypted.<span>&nbsp;</span>Another common example is where the victim sends an email to a group of people including the attacker.<span>&nbsp;</span>The attacker can then read the plaintext sent to him, and the ciphertext sent to everybody else.<span>&nbsp; </span><span>&nbsp;</span></span>\r\n  </p>\r\n  <p>\r\n    <span>An additional attack might consist of the attacker sniffing an email conversation between two people exchanging an encrypted document as part of a review process.<span>&nbsp;</span>When the document is published the attacker can compare the plaintext publication with the latest version of the encrypted file.<span>&nbsp;</span>Partially known plaintext attacks occur when the adversary knows part of the plaintext such as headers of IP packets, the beginning of emails, etc.&nbsp;There are different ways for an adversary to know the plaintext in use - a root cause for this vulnerability is any situation which allows the adversary to be aware of such plaintext.</span>\r\n  </p>\r\n  <p>\r\n    <span>There are no clear mitigations against these attacks as most of the causes happen by design.<span>&nbsp;</span>For instance, email servers provide the functionality to have auto-reply messages.<span>&nbsp;</span>Furthermore, in the case where the victim sends the attacker a copy of a group email, there is no way to prevent the victim from emailing the attacker if the attacker is part of the group.<span>&nbsp;</span>Consider the case where the attacker sniffs an encrypted document in review: possible mitigations for this attack require higher level analysis and education, such as requiring the people involved in the document review to check the document in to an Intranet portal or similar mechanism rather than transferring it back and forth via email.<span>&nbsp;</span></span>&nbsp;</p>\r\n  <h1>\r\n    <span>Step 3:<span>&nbsp;</span>Start Testing and Exploring </span>\r\n  </h1>\r\n  <p>\r\n    <span>Now that you’ve learned what known plaintext attacks look like and the reasons why they exist, you must test for both secure and insecure implementations.</span>\r\n  </p>\r\n  <p>\r\n    <span>The basic known plaintext security testing follows these steps:</span>\r\n  </p>\r\n  <ol>\r\n    <li>\r\n      <span>Select the victim.</span>\r\n    </li>\r\n    <li>\r\n      <span>Read plaintext before the victim encrypts it.</span>\r\n    </li>\r\n    <li>\r\n      <span>Read the ciphertext after the victim encrypts it.</span>\r\n    </li>\r\n    <li>\r\n      <span>Use the plaintext and ciphertext to calculate the encryption key.</span>\r\n    </li>\r\n  </ol>\r\n  <p>\r\n    <span>Expected result:</span>\r\n    <span>The system protects against reading the plaintext before it is encrypted in step 2.&nbsp;The test fails if you can execute step 2.</span>\r\n  </p>\r\n  <p>\r\n    <span>It is important that during this step you explore the encryption routine used by the system under test.&nbsp;For example, you can check the size of the data before and after encryption.<span>&nbsp;</span>If the encryption routine doesn’t modify the data size then the plaintext and ciphertext have the same size.&nbsp;You can later compare the sizes as a preliminary check to see if the ciphertext matches the known plaintext. </span>\r\n  </p>\r\n  <p>\r\n    <span>Another way to test for known plaintext bugs is to become a valid user of the encryption system.&nbsp;For instance, picture a system that has multiple clients and uses a different key to talk to each client.&nbsp;After becoming a valid client, you can configure a network monitor to see how the server application communicates with you.<span>&nbsp;</span>In most cases, server applications use the same protocol to talk to multiple clients, so parts of the network packets (such as headers) will be constant.&nbsp;You can read these headers in plaintext as they arrive to you or as ciphertext as they arrive to each client, and use this pair of collected data to execute an attack on a client’s private key.</span>\r\n  </p>\r\n  <h1>\r\n    <span>Step 4:&nbsp;Tune Test Cases</span>\r\n  </h1>\r\n  <p>\r\n    <span>Like any vulnerability, the amount of testing for known plaintext attacks depends on their risk.&nbsp;In some cases they represent no obvious risk; the time to compute the key using any known cryptanalysis in systems using large keys and a trusted encryption algorithm may be too great to represent a high risk.<span>&nbsp;</span>However, some systems are mission critical, hermetic, or self contained</span>\r\n    <span>\r\n      <span>, </span>\r\n    </span>\r\n    <span>and in such cases any possible knowledge of the plaintext before it is encrypted can pose a high risk.<span>&nbsp;&nbsp; </span></span>\r\n  </p>\r\n  <p>\r\n    <span>You must also decide what your attack goals are before testing.&nbsp;Make sure to define the attack’s goal in each test case, such as breaking a client’s key, the server’s key, or both.<span>&nbsp;</span>Some keys are more critical to the security of the system under test than others, and you can use this fact to tune your test cases.</span>&nbsp;</p>\r\n  <h1>\r\n    <span>Conclusions</span>\r\n  </h1>\r\n  <p>\r\n    <span>Known plaintext attacks are cryptographic attacks in which the adversary knows the plaintext before it is encrypted.<span>&nbsp;</span>The goal of the attack is to calculate the encryption key to gather additional sensitive data.<span>&nbsp;</span>To test for these attacks, you need to understand their attack scenarios as well as their root causes and mitigations.<span>&nbsp;</span>Then, start testing from the ground up, such as checking message data lengths, and then additional approaches should be used such as becoming a legitimate client of the system and analyzing the format of the encrypted text that is being transmitted.<span>&nbsp;</span>Make sure to tune your test cases based on the sensitivity of the particular encryption key, and the risk potential of an attacker stealing it.</span>\r\n  </p>"
        ]
      }
    ]
  }
}