{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "143343630",
      "Content_Hash": "-1907080389"
    },
    "Metadata": [
      {
        "Id": [
          "a7c52909-5903-4677-bc49-8ca2b924d617"
        ],
        "Id_History": [
          "a7c52909-5903-4677-bc49-8ca2b924d617,87598cec-fa6e-4a7f-bd46-9ba32c1d300e,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "How to Protect From SQL Injection in ASP.NET"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Protect From SQL Injection in ASP.NET"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "ASP.NET 3.5"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Summary</h1>\n  <p>This How to shows a number of ways to help protect your ASP.NET application from SQL injection attacks. SQL injection can occur when an application uses input to construct dynamic SQL statements or when it uses stored procedures to connect to the database. Conventional security measures, such as the use of SSL and IPSec, do not protect your application from SQL injection attacks. Successful SQL injection attacks enable malicious users to execute commands in an application's database.</p>\n  <p>Countermeasures include using a list of acceptable characters to constrain input, using parameterized SQL for data access, and using a least privileged account that has restricted permissions in the database. Using stored procedures with parameterized SQL is the recommended approach because SQL parameters are type safe. Type-safe SQL parameters can also be used with dynamic SQL. In situations where parameterized SQL cannot be used, consider using character escaping techniques. </p>\n  <h1>Contents</h1>\n  <ul>\n    <li>\n      <div>Objectives</div>\n      <li>\n        <div>Overview</div>\n        <li>\n          <div>Summary of Steps</div>\n          <li>\n            <div>Step 1. Constrain Input</div>\n            <li>\n              <div>Step 2. Use Parameters with Stored Procedures</div>\n              <li>\n                <div>Step 3. Use Parameters with Dynamic SQL</div>\n                <li>\n                  <div>Additional Considerations</div>\n                  <li>\n                    <div>Additional Resources</div>\n                  </li>\n                </li>\n              </li>\n            </li>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ul>\n  <h1>Objectives</h1>\n  <ul>\n    <li>Learn how SQL injection attacks work. <li>Constrain input to prevent SQL injection. <li>Use type safe SQL command parameters to prevent SQL injection. <li>Use a least privileged account to connect to the database. <li>Learn additional countermeasures to further reduce risk. </li></li></li></li></li>\n  </ul>\n  <h1>Overview</h1>\n  <p>A successful SQL injection attack enables a malicious user to execute commands in your application's database by using the privileges granted to your application's login. The problem is more severe if your application uses an over-privileged account to connect to the database. For example, if your application's login has privileges to eliminate a database, then without adequate safeguards, an attacker might be able to perform this operation.</p>\n  <p>Common vulnerabilities that make your data access code susceptible to SQL injection attacks include: </p>\n  <ul>\n    <li>Weak input validation. <li>Dynamic construction of SQL statements without the use of type-safe parameters. <li>Use of over-privileged database logins. </li></li></li>\n  </ul>\n  <h2>SQL Injection Example</h2>\n  <p>Consider what happens when a user types the following string in the <b>SSN</b> text box, which is expecting a Social Security number of the form <i>nnn-nn-nnnn</i>.</p>\n  <div>\n    <pre>' ; DROP DATABASE pubs  --  </pre>\n  </div>\n  <p>Using the input, the application executes the following dynamic SQL statement or stored procedure, which internally executes a similar SQL statement. </p>\n  <div>\n    <pre>// Use dynamic SQL<br />SqlDataAdapter myCommand = new SqlDataAdapter(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"SELECT au_lname, au_fname FROM authors WHERE au_id = '\" &#43; <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; SSN.Text &#43; \"'\", myConnection);</pre>\n  </div>\n  <pre>// Use stored procedures<br />SqlDataAdapter myCommand = new SqlDataAdapter(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"LoginStoredProcedure '\" &#43; <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; SSN.Text &#43; \"'\", myConnection);<br /></pre>\n  <p>The developer's intention was that when the code runs, it inserts the user's input and generates a SQL the following statement.</p>\n  <div>\n    <pre>SELECT au_lname, au_fname FROM authors WHERE au_id = '172-32-9999'  </pre>\n  </div>\n  <p>However, the code inserts the user's malicious input and generates the following query.</p>\n  <div>\n    <pre>SELECT au_lname, au_fname FROM authors WHERE au_id = ''; DROP DATABASE pubs --'  </pre>\n  </div>\n  <p>In this case, the <b>'</b> (single quotation mark) character that starts the rogue input terminates the current string literal in the SQL statement. It closes the current statement only if the following parsed token does not make sense as a continuation of the current statement but does make sense as the start of a new statement. As a result, the opening single quotation mark character of the rogue input results in the following statement.</p>\n  <div>\n    <pre>SELECT au_lname, au_fname FROM authors WHERE au_id = ''  </pre>\n  </div>\n  <p>The<b>;</b> (semicolon) character tells SQL that this is the end of the current statement, which is then followed by the following malicious SQL code.</p>\n  <div>\n    <div>\n      <div>\n      </div>\n      <div>\n        <a class=\"copyCode\" href=\"javascript:CopyCode('ctl00_LibFrame_ctl09');\">\n        </a>&nbsp;</div>\n    </div>\n    <pre>; DROP DATABASE pubs  </pre>\n  </div>\n  <blockquote>\n    <b>Note</b>&nbsp;&nbsp;&nbsp;The semicolon is not necessarily required to separate SQL statements. This is dependent on vendor or implementation, but Microsoft SQL Server does not require them. For example, SQL Server parses the following as two separate statements:</blockquote>\n  <blockquote>SELECT &#42; FROM MyTable DELETE FROM MyTable</blockquote>\n  <blockquote>\n  </blockquote>\n  <p>Finally, the <b>--</b> (double dash) sequence of characters is a SQL comment that tells SQL to ignore the rest of the text. In this case, SQL ignores the closing <b>'</b> (single quotation mark) character, which would otherwise cause a SQL parser error.</p>\n  <div>\n    <pre>--'  </pre>\n  </div>\n  <h2>Guidelines</h2>\n  <p>To counter SQL injection attacks, you need to: </p>\n  <ul>\n    <li>\n      <b>Constrain and sanitize input data. </b>Check for known good data by validating for type, length, format, and range. <li><b>Use type-safe SQL parameters for data access.</b> You can use these parameters with stored procedures or dynamically constructed SQL command strings. Parameter collections such as <b>SqlParameterCollection</b> provide type checking and length validation. If you use a parameters collection, input is treated as a literal value, and SQL Server does not treat it as executable code. An additional benefit of using a parameters collection is that you can enforce type and length checks. Values outside of the range trigger an exception. This is a good example of defense in depth. <li><b>Use an account that has restricted permissions in the database.</b> Ideally, you should only grant execute permissions to selected stored procedures in the database and provide no direct table access. <li><b>Avoid disclosing database error information. </b>In the event of database errors, make sure you do not disclose detailed error messages to the user. </li></li></li></li>\n  </ul>\n  <blockquote>\n    <b>Note</b>&nbsp;&nbsp;&nbsp;Conventional security measures, such as the use of Secure Socket Layer (SSL) and IP Security (IPSec), do not protect your application from SQL injection attacks. </blockquote>\n  <h1>Summary of Steps</h1>\n  <p>To protect your application from SQL injection, perform the following steps: </p>\n  <ul>\n    <li>Step 1. Constrain input. <li>Step 2. Use parameters with stored procedures. <li>Step 3. Use parameters with dynamic SQL.<strong></strong></li></li></li>\n  </ul>\n  <h1>Step 1. Constrain Input</h1>\n  <p>You should validate all input to your ASP.NET applications for type, length, format, and range. By constraining the input used in your data access queries, you can protect your application from SQL injection. </p>\n  <blockquote>\n    <b>Note</b>&nbsp;&nbsp;&nbsp;When constraining input, it is a good practice to create a list of acceptable characters and use regular expressions to reject any characters that are not on the list. The potential risk associated with using a list of unacceptable characters is that it is always possible to overlook an unacceptable character when defining the list; also, an unacceptable character can be represented in an alternate format to pass validation. </blockquote>\n  <h2>Constrain Input in ASP.NET Web Pages</h2>\n  <p>Start by constraining input in the server-side code for your ASP.NET Web pages. Do not rely on client-side validation because it can be easily bypassed. Use client-side validation only to reduce round trips and to improve the user experience.</p>\n  <p>If you use server controls, use the ASP.NET validator controls, such as the <b>RegularExpressionValidator</b> and <b>RangeValidator</b> controls to constrain input. If you use regular HTML input controls, use the <b>Regex</b> class in your server-side code to constrain input.</p>\n  <p>If in the previous code example, the SSN value is captured by an ASP.NET <b>TextBox</b> control, you can constrain its input by using a <b>RegularExpressionValidator</b> control as shown in the following.</p>\n  <div>\n    <pre>&lt;&#37;&#64; language=\"C#\" &#37;&gt;<br />&lt;form id=\"form1\" runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp; &lt;asp:TextBox ID=\"SSN\" runat=\"server\"/&gt;<br />&nbsp;&nbsp;&nbsp; &lt;asp:RegularExpressionValidator ID=\"regexpSSN\" runat=\"server\"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ErrorMessage=\"Incorrect SSN Number\" <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ControlToValidate=\"SSN\"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ValidationExpression=\"&#94;\\d&#123;3&#125;-\\d&#123;2&#125;-\\d&#123;4&#125;&#36;\" /&gt;<br />&lt;/form&gt;  </pre>\n  </div>\n  <p>If the SSN input is from another source, such as an HTML control, a query string parameter, or a cookie, you can constrain it by using the <b>Regex</b> class from the <b>System.Text.RegularExpressions</b> namespace. The following example assumes that the input is obtained from a cookie.</p>\n  <p>using System.Text.RegularExpressions;</p>\n  <div>\n    <pre>if (Regex.IsMatch(Request.Cookies&#91;\"SSN\"&#93;, \"&#94;\\d&#123;3&#125;-\\d&#123;2&#125;-\\d&#123;4&#125;&#36;\"))<br />&#123;<br />&nbsp;&nbsp;&nbsp; // access the database<br />&#125;<br />else<br />&#123;<br />&nbsp;&nbsp;&nbsp; // handle the bad input<br />&#125;  </pre>\n  </div>\n  <h2>Constrain Input in Data Access Code</h2>\n  <p>In some situations, you need to provide validation in your data access code, perhaps in addition to your ASP.NET page-level validation. Two common situations where you need to provide validation in your data access code are: </p>\n  <ul>\n    <li>\n      <b>Untrusted clients.</b> If the data can come from an untrusted source or you cannot guarantee how well the data has been validated and constrained, add validation logic that constrains input to your data access routines. <li><b>Library code. </b>If your data access code is packaged as a library designed for use by multiple applications, your data access code should perform its own validation, because you can make no safe assumptions about the client applications. </li></li>\n  </ul>\n  <p>The following example shows how a data access routine can validate its input parameters by using regular expressions prior to using the parameters in a SQL statement.</p>\n  <div>\n    <pre>using System;<br />using System.Text.RegularExpressions;</pre>\n  </div>\n  <pre>public void CreateNewUserAccount(string name, string password)<br />&#123;<br />&nbsp;&nbsp;&nbsp; // Check name contains only lower case or upper case letters, <br />&nbsp;&nbsp;&nbsp; // the apostrophe, a dot, or white space. Also check it is <br />&nbsp;&nbsp;&nbsp; // between 1 and 40 characters long<br />&nbsp;&nbsp;&nbsp; if ( &#33;Regex.IsMatch(userIDTxt.Text, &#64;\"&#94;&#91;a-zA-Z'./s&#93;&#123;1,40&#125;&#36;\"))<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; throw new FormatException(\"Invalid name format\");</pre>\n  <pre>&nbsp;</pre>\n  <pre>&nbsp;&nbsp;&nbsp; // Check password contains at least one digit, one lower case <br />&nbsp;&nbsp;&nbsp; // letter, one uppercase letter, and is between 8 and 10 <br />&nbsp;&nbsp;&nbsp; // characters long<br />&nbsp;&nbsp;&nbsp; if ( &#33;Regex.IsMatch(passwordTxt.Text, <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#64;\"&#94;(?=.&#42;\\d)(?=.&#42;&#91;a-z&#93;)(?=.&#42;&#91;A-Z&#93;).&#123;8,10&#125;&#36;\" ))<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; throw new FormatException(\"Invalid password format\");</pre>\n  <pre>&nbsp;</pre>\n  <pre>&nbsp;&nbsp;&nbsp; // Perform data access logic (using type safe parameters)<br />&nbsp;&nbsp;&nbsp; ...<br />&#125;</pre>\n  <h1>Step 2. Use Parameters with Stored Procedures</h1>\n  <p>Using stored procedures does not necessarily prevent SQL injection. The important thing to do is use parameters with stored procedures. If you do not use parameters, your stored procedures can be susceptible to SQL injection if they use unfiltered input as described in the \"Overview\" section of this document.</p>\n  <p>The following code shows how to use <b>SqlParameterCollection</b> when calling a stored procedure.</p>\n  <div>\n    <pre>using System.Data;<br />using System.Data.SqlClient;</pre>\n    <pre>using (SqlConnection connection = new SqlConnection(connectionString))<br />&#123;<br />&nbsp; DataSet userDataset = new DataSet();<br />&nbsp; SqlDataAdapter myCommand = new SqlDataAdapter( <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"LoginStoredProcedure\", connection);<br />&nbsp; myCommand.SelectCommand.CommandType = CommandType.StoredProcedure;<br />&nbsp; myCommand.SelectCommand.Parameters.Add(\"&#64;au_id\", SqlDbType.VarChar, 11);<br />&nbsp; myCommand.SelectCommand.Parameters&#91;\"&#64;au_id\"&#93;.Value = SSN.Text;</pre>\n    <pre>&nbsp; myCommand.Fill(userDataset);<br />&#125;  </pre>\n  </div>\n  <p>In this case, the <b>&#64;au_id</b> parameter is treated as a literal value and not as executable code. Also, the parameter is checked for type and length. In the preceding code example, the input value cannot be longer than 11 characters. If the data does not conform to the type or length defined by the parameter, the <b>SqlParameter</b> class throws an exception.</p>\n  <h2>Review Your Application's Use of Parameterized Stored Procedures</h2>\n  <p>Because using stored procedures with parameters does not necessarily prevent SQL injection, you should review your application's use of this type of stored procedure. For example, the following parameterized stored procedure has several security vulnerabilities.</p>\n  <div>\n    <pre>CREATE PROCEDURE dbo.RunQuery&#64;var ntextAS<br />        exec sp_executesql &#64;varGO  </pre>\n  </div>\n  <p>An application that uses a stored procedure similar to the one in the preceding code example has the following vulnerabilities: </p>\n  <ul>\n    <li>The stored procedure executes whatever statement is passed to it. Consider the <b>&#64;var</b> variable being set to: <div><pre>DROP TABLE ORDERS;  </pre></div><p>In this case, the ORDERS table will be dropped. </p><li>The stored procedure runs with <b>dbo</b> privileges. <li>The stored procedure's name (<b>RunQuery</b>) is a poor choice. If an attacker is able to probe the database, he or she will see the name of the stored procedure. With a name like <b>RunQuery</b>, he can guess that the stored procedure is likely to run the supplied query. </li></li></li>\n  </ul>\n  <h1>Step 3. Use Parameters with Dynamic SQL</h1>\n  <p>If you cannot use stored procedures, you should still use parameters when constructing dynamic SQL statements. The following code shows how to use <b>SqlParametersCollection</b> with dynamic SQL.</p>\n  <div>\n    <pre>using System.Data;<br />using System.Data.SqlClient;</pre>\n  </div>\n  <pre>using (SqlConnection connection = new SqlConnection(connectionString))<br />&#123;<br />&nbsp; DataSet userDataset = new DataSet();<br />&nbsp; SqlDataAdapter myDataAdapter = new SqlDataAdapter(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"SELECT au_lname, au_fname FROM Authors WHERE au_id = &#64;au_id\", <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; connection);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br />&nbsp; myCommand.SelectCommand.Parameters.Add(\"&#64;au_id\", SqlDbType.VarChar, 11);<br />&nbsp; myCommand.SelectCommand.Parameters&#91;\"&#64;au_id\"&#93;.Value = SSN.Text;<br />&nbsp; myDataAdapter.Fill(userDataset);<br />&#125;</pre>\n  <h2>Using Parameter Batching</h2>\n  <p>A common misconception is that if you concatenate several SQL statements to send a batch of statements to the server in a single round trip, you cannot use parameters. However, you can use this technique if you make sure that parameter names are not repeated. You can easily do this by making sure that you use unique parameter names during SQL text concatenation, as shown here.</p>\n  <div>\n    <pre>using System.Data;<br />using System.Data.SqlClient;<br />. . .<br />using (SqlConnection connection = new SqlConnection(connectionString))<br />&#123;<br />&nbsp; SqlDataAdapter dataAdapter = new SqlDataAdapter(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"SELECT CustomerID INTO #Temp1 FROM Customers \" &#43;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"WHERE CustomerID &gt; &#64;custIDParm; SELECT CompanyName FROM Customers \" &#43;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"WHERE Country = &#64;countryParm and CustomerID IN \" &#43;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"(SELECT CustomerID FROM #Temp1);\",<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; connection);<br />&nbsp; SqlParameter custIDParm = dataAdapter.SelectCommand.Parameters.Add(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"&#64;custIDParm\", SqlDbType.NChar, 5);<br />&nbsp; custIDParm.Value = customerID.Text;</pre>\n    <pre>&nbsp; SqlParameter countryParm = dataAdapter.SelectCommand.Parameters.Add(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"&#64;countryParm\", SqlDbType.NVarChar, 15);<br />&nbsp; countryParm.Value = country.Text;</pre>\n    <pre>&nbsp; connection.Open();<br />&nbsp; DataSet dataSet = new DataSet();<br />&nbsp; dataAdapter.Fill(dataSet);<br />&#125;<br />. . .  </pre>\n  </div>\n  <h1>Additional Considerations</h1>\n  <p>Other things to consider when you develop countermeasures to prevent SQL injection include: </p>\n  <ul>\n    <li>Use escape routines to handle special input characters. <li>Use a least-privileged database account. <li>Avoid disclosing error information. </li></li></li>\n  </ul>\n  <h2>Use Escape Routines to Handle Special Input Characters</h2>\n  <p>In situations where parameterized SQL cannot be used and you are forced to use dynamic SQL instead, you need to safeguard against input characters that have special meaning to SQL Server (such as the single quote character). If not handled, special characters such as the single quote character in the input can be utilized to cause SQL injection. </p>\n  <blockquote>\n    <b>Note</b>&nbsp;&nbsp;&nbsp;Special input characters pose a threat only with dynamic SQL and not when using parameterized SQL. </blockquote>\n  <p>Escape routines add an escape character to characters that have special meaning to SQL Server, thereby making them harmless. This is illustrated in the following code fragment:</p>\n  <div>\n    <pre>private string SafeSqlLiteral(string inputSQL)&#123;  return inputSQL.Replace(\"'\", \"''\");</pre>\n  </div>\n  <p>&#125;</p>\n  <h2>Use a Least-Privileged Database Account</h2>\n  <p>Your application should connect to the database by using a least-privileged account. If you use Windows authentication to connect, the Windows account should be least-privileged from an operating system perspective and should have limited privileges and limited ability to access Windows resources. Additionally, whether or not you use Windows authentication or SQL authentication, the corresponding SQL Server login should be restricted by permissions in the database.</p>\n  <p>Consider the example of an ASP.NET application running on Microsoft Windows Server 2003 that accesses a database on a different server in the same domain. By default, the ASP.NET application runs in an application pool that runs under the Network Service account. This account is a least privileged account.</p>\n  <h3>To access SQL Server with the Network Service account </h3>\n  <ol>\n    <li>Create a SQL Server login for the Web server's Network Service account. The Network Service account has network credentials that are presented at the database server as the identity <i>DOMAIN</i>\\<i>WEBSERVERNAME</i>&#36;. For example, if your domain is called XYZ and the Web server is called 123, you create a database login for XYZ\\123&#36;. <li>Grant the new login access to the required database by creating a database user and adding the user to a database role. <li>Establish permissions to let this database role call the required stored procedures or access the required tables in the database. Only grant access to stored procedures the application needs to use, and only grant sufficient access to tables based on the application's minimum requirements. <p>For example, if the ASP.NET application only performs database lookups and does not update any data, you only need to grant read access to the tables. This limits the damage that an attacker can cause if the attacker succeeds in a SQL injection attack. </p></li></li></li>\n  </ol>\n  <h2>Avoid Disclosing Error Information</h2>\n  <p>Use structured exception handling to catch errors and prevent them from propagating back to the client. Log detailed error information locally, but return limited error details to the client. </p>\n  <p>If errors occur while the user is connecting to the database, be sure that you provide only limited information about the nature of the error to the user. If you disclose information related to data access and database errors, you could provide a malicious user with useful information that he or she can use to compromise your database security. Attackers use the information in detailed error messages to help deconstruct a SQL query that they are trying to inject with malicious code. A detailed error message may reveal valuable information such as the connection string, SQL server name, or table and database naming conventions.</p>\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}