{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-652659723",
      "Content_Hash": "900174773"
    },
    "Metadata": [
      {
        "Id": [
          "a90e66f1-18e6-48e0-a456-59c2cf227a63"
        ],
        "Id_History": [
          "a90e66f1-18e6-48e0-a456-59c2cf227a63,63b68218-ecb1-46c4-bdbc-fad5c7007d65,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Double Free Bugs"
        ],
        "Category": [
          "Memory Management"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Double Free Bugs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Summary  </h1>\r\n  <p>A double free bug is a coding error where an application uses <i>malloc</i> to allocate a memory block and then uses <i>free</i> to release the block twice, without reinitializing the pointer to the block or setting it to null between the two calls to <i>free</i>.As a result of executing the second <i>free,</i> the internal heap structures used by <i>malloc</i> (<i>HeapAlloc</i> in Windows) become corrupted.An attacker takes advantage of a double free bug to in order to overwrite an application’s memory and get execution control of the application.&nbsp;&nbsp; </p>\r\n  <p>It is recommended to follow these steps to test for double free bugs:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Start testing and exploring </li>\r\n    <li>Step 4: Execute additional testing</li>\r\n  </ul>\r\n  <h1>\r\nStep 1: Understand attack scenarios\r\n</h1>\r\n  <p>The first step in testing for double free bugs is to understand their attack scenarios.</p>\r\n  <p>C/C++ applications use <i>malloc()</i> and <i>free() </i>family of functions to allocate and deallocate memory respectively.These two functions use memory chunks which are stored as internal heap structures in the form of a doubly linked list.When <i>malloc </i>and <i>free</i> are called, routines execute that maintain the linked link list by splitting, coalescing, and rearrangingchunks. &nbsp;</p>\r\n  <p>During a double free attack, an attacker exploits the fact that an application calls the memory releasing function <i>free</i> twice on a memory chunk.Ifthe application is vulnerable it may crash or even allow overwriting arbitrary chucks of the heap.This overwrite is possible because calling <i>free</i> twice on a memory block leads to corruption of an internal structure used by this API that is kept in the heap, thus allowing attackers to overwrite parts of the heap.</p>\r\n  <p>To fully understand double free bugs it is recommended to familiarize with the different implementation of functions such as <i>malloc</i> and <i>free</i> and their internal data structures<i>. </i>A double free attack commonly involves these steps:</p>\r\n  <ol>\r\n    <li>The attacker finds an application functionality under which the application double frees a memory block accessible to attacker. </li>\r\n    <li>The attacker forces the application to load shell code into memory by using the&nbsp;application.This might be possible through the graphical user interface(GUI) or other user interfaces by copying the shell code to a specific input box (in GUIs) or sending it to the application as an input parameter (innon-GUIs). </li>\r\n    <li>The attacker forces the application to call <i>malloc</i> to arrange internal structures for the attack.Here the attacker must find an application functionality that calls <i>malloc,</i> allowing the attacker to prepare the attack. </li>\r\n    <li>The attacker executes the application functionality found in step 1 under which the application double frees the same memory chunk using <i>free. </i>This causes the application to corrupt <i>malloc</i> internal structures (heap control block in Windows) </li>\r\n    <li>The attacker forces the application to call <i>malloc</i> again with size of double freed chunk.The attacker can do thisby executing the same functionality in step 3 but using a different input parameter size. </li>\r\n    <li>The attacker copies the address of shell code and target function such as <i>strcpy</i> at the start of the chunk allocated in the previous step. </li>\r\n    <li>The attacker forces the application to call <i>malloc</i> again with size of double freed chunk.This causes the memory corruption; the application overwrites the address of the target function (<i>strcpy)</i> in the global offset table with the address of the shell code (copied into the first 8 bytes of the allocated chunk during step 7). </li>\r\n    <li>The attacker finds and executes an application functionality that ends up calling the target function (<i>strcpy</i>).This causes the application to execute shell code.&nbsp;</li>\r\n  </ol>\r\n  <p>For a detailed attack scenario example read the bug report about a remote double free vulnerability discovered in Concurrent Versioning System (CVS) application in Linux [i] or the one found in Internet Explorer’s ADODB.Recordset function [ii].</p>\r\n  <p>In Windows platformsattackers exploit the usage of <i>RtlHeap</i>, <i>HeapAlloc</i>, and <i>HeapFree</i> to execute double free attacks.</p>\r\n  <h1>\r\nStep 2: Analyze Causes and Countermeasures\r\n</h1>\r\n  <p>The next step in testing for double free bugs is to understand what causes them and how to protect against them.</p>\r\n  <p>Double free vulnerabilities exist because an application frees a block of memory for a second time.For example, the following code shows a simple double free vulnerability:</p>\r\n  <pre>char* str = (char*)malloc (STR_SZ);<br />...<br />if (cond) {<br />free(str);<br />}<br />...<br />free(str);\r\n</pre>To protect against double free vulnerabilities it is necessary to set any freed memory pointer to null right after freeing it:<br /><pre>char* str= (char*)malloc (STR_SZ);<br />...<br />if (cond) {<br />free(str);<br />str = NULL;&nbsp; <br />}<br />...<br />free(str);<br />str = NULL;</pre><p><b></b></p><h1>Step 3: Start Testing and Exploring</h1><p>Now that you’ve understood double free attack scenarios and reviewed what causes and how to countermeasure double free bugs, it is necessary to execute test cases to check if your application is vulnerable.</p><p>If you have source code access, it is strongly recommended to perform code reviews and run static analysis tools in order to discover double free vulnerabilities.As shown in the previous section, look for a <i>free</i> that is called a second time on a pointer that hasn’t been set to null.As these two calls can extend across numerous modules and lines of code, a source analysis tool can be of great help here.Some tools that include double free checks include open source RATS and commercial ones such as Checkmarx.</p><p>If access to source code is not an option, it is recommended that you test for double frees in the same way you test for heap corruption errors such as heap overflows.Attach a debugger that is capable of detecting heap corruption scenarios (such as <i>ntsd</i> with <i>gflags</i>).Then, submit malicious input to the application like overly long strings or input containing special and escape characters.If the malicious input causes a double free situation, the debugger will break showing a heap corruption.<br />&nbsp;</p><h1>Step 4: Execute Additional Testing</h1><p>To successfully exploit double free bugs it is necessary to learn the heap management platform-specifics for functions such as <i>malloc</i> and<i> free.</i>For instance, since the release of Microsoft Windows XP SP2,Windows platforms use a security cookie to check if heap chunks are tampered in between calls to functions such as <i>free.</i>Even though, this and other similar measures make exploitation of this bug more difficult, there are ways to bypass such measures, as shown in a double free bug that affected <i>CSRSS</i> in XP SP2 [iii].&nbsp;&nbsp;&nbsp; </p><h1>Conclusions</h1><p>Double free vulnerabilities are dangerous as they may allow an attacker to remotely execute code with the same privileges of the target application.To test for this vulnerability, it is necessary to understand its attack scenarios as well as its causes and countermeasures.&nbsp; Perform code reviews and take advantage of source analysis to detect this bug in your source code.If you lack source code access, test for this bug by submitting very long strings and malformed data such as testing for heap overflows.Finally, to successfully exploit this bug, remember to learn the heap management specifics for the operating system your application runs in.<b></b></p><div><hr /></div><p>[i] <strong>CVS Remote Vulnerability</strong>. <a href=\"http://www.securiteam.com/unixfocus/5VP0P0A8UQ.html\">http://www.securiteam.com/unixfocus/5VP0P0A8UQ.html</a></p><p>[ii] <strong>Microsoft Internet Explorer ADODB.Recordset Double Free Memory Exploit (ms07-009).</strong>&nbsp; milw0rm.com. <a href=\"http://www.milw0rm.com/exploits/3577\">http://www.milw0rm.com/exploits/3577</a></p><p>[iii] <strong>Double Free Vulnerabilities on Windows</strong><strong>. </strong>&nbsp;Matt Conover.&nbsp; Badcoded, 2007. <a href=\"http://badcoded.blogspot.com/2007/12/double-free-vulnerabilities-on-windows.html\">http://badcoded.blogspot.com/2007/12/double-free-vulnerabilities-on-windows.html</a></p><p>&nbsp;</p>"
        ]
      }
    ]
  }
}