{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-592320310",
      "Content_Hash": "463052389"
    },
    "Metadata": [
      {
        "Id": [
          "bdef0ce3-8f9b-4424-a2a5-79d8ef49578e"
        ],
        "Id_History": [
          "bdef0ce3-8f9b-4424-a2a5-79d8ef49578e,42e5b681-f4d9-4e2c-b780-2ee6897a78cb,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Reverse Engineering Bugs"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Reverse Engineering Bugs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\n     Applies to \n  </h1>\n  <ul>\n    <li>All software applications</li>\n  </ul>\n  <h1>\n     Summary \n  </h1>\n  <p>Reverse engineering of software is the process of inferring details about the architecture, design, or implementation of a software application after the application has been built and released.    This attack commonly focuses on recovering the source code of the target application, but it may also focus in discovering its design and architecture.    </p>\n  <p>Follow these steps to test for reverse engineering bugs:</p>\n  <ul>\n    <li>Step 1: Understand attack scenarios </li>\n    <li>Step 2: Analyze causes and countermeasures </li>\n    <li>Step 3: Execute test cases</li>\n  </ul>\n  <h1>\n     Step 1: Understand Attack Scenarios \n  </h1>\n  <p>First, it is necessary to understand under what scenarios and for what purposes attackers utilize reverse engineering:</p>\n  <ul>\n    <li>Recovering source code </li>\n    <li>Recovering software design and architecture</li>\n  </ul>\n  <h2>\n    <em>Scenario 1: Recovering source code</em>\n  </h2>\n  <p>Reverse engineering is often used to recover the source code of an application from a binary file or an intermediate file such as a Java class. For this purpose, the attacker uses a reverse engineering tool, such as a dissasembler or a decompiler, to parse the compiled or built source code in an attempt to reverse the compiling or building process and reconstruct the actual source code that created the file, line by line. Once the attacker gets the output of the code recovery tool, he usually uses the output source in an attempt to reconstruct the application. Attackers use this technique to recover source code for a program, to modify the code to achieve a desired task (such as getting rid of a registration/activation process, or to bypass a security check), and then to rebuild the application into a modified version that suits the attacker’s needs.</p>\n  <p>In detail:</p>\n  <ol>\n    <li>Attacker gets a copy of application binary/object/class files. </li>\n    <li>Attacker uses a tool to translate binary/object/class files into source code. </li>\n    <li>Attacker modifies source code and rebuilds application (optional).</li>\n  </ol>\n  <p>Note that the last step is not a requirement for a reverse engineering attack.</p>\n  <h2>\n    <em>Scenario 2: Recovering software design and architecture</em>\n  </h2>\n  <p>Software applications work by making internal logical decisions and interacting with their environments. For instance, an application might have different <i>if/then/else</i> or <i>case</i> conditions to choose different logical paths. In addition, to properly operate, most applications need to access files from the hard drive, send information over the network, consume memory, use the registry (in Windows), or interact with a database. By analyzing how and when an application takes logical decisions and how it interacts with its environment, an attacker can determine the design of a program, even when this design is not intuitive.</p>\n  <p>In this scenario, an attacker uses a set of tools including dissasemblers, decompilers, debuggers, dependency checkers, and monitoring tools to discover the details of how the application is designed and its architecture. In short, how the application decides different internal paths and interacts with its environment.</p>\n  <p>In detail:</p>\n  <ol>\n    <li>The attacker gets a copy of an application’s binary/object/class files. </li>\n    <li>The attacker analyzes the application statically, using dependency checker tools to see how the application is decomposed. </li>\n    <li>The attacker analyzes the application using dissasembler to see how it chooses different logical paths based on different output choices. </li>\n    <li>The attacker exercises the application while monitoring its activity with file system, network, databases, registry, memory, and third-party APIs to see how it interacts with its environment. </li>\n    <li>The attacker collects output from steps 2, 3, and 4 to determine the application’s design and architecture.</li>\n  </ol>\n  <h1>\n     Step 2: Analyze Causes and Countermeasures \n  </h1>\n  <p>The following step, before executing practical test cases, is to understand why reverse engineering bugs are possible and how to protect against them.</p>\n  <p>Reverse engineering bugs exist by default in any software application because they follow the premise that any engineering process can be reversed.    Shippable applications must produce executable files such as binaries or class files, which can become the target of reverse engineering attacks. In addition, all software applications must follow different execution paths and interact with their environment if they want to operate properly, thus opening the door for reverse engineering attacks on the behavior of the application. To protect against reverse engineering attacks, applications must take extra steps during both development and during the compilation/building process.</p>\n  <h2>\n    <em>Anti-disassembling</em>\n  </h2>\n  <p>Disassembling is the process of recovering the application’s source code by parsing the binary or class files that the application uses to execute. There are different tools that perform static disassembling, such as IDA Pro (for numerous types of binary files) and Cavaj (specifically for Java classes), by parsing the binary or class and reconstructing the source code. In addition, these tools might draw a logical flow of the application, such as a flowchart showing the different conditions and branches that the application might take. To protect against dissasemblers, developers are encouraged to use anti-disassembling techniques. Two examples of methods that work for anti-disassembly are obfuscation and code encryption.</p>\n  <p>Developers can mitigate the impact of reverse engineering attacks on applications by adding an extra step to the build/compilation process that obfuscates the application’s source code.    Obfuscation works by replacing specific instructions, such as targets of branch statements, with jumps to intermediate functions, using computed branches in which the target of a branch statement is dynamically computed, or by making all non-conditional branches conditional by inserting false predicates [i].    Each of these methods has as its primary goal to defeat any dissasembler from correctly interpreting and recovering the application’s source code.</p>\n  <p>Recent anti-disassembly research proposes the use of code encryption to protect against reverse engineering attacks by encrypting machine code and decrypting it with an encryption key as it executes. Reverse-engineering hackers obviously would not have the cryptographic key [ii].      </p>\n  <h2>\n    <em>Anti-debugging</em>\n  </h2>\n  <p>Debugging is the process of analyzing the sequence of instructions that a program follows while it executes. As mentioned before, debugging can be of great benefit when executing reverse engineering attacks because it shows the attacker what the application does while running.    Usually, reverse engineers will use a low-level debugger that can hook at kernel-level (or ring-0), such as <i>SoftIce</i> or <i>WinIce</i>. Attackers might also utilize user-mode debuggers such as <i>ntsd</i> or <i>OllyDbg.</i></p>\n  <p>To protect against reverse engineering attacks that are accomplished through debugging, developers can use different anti-debugging techniques such as checking for the presence of a debugger, inserting timers or break-points, or sending commands to void any debuggers that might be attached to the application. This requires the developer to add the necessary source code to the application to do the actual checks and to take the appropriate measures in case a debugger is found. For more information, see <em>Anti-Debugging & Software Protection Advice </em>[iii].</p>\n  <h2>\n    <em>Additional countermeasures</em>\n  </h2>\n  <p>Developers can take additional security measures to make it difficult for reverse engineers to succeed in inferring the application’s behavior, including renaming API and function names, executable modules, and libraries with names that don’t tell anything about the application’s design.</p>\n  <p>It is also important to never ship debug symbols for applications in applications where the impact of reverse engineering is high, because symbols reveal important details about how the application is developed.</p>\n  <p>Finally, if reverse engineering is a very high risk, developers and architects can look into inserting random components and behavior into the application to fool attackers into following paths that are not really part of the application’s design. The goal is to make reverse engineering the application so tedious that attackers become discouraged and stop trying. </p>\n  <h1>\n     Step 3: Execute Test Cases \n  </h1>\n  <p>Now that you’ve reviewed the theoretical aspects of reverse engineering bugs, it is necessary to execute practical test cases to test your application against them.</p>\n  <h2>\n    <em>Test for reverse engineering by using a dissasembler</em>\n  </h2>\n  <p>Follow these steps to test for reverse engineering by using a dissasembler:</p>\n  <ol>\n    <li>Download and install IDA Pro (<a href=\"http://www.softpedia.com/get/Programming/Debuggers-Decompilers-Dissasemblers/IDA-PRO.shtml\">http://www.softpedia.com/get/Programming/Debuggers-Decompilers-Dissasemblers/IDA-PRO.shtml</a>). </li>\n    <li>Run IDA Pro and select a binary file. </li>\n    <li>Start disassembling.</li>\n  </ol>\n  <p>Expected results:    The application is vulnerable if any implementation or design details that must be kept secret can be inferred from IDA Pro.</p>\n  <h2>\n    <em>Test for reverse engineering by using a Java decompiler</em>\n  </h2>\n  <p>Follow these steps to test for reverse engineering using a Java decompiler:</p>\n  <ol>\n    <li>Download and install Cavaj Decompiler (<a href=\"http://cavaj-java-decompiler.en.softonic.com/\">http://cavaj-java-decompiler.en.softonic.com/</a>). </li>\n    <li>Run Cajav decompiler. </li>\n    <li>In the main menu, navigate to <b>File</b>-&gt;<b>Open </b>and select a target Java class file.</li>\n  </ol>\n  <p>Expected results: The application is vulnerable if Cavaj shows source code that is not supposed to be read by an attacker.</p>\n  <h2>\n    <em>Test for reverse engineering by using a debugger</em>\n  </h2>\n  <p>Follow these steps to test for reverse engineering by using a debugger:</p>\n  <ol>\n    <li>Download and install a debugger. </li>\n    <li>Execute the debugger and attach it to the target application. </li>\n    <li>Start debugging application.</li>\n  </ol>\n  <p>Expected results: The application is vulnerable if any implementation or design details that must be kept secret can be inferred from using the debugger.</p>\n  <h2>\n    <em>Test for reverse engineering by using monitoring tools</em>\n  </h2>\n  <p>Follow these steps to test for reverse engineering by using monitoring tools:</p>\n  <ol>\n    <li>Identify binary executable(s) for an application. </li>\n    <li>Open a command prompt. </li>\n    <li>In Microsoft    Visual Studio’s command prompt (installed with Visual Studio), execute <i>dumpbin</i> command in Windows:    <i>dumpbin -all executable_name &gt; bin_output.txt</i>. The output file will give you a list of all the dependencies, DLLs and API names for the executable. </li>\n    <li>Execute the application. </li>\n    <li>Open <i>Task Manager</i>, find an application process, and note the process id number for the application process and any sub-process (you must select the <i>view process tree</i> option to see sub-processes). </li>\n    <li>In a command prompt, execute the <i>netstat</i> command: <i>netstat -ano &gt; net_output.txt.</i></li>\n    <li>Filter the net_output.txt file to show only connections opened by process id number(s) from step 5 in order to find out what TCP/UDP connections are opened by the application. </li>\n    <li>Download, install, and execute Process Explorer (<a href=\"http://www.sysinternals.com/\">www.sysinternals.com</a>). </li>\n    <li>Download, install, and execute Wireshark. </li>\n    <li>Set up filters in both Process Explorer and Wireshark using information from the previous steps (process name, port numbers, etc). This will reduce the amount of noise in these tools. </li>\n    <li>Use the application under test while looking at output from Process Explorer and Wireshark. These tools will give you details on how the application interacts with its environment (file system, registry, kernel objects, and network).</li>\n  </ol>\n  <p>Expected results:    The application is vulnerable if any implementation or design details that must be kept secret can be inferred from the output of the discovery/monitoring tools.</p>\n  <h1>\n     Conclusions \n  </h1>\n  <p>Reverse engineering attacks focus on recovering implementation and design details that should be hidden from ill-intended users. To test for reverse engineering bugs, it is necessary to understand the different attack scenarios, such as reversing a binary or class file, to determine the behavior, design, or architecture of a software application. These attacks are possible by default, because any engineering process can be reversed. However, to counter the impact of reverse engineering bugs, developers can use anti-disassembly and anti-debugging techniques. Finally, to test for this bug in your application, it is recommended that you use a set of disassembling, debugging, discovery, and monitoring tools to discover as many details as possible about the inner workings of your application. This, after all, is how the attacker works.<b></b></p>\n  <div>\n    <hr />\n    <div>\n      <p>[i] <b>Next-Generation Protection Against Reverse Engineering</b>. Chris Coakley, Jay Freeman, Robert Dick.    Anacapa Sciences, Inc.    <a href=\"http://www.anacapasciences.com/publications/protecting_software2005.02.09.pdf\">http://www.anacapasciences.com/publications/protecting_software2005.02.09.pdf</a></p>\n    </div>\n    <div>\n      <p>[ii]  <b>Anti-Disassembly using Cryptographic Hash Functions. </b>John Aycock, Rennie deGraaf, and Michael Jacobson, Jr.    University of Calgary.    <a href=\"http://pages.cpsc.ucalgary.ca/~aycock/papers/antidis.pdf\">http://pages.cpsc.ucalgary.ca/~aycock/papers/antidis.pdf</a></p>\n    </div>\n    <div>\n      <p>[iii] <b>Anti-Debugging & Software Protection Advice</b>. <a href=\"http://www.woodmann.com/crackz/Tutorials/Protect.htm\">http://www.woodmann.com/crackz/Tutorials/Protect.htm</a></p>\n    </div>\n  </div>"
        ]
      }
    ]
  }
}