{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-755626705",
      "Content_Hash": "-1231909513"
    },
    "Metadata": [
      {
        "Id": [
          "bf5f6cb5-4a28-496f-9023-9e521e7dac6d"
        ],
        "Id_History": [
          "bf5f6cb5-4a28-496f-9023-9e521e7dac6d,7c6b6767-2da9-47fa-b925-f0cce0ba2304,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Buffer Overflow Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Buffer Overflow Vulnerabilities"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "Andres De Vivanco"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Compiled code (C/C++)</li>\r\n  </ul>\r\n  <h1>Summary</h1>\r\n  <p>Testing for buffer overflows involves the following 4 steps:</p>\r\n  <p>&nbsp;&nbsp; 1. Identify entry points.<br />&nbsp;&nbsp; 2. Craft attack data for each entry point.<br />&nbsp;&nbsp; 3. Pass attack data to each entry point.<br />&nbsp;&nbsp; 4. Look for application crashes.</p>\r\n  <h1>1. Identify entry points</h1>\r\n  <p>Entry points are the means by which you can provide input to the application under test. The following are common entry points:</p>\r\n  <ul>\r\n    <li>Public APIs </li>\r\n    <li>Web service methods </li>\r\n    <li>DCOM methods </li>\r\n    <li>Network ports </li>\r\n    <li>UI input fields </li>\r\n    <li>File input (can take the form of configuration, data, or serialization information) </li>\r\n    <li>Registry input</li>\r\n  </ul>\r\n  <p>As you explore the set of entry points look for the ability to provide string input or data that may be used to calculate a buffer.</p>\r\n  <p>Some examples of string input entry points are:</p>\r\n  <ul>\r\n    <li>Web application UI input field such as username, password, or search box. </li>\r\n    <li>Thick client application UI input field such as configuration options, search, or username </li>\r\n    <li>Public API with a string parameter type </li>\r\n    <li>String data in a file </li>\r\n    <li>String data in a registry key </li>\r\n    <li>String data in a network packet</li>\r\n  </ul>\r\n  <p>There are a couple of common scenarios in which input data may be used to calculate a buffer:</p>\r\n  <ul>\r\n    <li>Public API that contains a parameter indicating size of a buffer parameter. For instance:\r\n  <pre>char *myCopy(byte *byteBuf, int bufSize);</pre></li>\r\n    <li>File formats that contain field lengths as part of the format. For instance:\r\n  <pre>Field1Length,Field1,Field2Length,Field2</pre><p>Which in the file would look like:</p><pre>3,ABC,6,ABCDEF</pre></li>\r\n    <li>Network protocols that contain field lengths as part of the format. This is very similar to the file example shown above.</li>\r\n  </ul>\r\n  <h1>2. Craft attack data for an entry point</h1>\r\n  <p>When crafting attack data for an input that may be used to calculate an internal buffer size you should try the following:</p>\r\n  <ul>\r\n    <li>0 </li>\r\n    <li>-1 </li>\r\n    <li>Maximum size allowed by the datatype </li>\r\n    <li>Minimum size allowed by the datatype</li>\r\n  </ul>\r\n  <p>If the input is a length parameter on an API that is tied to a buffer that you are also passing to the API you should additionally try the following:</p>\r\n  <ul>\r\n    <li>Size of buffer - 1 </li>\r\n    <li>Size of buffer + 1</li>\r\n  </ul>\r\n  <p>If the input is a length identifier in a network protocol or file format you should additionally try the following:</p>\r\n  <ul>\r\n    <li>Size of existing value - 1 </li>\r\n    <li>Size of existing value + 1</li>\r\n  </ul>\r\n  <p>When crafting attack data for a string input you should try the following:</p>\r\n  <ul>\r\n    <li>String composed entirely of the character 'a' of size 10,000. </li>\r\n    <li>Random string of size 10,000 characters. </li>\r\n    <li>If the application rejects due to size constraints, vary the size of the string until you understand the constraint. Try a string size exactly at the constraint, one over the constraint, and one under the constraint. </li>\r\n    <li>If the application accepts the string but shows no failure symptoms increase the size of the string until you can ascertain failure or rejection based on size.</li>\r\n  </ul>\r\n  <p>Important: If the input has to conform to a known format construct your string input around this format. Apply the 4 steps above between each delimiter of the format independently and in combination. For instance if you were testing an url format of 'http://sitename/dirname' you would do the following:</p>\r\n  <pre>LONGSTRING://sitename/dirname<br />http://LONGSTRING/dirname<br />http://sitename/LONGSTRING<br />LONGSTRING://LONGSTRING/LONGSTRING</pre>\r\n  <p>If you don't know the format to which the string input must conform you can:</p>\r\n  <ul>\r\n    <li>Look for explanatory error messages </li>\r\n    <li>Use random strings to explore the possibilities </li>\r\n    <li>Use standard delimiters such as\r\n  <p>, . ; : ' \"</p></li>\r\n    <li>Explore specifications to learn more about the application </li>\r\n    <li>Explore source code or assembly code to learn how the input data is parsed and copied to various internal buffers</li>\r\n  </ul>\r\n  <p>Data fuzzing is a powerful technique to automate the creation of attack strings. Data fuzzing relies on the modification of existing files or network packets in order to start from a known good format and produce input that is most likely to discover a buffer overrun. Some effective techniques which do not require the automation to be format aware are, randomly select a byte or bytes and:</p>\r\n  <ul>\r\n    <li>Add one to the value </li>\r\n    <li>Subtract one from the value </li>\r\n    <li>Replace with a bitwise XOR of the original value </li>\r\n    <li>Insert additional bytes at this location </li>\r\n    <li>Replace with a random byte </li>\r\n    <li>Replace a random number of bytes starting at this location </li>\r\n    <li>Insert a 0 </li>\r\n    <li>Replace with a 0 </li>\r\n    <li>Pick another random byte and transpose</li>\r\n  </ul>\r\n  <h1>3. Pass attack data to an entry point</h1>\r\n  <p>It is possible to manually test for buffer overruns. However, due to the large number of variations in attack strings and the ease of automation it is preferable to use automation that can pass your attack strings to the target interface. This is easier with programmatic methods such as an API or web service but is also possible with UI. A combination of automated attack generation and automated attack execution can allow your automation to find buffer overruns while you focus on other tasks. </p>\r\n  <h1>4. Look for application crashes</h1>\r\n  <p>When an application crashes due to a buffer overrun attack it is necessary to investigate further to determine if the crash is due to a buffer overrun.</p>\r\n  <p>To make it as easy as possible to investigate crashes, run your buffer overrun tests while the application is under a debugger. This allows you to more easily determine the reason for the crash, inspect the stack, inspect the heap and inspect your processor's registers for evidence of your attack string.</p>\r\n  <p>A common crash that occurs when applying a buffer overrun attack, which is not in fact a buffer overrun, is the null dereference. If you see your application has crashed due to a null dereference it is unlikely you have discovered a buffer overrun.</p>\r\n  <p>If you see pieces of your attack string on the heap you are likely to have discovered a heap-based buffer overrun.</p>\r\n  <p>If you see pieces of your attack string on the stack you are likely to have discovered a stack-based buffer overrun.</p>\r\n  <p>If you see pieces of your attack string in process registers you are very likely to have discovered a buffer overrun that is exploitable.</p>\r\n  <p>If you see pieces of your attack string in the EIP process register you have discovered a buffer overrun and it is exploitable.</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}