{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "554415607",
      "Content_Hash": "-1076714179"
    },
    "Metadata": [
      {
        "Id": [
          "c00b9149-1290-4c9e-bcd0-392a9c5a6fb0"
        ],
        "Id_History": [
          "c00b9149-1290-4c9e-bcd0-392a9c5a6fb0,f5a2abec-542e-4726-9287-e1bdd110d8fa,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Path Manipulation Bugs in Java"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Path Manipulation Bugs in Java"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>J2EE applications</li>\n  </ul>\n  <h1>Summary</h1>\n  <p>In a path manipulation attack, an attacker submits input to alter an internal file path used by the application, forcing the application to use a malicious path. Attackers may exploit this bug to read sensitive files on the server, such as configuration files or another user’s files, or to modify or delete server-side files. </p>\n  <p>Follow these steps to test for path manipulation bugs in J2EE:</p>\n  <ul>\n    <li>Step 1: Understand attack scenarios </li>\n    <li>Step 2: Analyze causes and countermeasures </li>\n    <li>Step 3: Start testing and exploring </li>\n    <li>Step 4: Execute additional testing</li>\n  </ul>\n  <h1>Step 1: Understand Attack Scenarios</h1>\n  <p>The first step in testing for path manipulation bugs is to understand the anatomy of an attack scenario. </p>\n  <p>To exploit this vulnerability, the attacker manipulates a file path in an HTTP request. If the application is vulnerable, it uses the manipulated file path to perform a file system operation.</p>\n  <p>The attack starts with the attacker discovering an HTTP request that invokes a server-side file system operation such as reading, modifying, deleting, emailing, or printing a file. This request comes either from a Web page or from a client-side script (such as in AJAX applications) and contains a variable (URL parameter, Web form input, etc) that the server uses to determine what file to handle.</p>\n  <p>To execute the attack, the attacker submits the request but modifies this variable in an attempt to manipulate a server-side file. If the attack is successful, the value provided by the attacker causes the server to access a file in a different path. In most cases, the attacker will be able to tell if the attack is successful shortly after executing it.</p>\n  <p>The steps are then:</p>\n  <ol>\n    <li>The attacker finds an HTTP request that invokes a file system operation at the server. </li>\n    <li>The attacker locates a variable in&nbsp;that HTTP request that is used to determine the path for a file system operation. </li>\n    <li>The attacker submits the request but modifies the path-determining variable and waits for a server response. </li>\n    <li>The attacker verifies if the attack is successful by observing the server’s response. </li>\n  </ol>\n  <h2>\n    <em>\n      Attack Variants</em>\n  </h2>\n  <p>Attackers can employ path manipulation attacks to achieve different threats. For example, an attacker can manipulate a path to read server configuration and password files or to read files belonging to another user in order to execute an information disclosure attack on the application. Similarly, an attacker can manipulate a path to force the J2EE application to delete a file needed to properly service its users, thus generating a denial of service situation.</p>\n  <h1>Step 2: Analyze Causes and Countermeasures</h1>\n  <p>Before executing practical test cases, it is necessary to understand why these bugs exist and how to avoid them.</p>\n  <p>Path manipulation bugs are caused by J2EE applications that use client-supplied input to build a file path without properly validating the input. For instance, the code below gets an input value from the user in a URL parameter named <i>filename</i>:</p>\n  <pre>PrintWriter out = response.getWriter();<br />String filename = \"/public/user_files/\" + request.getParameter(\"filename\").toString();<br />File file = new File(filename);<br />FileReader fr = new FileReader(file);<br />BufferedReader br = new BufferedReader(fr);<br />String line = br.readLine();<br />while ( line != null )<br />{<br />\tout.println(line);<br />&nbsp;&nbsp; \tline = br.readLine();<br />}<br />fr.close();<br />out.close();</pre>\n  <p />\n  <p>If the user provides an expected file name such as <i>file.txt</i>, the application returns an expected user file:</p>\n  <pre>http://example.com.pe/example/getFile?filename=<strong>file.txt</strong></pre>\n  <p>\n    <b>\n    </b>\n  </p>\n  <p>However, in a path manipulation scenario, an attacker provides a malicious value for the variable, hoping that the application uses it to determine a different file path:</p>\n  <pre>http://example.com.pe/example/getFile?filename=<strong>../../private/secret.txt</strong></pre>\n  <p>\n    <b>\n    </b>\n  </p>\n  <p>The string above causes the application to go up two directories, navigate to the <i>private</i> folder, and display <i>secret.txt.</i> The example above is a common scenario in information disclosure due to path manipulation. Notice that the attack is possible because the code shown trusts the filename provided by the client; it starts by directly copying the input to the internal variable used to determine the filename without properly validating it.</p>\n  <p>To protect against this bug, J2EE applications must properly validate user input. Specifically, they must check if the input is safe to use in determining a file path. Developers can use blacklists that contain a list of all disallowed filename constructs such as <em>../</em> and check if the user input appears in the blacklist. The problem with blacklists is that blacklists must account for 100% of attack variants to be effective. Any variant of an attack that is not accounted for will execute unnoticed.</p>\n  <p>As such, the recommended approach for defending against this bug is to use <i>whitelists. </i>Whitelists specify only safe constructs, and disallow any user input that doesn’t match any of the specified safe constructs. By doing this, they only need to specify what is good and don’t have to worry about accounting 100% of all attack variants. A common way of implementing a whitelist is by using a regular expression to specify what is safe and to disallow all input that doesn’t match the regular expression:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n  <pre>String input = request.getParameter(\"filename\").toString();<br />String safeConstruct = \"^[a-zA-Z]{4,8}\\.txt$\";<br />Pattern regexPattern = Pattern.compile(safeConstruct);<br />Matcher regexMatcher = regexPattern.matcher(input);<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br />if (!regexMatcher.find())<br />{<br />\tout.println(\"invalid input\");<br />}<br />else&nbsp; <br />{<br />\tString filename = \"/public/user_files/\" + input; <br />&nbsp;\tFile file = new File(filename);<br />\t&nbsp;<br />\t/* continue reading file */<br />}</pre>\n  <p>The input must consist of four to eight consecutive upper- or lower-case letters followed by the extension <em>.txt</em>. Any input that doesn’t match this form results in the application giving an <i>invalid input</i> error.</p>\n  <h1>Step 3: Start Testing and Exploring</h1>\n  <p>Now that you’ve learned the common attack scenarios as well as the causes and countermeasures for path manipulation bugs, it is necessary to execute basic test cases to check if your application is vulnerable.</p>\n  <p>Success in testing for path manipulation bugs depends on your ability to determine what variables the application uses to build a file path. Applications commonly use URL and Web form variables, so it is necessary to understand how to test through these two input points. </p>\n  <h2>\n    <em>Test for path manipulation in URL variables</em>\n  </h2>\n  <p>Follow these steps to test for path manipulation in an URL variable:</p>\n  <ol>\n    <li>Use an Internet browser to perform a file system operation. Note the URL used, such as: <i>http://example.com.pe/example.jsp?<b>page=index.html</b></i>. </li>\n    <li>Locate the URL variable used to by the application to determine the file name (in this case it is <i>page</i>). </li>\n    <li>Replace the value of the variable found in Step 2 with an attack string (see Table 1 below). For instance: <i>http://example.com.pe/example.jsp?page<b>=</b>../../../etc/passwd</i>. </li>\n    <li>Submit the request to the application and wait for a response.</li>\n  </ol>\n  <p>Expected results: The application must give an error message indicating that the file path has been manipulated. The application is vulnerable if it uses the path supplied in Step 3 to determine the response, and the attacker-specified file is used in the response.</p>\n  <h2>\n    <em>Test for path manipulation in Web form variables</em>\n  </h2>\n  <p>Follow these steps to test for path manipulation through Web forms:</p>\n  <ol>\n    <li>Navigate to a page containing a Web form that prompts for a file name. </li>\n    <li>Locate the variable (input field) used by the application to determine the file name. </li>\n    <li>Enter the attack string in the field that indicates the filename (see Table 1 below).<br />Here, it is important to disable any client-side checks that may deny entering an attack string due to illegal characters.<br /></li>\n    <li>Submit the request to the application and wait for a response.</li>\n  </ol>\n  <p>Expected results are the same as the previous test case: The application must give an error message indicating that the file path has been manipulated. The application is vulnerable if it uses the path supplied in Step 3 to determine the response, and the attacker-specified file is used in the response.</p>\n  <h2>\n    <em>Attack strings</em>\n  </h2>\n  <p>The following attack strings contain path manipulation characters (dots, slashes, and backslashes) and common UNIX- and Windows-related file paths in different encodings. Depending on the relative location of the Web application on the server, the number of “../” or “..\\” clauses may need to be increased or decreased to realize an attack:</p>\n  <table>\n    <tbody>\n      <tr>\n        <td>\n          ../etc/passwd<br />..\\boot.ini<br />../boot.ini<br />folder_name/file_name<br />..\\..\\folder_name\\file_name<br />../../folder_name/file_name<br />C:\\boot.ini<br />%2e%2e\\%2e%2e\\<br />..%2f..%2f<br />%2e%2e%2f%2e%2e%2ffolder_name%2ffile_name<br />..%2f..%2ffolder_name%2ffile_name<br />..%c0%af..%c0%affolder_name..%c0%affile_name\n        </td>\n      </tr>\n    </tbody>\n  </table>\n  <p>&nbsp;<b>Table 1 - Path Manipulation Attack Strings</b></p>\n  <h2>\n    <em>Look for error messages that indicate file operations</em>\n  </h2>\n  <p>While executing the basic test cases mentioned above, it is important to look for different types of error messages. For instance, “invalid input” or “incorrect format” error messages indicate that an application is safe, while “file not found” or HTTP 404 errors indicate that the application may be using the attack string to find a file in a different path, and may be vulnerable to this bug.</p>\n  <h1>Step 4: Execute Additional Testing</h1>\n  <p>Finally, it is important to execute additional testing for double encoding scenarios as well as to cover all of the application’s input points.<b><i></i></b></p>\n  <h1>\n    <em>Cover double encoding scenarios</em>\n  </h1>\n  <p>Since this attack requires passing malicious input to a Web application, it is necessary for proper coverage to add double encoding test cases. Double encoding consists of re-encoding the percent sign (<em>%</em>) in percent-encoded values with its percent-encoded equivalent (<em>%25</em>). For instance, translating the first URL into the second one:</p>\n  <pre>../../&nbsp; (no encoding)\n..%2f..%2f&nbsp;&nbsp;&nbsp;&nbsp; (single encoding)\n..%252f..%252f (double encoding)</pre>\n  <p>Make sure to add a double-encoded test case for every attack string that you use.<em></em></p>\n  <h2>\n    <em>Test through all input points</em>\n  </h2>\n  <p>Even though path manipulation attacks commonly happen through the URL or Web forms, it is important to look at additional application input points. Web applications can also take input from client cookies, Web methods, extended frameworks (such as Flash/Flex), and third-party APIs (such as Facebook) parameters. Make sure to test for path manipulation in every place where input is taken.</p>\n  <h1>Conclusions</h1>\n  <p>Path manipulation bugs allow attackers to access a server-side file to execute attacks such as information disclosure and denial of service. They&nbsp;can be&nbsp;successful when applications don’t properly validate user input against a whitelist and allow path manipulating characters such as dots and slashes to be processed by the application. To test for this vulnerability, you must identify the file path determining variable, commonly sent in the URL or in a Web form, and replace it with an attack string while looking for an error message that indicates that the attack string is being used. Finally, to achieve proper test coverage of this bug, be sure to cover double encoding scenarios and test through all of the application’s input points.</p>\n  <br />"
        ]
      }
    ]
  }
}