{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "77126263",
      "Content_Hash": "-1392675402"
    },
    "Metadata": [
      {
        "Id": [
          "c9b14bf5-5988-4b25-8654-5843c5ec965c"
        ],
        "Id_History": [
          "c9b14bf5-5988-4b25-8654-5843c5ec965c,0720fc8c-55d0-47d5-9163-389826830dab,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Dictionary Attacks"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Dictionary Attacks"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\r\n    <span>Summary</span>\r\n  </h1>\r\n  <p>A dictionary attack is a cryptographic attack where an attacker attempts to defeat cryptographic ciphers by trying numerous decryption keys or passphrases from a dictionary.<span></span>Dictionaries are a list of possible keys and words to be tried while attempting to defeat the cryptographic cipher.<span></span><span></span>Dictionary attacks are also applicable to applications that use credentials to log in their clients. <span></span>The attack is similar to the cryptanalytic attack with the difference that credential dictionary attacks focus at finding a valid password to bypass authentication, so dictionaries consist of possible password values instead of key or passphrase values.</p>\r\n  <p>Follow these steps to learn how to test for dictionary attacks:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios</li>\r\n    <li>Step 2: Analyze causes and countermeasures</li>\r\n    <li>Step 3: Execute test cases</li>\r\n  </ul>\r\n  <h1>\r\n    <span>Step 1: Understand Attack Scenarios </span>\r\n  </h1>\r\n  <p>First, it is necessary to understand the different attack scenarios involved:</p>\r\n  <ul>\r\n    <li>Cryptographic dictionary attack</li>\r\n    <li>Credentials dictionary attack</li>\r\n    <li>Encrypted password cracking attack</li>\r\n  </ul>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        <span>\r\n        </span>\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <h2>\r\n    <span>\r\n      <em>Cryptographic Dictionary Attack</em>\r\n    </span>\r\n  </h2>\r\n  <p>In contrast to brute-force attacks, in which numerous keys and passphrases are created systematically by performing an exhaustive search over the possible key space, dictionary attacks only try the possibilities supplied by the dictionary.<span></span>Thus, the attack always starts with the attacker building the dictionary list or file that will be used to defeat the cryptographic system.<span></span>The attacker then finds a ciphertext to decrypt into a known (in case of known-plaintext attacks) or an unknown plaintext (in case of ciphertext-only attacks).<span></span>The attack continues with the attacker passing each of the keys in the attack dictionary to the decryption function in order to find a valid decryption key.</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>The attacker builds an attack dictionary consisting of a list of possible keys/passphrases to use while trying to defeat the cryptographic system.</li>\r\n    <li>The attacker finds a ciphertext to decipher.<span>&nbsp; </span></li>\r\n    <li>The attacker iterates through the attack dictionary trying to decrypt the ciphertext with each of the dictionary entries.</li>\r\n  </ol>\r\n  <h2>\r\n    <span>\r\n      <em>Credentials Dictionary Attack</em>\r\n    </span>\r\n  </h2>\r\n  <p>The credentials dictionary attack scenario is similar to the previous one with the difference that the attacker is trying to circumvent authentication instead of trying to break cryptography.<span></span>Thus, the attacker’s goal is to find valid credentials like a valid password instead of finding a decryption key.<span></span>The attack starts with the attacker selecting a valid username for the target user.<span></span>Valid usernames can be leveraged using registration pages or by social engineering.<span></span>Then the attack follows a similar flow of the previous scenario.<span></span>The attacker builds of a dictionary containing a list of possible passwords.<span></span>A resourceful attacker would also mutate the dictionary by substituting letters<span></span>by numbers or applying similar mutations.<span></span>Then the attacker locates the authentication request such as one made by a log in web page.<span></span>The attack continues with the attacker passing each of the passwords in the dictionary to the log in procedure in order to find a password that works and enables the attacker to log in to the target application.<span>&nbsp; </span></p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>The attacker selects the target client to attack and discovers the target’s username.</li>\r\n    <li>The attacker constructs the attack dictionary consisting of possible password values.</li>\r\n    <li>The attacker iterates through the attack dictionary trying to log in to the application with each of the dictionary entries.</li>\r\n  </ol>\r\n  <h2>\r\n    <span>\r\n      <em>Encrypted Password Cracking</em>\r\n    </span>\r\n  </h2>\r\n  <p>Sometimes the attacker’s goal is not to recover a valid key or password but an encrypted/hashed version of the target password.<span></span>This scenario is common when attackers have access to a password file containing a set of password hashes like the UNIX password file in which passwords appear as DES hashes or when sniffing a network connection shows passwords being transferred after they have been hashed/encrypted.<span>&nbsp;&nbsp; </span></p>\r\n  <p>&nbsp;</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>The attacker gains access to a password file or a network capture showing a hashed or encrypted version of the target password and the cryptographic algorithm used to hash/encrypt the value.</li>\r\n    <li>The attacker constructs the attack dictionary consisting of possible password values.</li>\r\n    <li>For each entry in the attack dictionary the attacker:</li>\r\n  </ol>\r\n  <ul>\r\n    <ul>\r\n      <li>hashes or encrypts the entry using the algorithm discovered in step 2.</li>\r\n      <li>compares the hashed/encrypted password with the target password from step 1.</li>\r\n    </ul>\r\n  </ul>\r\n  <p>&nbsp;</p>\r\n  <h1>\r\n    <span>Step 2: Analyze Causes and Countermeasures</span>\r\n  </h1>\r\n  <p>Next, it is necessary to understand what causes dictionary attacks and how to countermeasure them.<span>&nbsp; </span></p>\r\n  <h2>\r\n    <span>\r\n      <em>Attack causes</em>\r\n    </span>\r\n  </h2>\r\n  <p>Cryptographic dictionary attacks exist by design.<span></span>This issue cannot be identified in code since it’s an attack method rather than an implementation flaw.<span>&nbsp; </span>In most cases attackers will have access to the decryption function as well as the ciphertext.<span></span>These are the only two requirements to start a dictionary attack and, since developers are encouraged to use a public cryptographic algorithm instead of implementing their own, this attack is innate in cryptographic applications which follow security best practices.<span>&nbsp; </span></p>\r\n  <p>&nbsp;</p>\r\n  <h2>\r\n    <span>\r\n      <em>Attack countermeasures</em>\r\n    </span>\r\n  </h2>\r\n  <p>For cryptanalytic dictionary attacks that target recovering a key rather than a password, choosing a large enough key reduces the likelihood of the decryption key being found by a dictionary attack.<span></span>Applications that implement cryptography use keys of a certain length (measured in bits) that determines the possible keys combinations -or key space.<span></span>For instance, a 64-bit key has 2^64possible key combinations.<span></span>The larger the decryption key the more difficult to construct a dictionary that includes it.<span>&nbsp; </span></p>\r\n  <p>To protect against dictionary attacks on passwords, or similar variations such as attacks through OS password files, it is recommended to avoid using words available in dictionaries or common variation of dictionary words or names such as “h0us3” for “house” or “3ric” for “Eric”.<span>&nbsp;&nbsp; </span>Applications must enforce a strong-password policy with complexity requirements that limit the chances of passwords existing in attack dictionaries. Additional ways to countermeasure <i>credential</i> dictionary attacks such as using locking down accounts, introducing time delays to the log in process, asking for human interaction proofs such as CAPTCHAs or secret questions, or executing different behaviors after a number of failed attempts.<span></span>Note that these countermeasures are only applicable to credential dictionary attacks and not for cryptographic attacks.<span></span><br /></p>\r\n  <h1>\r\n    <span>Step 3: Execute Test Cases</span>\r\n  </h1>\r\n  <p>Now that you’ve reviewed the theoretical aspects of dictionary attacks this step focuses at executing practical test cases to check if your application is vulnerable to this attack.</p>\r\n  <h2>\r\n    <em>Test for Cryptographic Dictionary Attack (Known-Plaintext)</em>\r\n  </h2>\r\n  <p>Follow these steps to test for dictionary attacks using a known-plain text attack:</p>\r\n  <ol>\r\n    <li>Build a dictionary list containing a set of possible decryptions keys.</li>\r\n    <li>Discover a ciphertext <i>C </i>and its corresponding plaintext <i>P</i>, as well as the decryption function that was used to decrypt the plaintext using the unknown decryption key <i>K</i>:<span>&nbsp; </span><ul><li><i><span>&nbsp;</span>P =<span>&nbsp; </span><span>&nbsp;</span>decrypt(C, K)).</i></li></ul></li>\r\n    <li>Iterate though all keys in the dictionary.<span>&nbsp; </span><ul><li>For each key in the dictionary <i>K’</i>, execute the decryption algorithm using the ciphertext discovered in the previous step:<span>&nbsp; </span><i>P’ = decrypt (C, K’).</i></li><li>Check if the plaintext <i>P’</i> produced with the current key <i>K’</i> recovers the plaintext discovered in the previous step:<span>&nbsp; </span><i>P’= P?</i><span>&nbsp;&nbsp; </span></li></ul></li>\r\n  </ol>\r\n  <p>Expected results: the application is vulnerable if it is possible to find a valid key in a reasonable amount of time.<em>&nbsp;</em></p>\r\n  <h2>\r\n    <em>Test for Cryptographic Dictionary Attack (Ciphertext-Only)</em>\r\n  </h2>\r\n  <p>Follow these steps to test for dictionary attacks using a ciphertext-only attack:</p>\r\n  <ol>\r\n    <li>Build a dictionary list containing a set of possible decryptions keys.</li>\r\n    <li>Discover a ciphertext <i>C </i>as well as the target decryption function.</li>\r\n    <li>Iterate though all keys in the dictionary.<span>&nbsp; </span><ul><li><span><span>a.<span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span></span></span>For each key in the dictionary <i>K’</i>, execute the decryption algorithm using the ciphertext discovered in the previous step:<span>&nbsp; </span><i>P’ = decrypt (C, K’).</i></li><li><span><span>b.<span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span></span></span>Check if the plaintext <i>P’</i> is readable.<span>&nbsp;&nbsp; </span></li></ul></li>\r\n  </ol>\r\n  <p>Expected results: the application is vulnerable if it is possible to find a valid key in a reasonable amount of time.</p>\r\n  <p>&nbsp;</p>\r\n  <h2>\r\n    <em>Test for Credential Dictionary Attacks</em>\r\n  </h2>\r\n  <p>Follow these steps to test for dictionary attacks:</p>\r\n  <ol>\r\n    <li>Leverage a valid username for the target client.</li>\r\n    <li>Construct a dictionary file containing a list of possible passwords.</li>\r\n    <li>Download and install Brutus (<a href=\"http://www.hoobie.net/brutus/\">http://www.hoobie.net/brutus/</a>).<span>&nbsp; </span>Other password cracking tools can be used.</li>\r\n    <li>Run Brutus.</li>\r\n    <li>Type a target URL and authentication type.</li>\r\n    <li>In the <b>Pass Mode</b> dropdown list, select Word List.</li>\r\n    <li>Browse for the dictionary file created in step 2.</li>\r\n    <li>Click <b>Start</b>.</li>\r\n  </ol>\r\n  <p>Expected result: Brutus displays any matches in the<b> Positive Authentication Results</b> list box.&nbsp;<b><i></i></b></p>\r\n  <p>\r\n    <b>\r\n      <i>&nbsp;</i>\r\n    </b>\r\n  </p>\r\n  <h2>\r\n    <em>Test for Hashed/Encrypted Password Cracking</em>\r\n  </h2>\r\n  <p>Follow these steps to test for hashed/encrypted password cracking attacks:</p>\r\n  <ol>\r\n    <li>Discover a hashed/encryption password of a known username.</li>\r\n    <li>Build a dictionary list containing a set of possible passwords</li>\r\n    <li>Discover the cryptographic algorithm used to produce the hashed/encrypted password (DES, AES, or other industry standard).</li>\r\n    <li>Iterate though all values in the dictionary.<span>&nbsp; </span><ul><li>For each password in the dictionary, execute the hashing/encryption algorithm to hash/encrypt the current value.</li><li>Check if the hashed/encrypted value equals the one from step 1.<span>&nbsp;&nbsp; </span></li></ul></li>\r\n  </ol>\r\n  <p>Expected results: the application is vulnerable if it is possible to find a valid password in a reasonable amount of time.</p>\r\n  <p>\r\n    <b>\r\n      <i>&nbsp;</i>\r\n    </b>\r\n  </p>\r\n  <h1>\r\n    <span>Conclusions</span>\r\n  </h1>\r\n  <p>Dictionary attacks focus at discovering a valid key from a predetermined list of possible keys.<span></span>The attack is trivial is it only requires the attacker to discover the encryption algorithm in place and a ciphertext and iterate through the key dictionary trying to produce a readable plaintext from each of the possible keys.<span></span>In the credentials scenario, the attack is similar but instead of trying to defeat a cryptographic procedure it aims at circumventing authentication by trying a dictionary of possible password values.<span></span>Even though this attack is innate to cryptographic systems and authentication procedures, methods to countermeasure this attack include using a large enough key and an industry standard algorithm such as AES, a strong password, account lockout policies, time delays, or human interaction proofs.<span></span>Testing varies depending on whether a plaintext is known or not and on the type of target system (cryptographic vs. credentials).</p>\r\n  <p />\r\n  <p>&nbsp;</p>\r\n  <p />"
        ]
      }
    ]
  }
}