{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1330046687",
      "Content_Hash": "-1027738887"
    },
    "Metadata": [
      {
        "Id": [
          "cecf3a82-0419-4221-841d-cc8007c2cc27"
        ],
        "Id_History": [
          "cecf3a82-0419-4221-841d-cc8007c2cc27,eef7a78b-5a46-4c5d-bbe9-4da09d295fcb,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Canonicalization Bugs"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Canonicalization Bugs"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\r\n    Applies to\r\n  </h1>\r\n  <p>\r\n    This type of bug is common in applications that interact with the file system based on untrusted data, including:\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      Web application and services with file upload and download capabilities.\r\n    </li>\r\n    <li>\r\n      Internet web servers such as Apache and IIS that resolve file names.\r\n    </li>\r\n    <li>\r\n      Web-related scripts and languages such as CGI, JavaScript, VB Script, Java, ASP, PHP, and C#.\r\n    </li>\r\n    <li>\r\n      Managed and unmanaged network applications that do file manipulation based on user input.\r\n    </li>\r\n  </ul>\r\n  <p>\r\n    &nbsp;\r\n  </p>\r\n  <h1>\r\n    Summary\r\n  </h1>\r\n  <p>\r\n    Software applications represent file names and directories in different ways, and a given file can often be referred to in a number of ways.&nbsp; Using Microsoft Windows as an example, let’s look at a folder named “private” in the C: drive. The most common way to refer to it is:\r\n  </p>\r\n  <pre>C:\\private</pre>\r\n  <p>\r\n    It can also be called:\r\n  </p>\r\n  <pre>C:\\\\private</pre>\r\n  <p>\r\n    or (if the current working directory is the root of the C: drive):\r\n  </p>\r\n  <pre>\".\\private\" </pre>\r\n  <p>\r\n    If an application wants to stop an attacker from writing files to that directory, they can take a number of approaches, including building lists of what’s not allowed (blacklisting), building lists of what is allowed (white listing), relying on file system ACLs, and disallowing direct file system access entirely.&nbsp; The problems start, however, with making sure that a user-provided file name and path actually point where you think they do.&nbsp; Similar issues apply in many classes of vulnerabilities, including cross-site scripting, SQL injection, and command injection; but we’ll be looking at file access and directory traversal issues here.\r\n  </p>\r\n  <p>\r\n    These are the steps to test for canonicalization bugs:\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      <b>\r\n        Step 1\r\n      </b>\r\n      :&nbsp; Understand canonicalization attack scenarios.\r\n    </li>\r\n    <li>\r\n      <b>\r\n        Step 2\r\n      </b>\r\n      :&nbsp; List high risk components and entry points.\r\n    </li>\r\n    <li>\r\n      <b>\r\n        Step 3\r\n      </b>\r\n      :&nbsp; Start testing and exploring.\r\n    </li>\r\n    <li>\r\n      <b>\r\n        Step 4\r\n      </b>\r\n      :&nbsp; Tune test case data.\r\n    </li>\r\n  </ul>\r\n  <p>\r\n    &nbsp;\r\n  </p>\r\n  <h1>\r\n    Step 1: Understand Canonicalization Attack Scenarios\r\n  </h1>\r\n  <p>\r\n    The goal of an attacker performing a canonicalization attack is to convince whatever software is doing the filtering that they’ve submitted a good string, when they’ve actually submitted a dangerous one.&nbsp; When dealing with file names, the file system provides one level of obscurity that the attacker can exploit.&nbsp; In web based systems, the different character encodings used on the web provide a second layer of obscurity.&nbsp; These two levels represent the most common canonicalization attacks today, so we’ll concentrate on them.&nbsp; Here are two sample attacks, one involving each layer:\r\n  </p>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        File system-based canonicalization attacks\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n    A Windows server-side application asks its users for a file path and displays the file contents.&nbsp; It uses a critical directory named “\r\n    private\r\n    ” on the root of the file system (\r\n    C:\\private\r\n    ).&nbsp; The server protects this directory by checking if submitted paths contain the substring \r\n    private\r\n    . \r\n  </p>\r\n  <p>\r\n    The attacker tries the strings below but the system rejects them because they all contain “\r\n    private\r\n    ”\r\n    .\r\n  </p>\r\n  <pre>c:\\private\r\nc:\\private\\\r\n..\\private\r\n ..\\..\\private\r\nc:/private\r\n  </pre>\r\n  <p>\r\n  </p>\r\n  <p>\r\n    However, the attacker can supply a short file name in 8.3 format:\r\n  </p>\r\n  <pre>C:\\privat~1</pre>\r\n  <p>\r\n    Since the string above doesn’t contain “\r\n    private\r\n    ” it is not part of the application blacklist.&nbsp; Thus, the application allows the attacker access to the protected folder.\r\n  </p>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        Understand web encodings\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n    All data on the web is fundamentally strings of text.&nbsp; Different contexts, such as HTML, JavaScript, or URLs, have different characters which they use as delimiters or which otherwise have special meaning.&nbsp; In order for applications to understand where strings start and end, strings which contain those delimiter characters must be encoded.&nbsp; This encoding provides an opportunity for an attacker to fool the system.\r\n  </p>\r\n  <p>\r\n    Data is encoded and decoded at different times, depending on what’s going on.&nbsp; A web application needs to perform HTML encoding during page generation - failure to do this correctly is a key source of cross-site scripting problems, for example. When a browser submits a URL to a web server, it URL encodes the string before sending it.\r\n  </p>\r\n  <p>\r\n    Suppose we have a web site where a user wants to represent themselves with a name that includes the special characters “&” and “/”:\r\n  </p>\r\n  <pre>www.example.com/name=&foo/bar</pre>\r\n  <p>\r\n    The user chooses the name <b>&foo/bar</b> which uses the ampersand and the forward slash, both of which have special meaning in URLs.&nbsp; If the data was sent exactly as above, the web server would interpret the name as something entirely different, and would not take the intended action.&nbsp; Instead, the string is sent in the URL encoded form as follows:\r\n  </p>\r\n  <pre>www.example.com/name=%26foo%2Fbar</pre>\r\n  <p>\r\n    In URL encoding, the ‘%’ character is used to encode an otherwise unrepresentable character.&nbsp; The string after the percent references a specific character as a hexadecimal number.&nbsp; The web server on the other end automatically decodes the string to recover the original version, and this is where the problem lies.\r\n    <b><i></i></b></p>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        URL encoding-based canonicalization attacks\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n    Most of the time, a URL is mapped to the file system by a web server.&nbsp; This has the effect of making the list of alternate versions of a file name listed in the previous attack much longer.&nbsp; For example, let’s say that the application in the previous example also has a web front end, hosted out of the directory C:\\inetpub\\wwwroot\\app\\.&nbsp; An attacker could submit the following URL to try to gain access to the protected C:\\private directory:\r\n  </p>\r\n  <pre>http://www.example.com/app/../../../private</pre>\r\n  <p>\r\n    There are a number of different ways to attempt to filter out URLs like this.&nbsp; For example, the server could filter out the slashes after the dots.&nbsp; However, if they perform this action on the raw URL and then decode it, the attacker can use an alternate representation of the slashes, via URL encoding:\r\n  </p>\r\n  <pre>http://www.example/com/app/..%2f..%2f../private</pre>\r\n  <p>\r\n    One obvious way to fix this would be to just extend the blacklist above to cover the encoded versions of the characters as well.&nbsp; However, this can lead to issues at multiple levels.&nbsp; First, when one adds Unicode representations of strings into the mix, the number of ways that one can encode a string becomes much larger.&nbsp; Second, even if one could generate a list, there are problems with different layers of the system interpreting the same string in different ways - a number of high profile security issues (including at least one for Microsoft’s IIS versions 4 and 5) have been caused by systems misinterpreting malformed Unicode representations of characters.&nbsp; On one of those systems, the following string would have worked:\r\n  </p>\r\n  <pre>http://www.example/com/app/..%C0%AF..%C0%AF../private</pre>\r\n  <p>\r\n    As the systems in question only checked the encoded string and didn’t do any checks after decoding, this issue allowed an attacker to completely compromise a machine - a URL like the following could&nbsp; execute arbitrary commands (in this case, to perform a director listing, but more dangerous payloads are trivial):\r\n  </p>\r\n  <pre>http://www.example.com/app/..%c0%af..%c0%af..winnt/system32/cmd.exe?/c+dir</pre>\r\n  <h1>\r\n    Step 2: &nbsp;List high risk components and entry points\r\n  </h1>\r\n  <p>\r\n    Now that you understand the attacks at a high level, you must look at the specific server side flaws which contribute to this problem.&nbsp; After understanding the problems in detail, you can look through your application and determine high risk components and entry points, and then begin testing.\r\n  </p>\r\n  <h2>\r\n    Identifying problems and mitigations\r\n  </h2>\r\n  <p>\r\n    Understanding the different ways that this problem is manifested in source code, and what the mitigations look like is an important step towards being able to identify where those problems may lay in your application.\r\n  </p>\r\n  <p>\r\n    <b>\r\n      <i>Decisions made too soon (based a non-canonical interpretation)</i>\r\n    </b>\r\n    <b>\r\n      <i>\r\n        &nbsp;\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n    The most common cause of canonicalization errors is checking a string too soon based on a non-canonical interpretation.&nbsp; Strings need to be in their canonical form (after all decoding or other processing has completed,) before they are used in access checks.&nbsp; For example, the code below checks for access too soon:\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <pre>int grabFile(char* input)\r\n{   \r\nchar* m_canonical_path;\r\nbool result;\r\n/*¨check against list of bad names*/\r\nresult = CheckAccessToFile(bad_input_list, input);  // (1)\r\nif (result == true) {\r\n/* convert to intended form */\r\nm_canonical_path = ConvertToCanonicalForm(input);   // (2)\r\nOpenFile(m_canonical_path);\r\n}\r\nelse return false;\r\nreturn true;\r\n}</pre>\r\n  <p>\r\n    This code incorrectly uses \r\n    CheckAccessToFile(input)\r\n     against the raw version of the input&nbsp; (1).&nbsp; You need to check for access just before the call to access or other policy decision:\r\n  </p>\r\n  <pre>CheckAccessToFile(m_canonical_path);</pre>\r\n  <p>\r\n    Note: &nbsp;The code uses a pseudo-code function named \r\n    ConvertToCanonicalForm() \r\n    to convert the input string to its canonical form.&nbsp; This function must be replaced with the appropiate function call depending on the platform in use.&nbsp; For instance, &nbsp;depending on the technology in use, you might use Java’s \r\n    getCanonicalPath()\r\n    or Visual Basic’s \r\n    GetAbsolutePathName()\r\n    .&nbsp; \r\n    Make sure to check the platform in use for the relevant canonical conversion function.\r\n    &nbsp;\r\n  </p>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        Decisions based on black lists \r\n      </i>\r\n    </b>\r\n    <b>\r\n      <i>\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n    <b>\r\n      <i>\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n    Even when assuming that a system checks the right form of a string at the correct time, problems may exist if the check is performed improperly.&nbsp; Blacklists are frequently used for checks of this type, but they can easily result in a dangerous string being overlooked.&nbsp; &nbsp;Because they can be bypassed with unknown representations of an invalid resource, blacklists are almost always insufficient and they are a poor defense against this vulnerability. &nbsp;The example pseudo-code below illustrates this:\r\n  </p>\r\n  <pre>int grabFile(char* input) {\r\nchar * m_canonical_path;\r\nbool result;\r\n/* convert here before it’s too late*/\r\ncanonical_path = ConvertToCanonicalForm(input) ;\r\n/* check against the canonical file - the safe representation */\r\nm_inpuFile = CheckAccessToFile(bad_input_list, m_canonical_path); \r\nif (result == true) OpenFile(m_canonical_path);\r\nelse return false;\r\nreturn true;\r\n}</pre>\r\n  <p>\r\n    This code correctly checks the canonical form (CheckAccessToFile(m_canonical_path)), but fails to detect any dangerous pattern outside of the blacklist.&nbsp; For example, the attacker might use an unlisted variation like the following one: :\r\n  </p>\r\n  <pre>C:\\privat~1</pre>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        Decisions based on white lists\r\n      </i>\r\n    </b>\r\n    <b>\r\n      <i>\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <p>\r\n    Utilizing a white-list is a much better approach to protect against canonicalization attacks.&nbsp; A white list is a list of all valid representations for a file.&nbsp; The server checks the input against the white list and disallows any input strings outside of the white list.&nbsp; This solves the problem of black lists where the attacker finds a variation of a file path that the server is unaware of.\r\n    &nbsp;\r\n  </p>\r\n  <p>\r\n    White lists can be implemented as a list of strings or as regular expressions (even though regular expressions are not a physical list, they represent a logical list with all possible matches.)\r\n  </p>\r\n  <p>\r\n    The following pseudo-code illustrates this method:<br /></p>\r\n  <pre>int grabFile(char* input){\r\nchar* m_inpuFile;\r\nbool result;\r\n/*check against list of good forms of the string */\r\nm_path = CheckAccessToFile(good_input_list, input);\r\nif (result == true) {\r\nm_inpuFile = Canonicalize(input); //convert to intended form\r\nOpenFile(result);\r\n} \r\nelse {\r\n/* disallow if the string is not in the good list */\r\nreturn false;\r\n}\r\nreturn true;\r\n}</pre>\r\n  <p>\r\n    <b>\r\n      <i>\r\n        Decisions based on user privileges\r\n      </i>\r\n    </b>\r\n    <b>\r\n      <i>\r\n      </i>\r\n    </b>\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <p>\r\n    All the code seen so far decides to access a file or folder based on string comparisons.&nbsp; A backup solution consists in using operating system control mechanisms such as Access Controls Lists (ACL’s.)&nbsp; These access-checking methods don’t rely on user supplied strings; they depend on the user privileges set by the server’s administrator.&nbsp;&nbsp;\r\n    &nbsp;\r\n  </p>\r\n  <p>\r\n    First you have to restrict the folder privileges using ACL’s.&nbsp; Let’s say you use ACL’s to allow only administrators to read, write, and read that folder.&nbsp; Nobody else can read the folder or browse to it.&nbsp; The server runs with admin privileges so you need to create code that lowers the effective privileges on the server:\r\n  </p>\r\n  <pre>bool ShowFile(char * input){\r\n/* start by changing to lower privileges */\r\nImpersonateUser(Internet User);\r\ntry {\r\nOpenFile(input);\r\n}\r\ncatch {\r\n/* (Internet User doesn't have access) */\r\n/* return to initial privileges */\r\nRevertToSelf();\r\nreturn false;\r\n}\r\n/* return to initial privileges */\r\nRevertToSelf();\r\nreturn true;\r\n}</pre>\r\n  <p>\r\n    Code like this mitigates canonicalization attacks using access control.&nbsp; There are no <i>syntactic</i> decisions, no pattern matching of user supplied paths and bad patterns. Regardless of the path the attacker chooses,&nbsp; if they are unprivileged then the system denies access to that resource.\r\n  </p>\r\n  <h2>\r\n    Look for all entry points\r\n  </h2>\r\n  <p>\r\n    Now that you’ve seen examples of both what causes canonicalization bugs and how to fix them, you need to find the possible entry points for problems like this in your application.&nbsp; Depending on what the application does, there may be only one or two pieces of functionality subject to these issues, or there may be many.&nbsp; Start by making a list of these pieces of functionality and then work backwards to all of the entry points that can influence that functionality.&nbsp; Your list of entry points might look like the following:\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      Request.QueryString[path]\r\n    </li>\r\n    <li>\r\n      &_GET[path]\r\n    </li>\r\n    <li>\r\n      HTTP variables, via form submission\r\n    </li>\r\n    <li>\r\n      Shell variables\r\n    </li>\r\n    <li>\r\n      Database query results\r\n    </li>\r\n    <li>\r\n      LDAP query results\r\n    </li>\r\n    <li>\r\n      Web service return data\r\n    </li>\r\n    <li>\r\n      Thick client user interfaces\r\n    </li>\r\n    <li>\r\n      Etc.\r\n    </li>\r\n  </ul>\r\n  <p>\r\n    Specific functions that may be used in functionality affected by canonicalization attacks include:\r\n    <i></i></p>\r\n  <ul>\r\n    <li>\r\n      fopen() \r\n    </li>\r\n    <li>\r\n      CreateFile()\r\n    </li>\r\n    <li>\r\n      FileInputStream\r\n    </li>\r\n    <li>\r\n      StreamReader\r\n    </li>\r\n    <li>\r\n      Policy.Allow()\r\n    </li>\r\n  </ul>\r\n  <p>\r\n    There are multiple other functions which can be at risk for canonicalization attacks, so ensure you understand what the program is doing and why.\r\n  </p>\r\n  <p>\r\n    Once you’ve compiled the lists above, putting them into a table like the following will allow you to walk through the high risk components systematically during testing:\r\n  </p>\r\n  <p>\r\n    &nbsp;\r\n  </p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            Component\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            API\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            Line\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            URL\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            Form\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            UI\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            Service\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            API\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            FileBrowser.asp\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            OpenTextFile\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            103\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            OpenTextFile\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            145\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            OpenFile\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            231\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            Response.php\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            fopen\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            1001\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            fopen\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            1116\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            FileHandler.cpp\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            CreateFile\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            234\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            CreateFile\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            531\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            showAccount.java\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            FileStreamReader\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            432\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              <u>\r\n              </u>\r\n            </b>\r\n          </p>\r\n          <br />\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              &nbsp;\r\n            </b>\r\n          </p>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            FileStreamReader\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            674\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            <b>\r\n              x\r\n            </b>\r\n          </p>\r\n        </td>\r\n        <td>\r\n          <p>\r\n            &nbsp;\r\n          </p>\r\n        </td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <h1>\r\n    Step 3: Start testing and exploring\r\n  </h1>\r\n  <p>\r\n    The next step is to start testing the implementation of the system using a simple fuzz string and observing how the system responds.&nbsp; &nbsp;&nbsp;\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <h2>\r\n    Start with simple fuzz strings and explore results\r\n  </h2>\r\n  <p>\r\n    Start testing with basic entry points such as through a web form. Pick a simple string and submit it through the form:\r\n  </p>\r\n  <pre> ..\\..\\..\\..\\xyz</pre>\r\n  <p>\r\n    Then examine the results looking for any error message.&nbsp; Error messages reveal useful information about what goes on with the web application (or a local application.)&nbsp; For example, a web server might return the following error:\r\n  </p>\r\n  <pre>Your request contains invalid characters</pre>\r\n  <p>\r\n    This indicates that the server has detected potentially dangerous characters in the string.&nbsp; You could try replacing those characters with their URL encoded form, like so: \r\n  </p>\r\n  <pre>..%5c..%5c..%5c..%5cxyz</pre>\r\n  <p>\r\n    Now the server returns a file not found error.&nbsp; This is good because you are now able to navigate to certain directories on the server that you couldn’t navigate to before.&nbsp; However, since you are trying a fuzz string the server didn’t find a valid folder.&nbsp; Nonetheless, the server is allowing navigation within the directory hierarchy.&nbsp; The next step is to replace the fuzz string to get access to the target folder:\r\n  </p>\r\n  <pre>..%5c..%5c..%5cprivateFiles</pre>\r\n  <p>\r\n    After only a few tries we reached this test string and found our target.&nbsp; As you can see, if canonicalization allows for it, you may use such techniques for directory traversal attacks which the application believes it is protecting against.\r\n  </p>\r\n  <h1>\r\n    Step 4: Tune test case data\r\n  </h1>\r\n  <p>\r\n    During this step you need to enhance your test cases with different variations to access a resource such as a file or folder.&nbsp; Then you must tune your test case data depending on the entry point under test.&nbsp; Finally, execute double encoding test cases.\r\n  </p>\r\n  <h2>\r\n    Try different ways of accessing the same resource\r\n  </h2>\r\n  <p>\r\n    There are different ways to open a file.&nbsp; For example, you can try to navigate up and down the directory tree while accessing the file.&nbsp; The following string opens the C:\\privateFiles folder in Windows:\r\n  </p>\r\n  <pre>C:\\windows\\..\\privateFiles</pre>\r\n  <p>\r\n    In Windows, you can also read a file’s data by accessing the data stream:\r\n  </p>\r\n  <pre>C:\\privateFiles\\secretFile.txt::$DATA</pre>\r\n  <p>\r\n    During this step you must tweak your test cases to add the most number of representations for each of the protected resources.\r\n  </p>\r\n  <h2> Double Encoding\r\n  </h2>\r\n  <p>\r\n  </p>\r\n  <p>\r\n    Double encoding issues occur when the encoding and decoding functions are incorrectly coded and end up building dangerous strings.\r\n    &nbsp;\r\n  </p>\r\n  <p>\r\n    For instance, the following application does the following:\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      \r\n        (1)     Checks if the URL contains a \r\n      %2f\r\n      \r\n      \r\n    </li>\r\n    <li>\r\n      \r\n        (2)&nbsp;&nbsp;&nbsp; \r\n      \r\n      Decodes the \r\n      $inputPath\r\n       sent by server\r\n    </li>\r\n    <li>\r\n      \r\n        (3)&nbsp;&nbsp;&nbsp; \r\n      \r\n      Decodes \r\n      $inputPath\r\n       again\r\n    </li>\r\n    <li>\r\n      \r\n        (4)&nbsp;&nbsp;&nbsp; \r\n      \r\n      Opens a file based on the last form of \r\n      $inputPath\r\n      \r\n      \r\n    </li>\r\n  </ul>\r\n  <pre>&lt;?php\r\n$m_encoded_path;\r\ninputPath = $_GET['name'];\r\n//(1) check if the URL contains %2f.&nbsp; Reject if found\r\n\r\n//(2)\r\n$inputPath = urldecode($inputPath);\r\n\r\n//(3)\r\n$inputPath = urldecode($inputPath);\r\n\r\n//(4)\r\nOpenFile($inputPath);\r\n?&gt;</pre>\r\n  <p>\r\n    An attacker can pass the following string to attempt accessing a file named “\r\n    ../../private/SecretFile.doc\r\n    ” located an upper folder.&nbsp; Here the attacker uses a double encoded string:\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <pre>http://www.anywebsite/app/name=..%25252f..%25252f../private/SecretFile.doc</pre>\r\n  <p>\r\n    These are the results of running this URL through the code above:\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      Server checks for %2f and doesn’t find one, so it doesn’t reject the URL (1).\r\n    </li>\r\n    <li>\r\n      The first decoding function (2) translates the original string to:&nbsp; \r\n      <b>\r\n        http://www.anywebsite/app/name=..%2f..%..2f../private/SecretFile.doc \r\n      </b></li>\r\n    <li>\r\n      The second decoding changes the path to a dangerous one: \r\n      <b>\r\n        http://www.anywebsite/app/ name=../../../private/SecretFile.doc \r\n      </b></li>\r\n    <li>\r\n      The attacker opens the private file.\r\n    </li>\r\n  </ul>\r\n  <h2>\r\n    Tune tests depending on each entry point\r\n  </h2>\r\n  <p>\r\n    Finally, to achieve proper coverage, you must cover the different ways of submitting input to your application:\r\n  </p>\r\n  <ul>\r\n    <li>\r\n      URL - In different encoding schemes depending on servers and browsers.\r\n    </li>\r\n    <li>\r\n      GUI of a local application - through common client-side text fields and buttons, command line arguments, any files loaded during runtime, the registry, or environment variables.\r\n    </li>\r\n    <li>\r\n      Policy Decision - usually a file or database containing rules and conditions such as antivirus policies.\r\n    </li>\r\n  </ul>\r\n  <p>\r\n    Look at the complete list of entry points made during step 2 and use your intuition during the testing phase to include any additional entry points.&nbsp; Each entry point has a different format that you must take into account during testing.\r\n  </p>\r\n  <p>\r\n  </p>\r\n  <h1>\r\n    Conclusions\r\n  </h1>\r\n  <p>\r\n    Canonicalization bugs are relatively easy to tackle.&nbsp; First you need to understand why these bugs occur through their common attack scenarios.&nbsp; Then learn why these bugs happen and how to mitigate them by using white lists and/or ACL’s instead of black lists, and check the input paths at the correct time.&nbsp; After listing the high risk components and entry points, start testing with a simple fuzz string to see how the application reacts to it.&nbsp; Finish by tuning your test cases with different attack variations based on the format of each entry point. Ensure that you understand any different encodings in use and tune your data according to specific rules needed based on context.\r\n  </p>"
        ]
      }
    ]
  }
}