{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-893281636",
      "Content_Hash": "1228471390"
    },
    "Metadata": [
      {
        "Id": [
          "da67858c-33e9-4661-aab8-d9de5e272301"
        ],
        "Id_History": [
          "da67858c-33e9-4661-aab8-d9de5e272301,00a3d829-a81b-47b7-8baa-4dfce2bf6311,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for URL Redirection Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for URL Redirection Bugs"
        ],
        "Tag": [
          "redirect,forward,open redirect"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "OWASP"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* Web Applications\r\n\r\n\r\n## Summary ##\r\n\r\nWeb applications use URL redirection to redirect their web clients to another URL address, most commonly in another domain. In most cases, applications hide URL redirection from their clients, such as when using a redirect page. However, sometimes applications expose URL redirecting to their clients such as when using a URL parameter to specify the target URL location. URL redirection attacks consist of exploiting URL redirection done through URL parameters for malicious purposes. To execute this attack, an attacker creates a malicious link that attempts to redirect towards a malicious site any web client who follows it.\r\n\r\nFollow these steps to test for URL redirection bugs:\r\n\r\n1. Understand attack scenarios\r\n\r\n2. Analyze causes and countermeasures\r\n\r\n3. Start testing and exploring\r\n\r\n4. Fine-tune test case data\r\n\r\n\r\n## Step 1: Understand Attack Scenarios ##\r\n\r\nFirst, it is necessary to understand the anatomy of URL redirection bugs. During a URL redirection attack the attacker’s main goal is to redirect a target web client to a malicious site. This is achieved by sending a link to the web client that starts with the application domain name but contains a URL parameter. When the client clicks the link, the client’s browser is first directed to the vulnerable application which in turn redirects the client to the malicious location indicated by the URL parameter. For the attack to succeed two conditions must be met: first, an attacker must find a vulnerable application that redirects its clients to a location indicated by a URL parameter, and, second, the target web client must click on the malicious link.\r\n\r\nIn detail:\r\n\r\n1. The attacker finds a URL in the target web application that redirects web clients to a page dictated by a URL parameter (or through a special control character such as a question mark or asterisk).\r\n\r\n2. The attacker sends a link to a target web client with the legitimate URL (found in step 1), but the attacker modifies the destination page to one of the attacker’s choice.\r\n\r\n3. The target client clicks on the malicious link. This causes the target client’s web browser to be redirected to the malicious page set by the attacker.\r\n\r\n\r\n## Step 2: Analyze Causes and Countermeasures ##\r\n\r\nNext, you must understand what causes URL redirection bugs and how to defend against them. This will help you identify this issue in source code and prepare to execute the test cases.\r\n\r\nWeb applications use URL redirection for different purposes. For instance, an application that has a page moved to a different location uses a redirect to send its clients to the new page location. To achieve this automatically the application can use code that invokes methods such as response.redirect in PHP applications and internally control the redirection. However, some applications expose the URL redirection logic to outside clients. For instance, an application might use a redirect page that takes a URL parameter as the redirect target location. Consider the following URL:\r\n\r\n    http://example.com/navigate.php?redir=http://example.com/login.php\r\n\r\nThe web application uses the redir URL parameter to control the target redirect location. An attacker can leverage this fact to trick a web client who trusts example.com into clicking the following link:\r\n\r\n    http://example.com/navigate.php?redir=http://attackers.com/gotcha.php\r\n\r\nIf the application is vulnerable it redirects the client who clicks the link above to the attacker’s domain. Note that the attack is possible because the application exposes the URL redirection logic to web clients through the URL and because it doesn’t check the contents of the redirection target before doing the actual redirect, allowing the target to be modified towards a malicious website.\r\n\r\nTo defend against this bug developers such hide any URL redirection control from outside clients. If they must expose URL redirection through URL parameters, then applications must properly validate any redirect target before performing the redirect. Developers should implement a white list containing all the allowed redirect target locations and add relevant code to the application that disallows redirects to any location that is not in the white list.\r\n\r\nAnother option to protect against this attack is to warn clients that they will be redirected to an arbitrary location and give them the option not to do so. \r\n\r\n\r\n## Step 3: Start Testing and Exploring ##\r\n\r\nNow that you’ve reviewed the theoretical aspects of URL redirection attacks you should follow the next test case to check for it in your application.\r\n\r\n### Test for URL redirection ###\r\n\r\nFollow these steps to test for URL redirection:\r\n\r\n1. Discover an application’s page/request that executes URL redirection. Note down the URL that is used during the redirection request. It is suggested to analyze the application’s use of URLs to find any embedded URLs; any URL contained within another URL is a hint of URL redirection.\r\n\r\n2. Once you’ve found a suspicious URL, discover what part of this URL the application uses to pass the target redirect location. The application can pass the target URL in a named URL parameter: `http://domain/navigate.php?redir=http://example.com/login.php` or by appending it after a special character such as a question mark or an asterisk (another symbols may be used) `http://domain/navigate.php?http://example.com/login.php`\r\n\r\n3. Modify the target redirect URL to a different URL such as (www.google.com) and make the request using a web browser: `http://domain/navigate.php?http://www.google.com`\r\n\r\nExpected results: The application is vulnerable to URL redirection attacks if it redirects the web browser to the target URL modified in step 3 without giving any warnings.\r\n\r\n\r\n## Step 4: Fine-tune Test Case Data ##\r\n\r\nURL redirection attacks require the target client to click on a malicious link. However, Internet clients might feel uneasy clicking a link if they notice that part of the link is not a trusted one. Therefore, an application that allows an attacker to pad or obfuscate the target URL has an increased the risk of a URL redirection attack on Internet clients. Consider the following URL links:\r\n\r\n\thttp://trusted_domain/nav.php?redir=http://attacker.com/run.php\r\n\r\n\thttp://trusted_domain/nav.php?redir=http://64.214.88.103/run.php\r\n  \r\nNote that this list is not exhaustive and it is necessary to keep up to date with different URL padding/masquerading methods.\r\n\r\nThe first URL can be quite suspicious to clients if they see it in the browser’s status bar. The third URL is obfuscated by using the attacker’s domain IP address instead of the domain name. The last URL is less suspicious than the first one and increases the exploitability of URL redirection bugs.\r\n\r\n\r\n## Conclusions ##\r\n\r\nAttackers use URL redirection attacks to trick web clients into visiting a malicious site for phishing or spoofing purposes or to redirect a target client to a page containing malware that automatically attempts to infect the client’s computer. Even though URL redirection is a valid and convenient method for redirecting web clients to legitimate locations, such as when a web page is moved or deleted or when a site changes domain names; it is dangerous when the application exposes URL redirection to web clients and allows redirection to an arbitrary domain. To test for this vulnerability you must find a request that does a redirect based on the URL and modify the URL using the methods suggested. Finally, you must fine-tune the test cases using URL padding and obfuscation to increase the exploitability of this bug.\r\n"
        ]
      }
    ]
  }
}