{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "595472889",
      "Content_Hash": "213071806"
    },
    "Metadata": [
      {
        "Id": [
          "e50f4854-c427-470e-b9a7-2638ae697722"
        ],
        "Id_History": [
          "e50f4854-c427-470e-b9a7-2638ae697722,4d2a6bb5-dbd5-4570-9ebb-f421dc16b6d1,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Double Encoding Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Double Encoding Vulnerabilities"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>Summary</h1>\r\n  <p>During a double encoding attack, the attacker encodes attack data twice using <i>hex representation of a character (using methods known as percent encoding or URL encoding)</i> so that the attack data is not detected by security filters. This vulnerability is often used during SQL injection, cross-site scripting, and path traversal attacks in order to submit malicious data through request parameters. A vulnerable application decodes the attack data twice before executing the malicious command.  </p>\r\n  <p>Follow these steps to test for double encoding bugs:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Start testing and exploring </li>\r\n    <li>Step 4: Execute additional testing<b></b></li>\r\n  </ul>\r\n  <h1>Step 1:  Understand Attack Scenarios</h1>\r\n  <p>The first step in testing for double encoding vulnerabilities is to understand the common attack scenarios:</p>\r\n  <ul>\r\n    <li>Path traversal </li>\r\n    <li>Cross-site scripting (XSS) </li>\r\n  </ul>\r\n  <h2>\r\n    Scenario 1: Path Traversal\r\n  </h2>\r\n  <p>During a path traversal attack, an attacker traverses a directory in order to find a secret document:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">http://victim/documents/getDocs.aspx?docname=../../secret.doc</font>\r\n  </p>\r\n  <p>However, the page <i>getDocs.aspx </i>filters out the filename provided in the URL and denies any sequence of two dots followed by a slash: \"<em>../</em>\" (without the quotes). To get around this, the attacker replaces the dots and  slashes with their URL-encoded equivalent (<em>%2e</em> and <em>%2f</em>, respectively):</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">%2e%2e%2f%2e%2e%2fprivate/secret.pdf</font>\r\n  </p>\r\n  <p>However, the application also recognizes the sequence <i>%2e%2e%2f</i> as a path traversal construct, and so denies the attack string. So the attacker executes a double encoding attack by re-encoding the percent (<em>%</em>) character with its URL-encoded equivalent (<em>%25</em>):</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">%252e%252e%252f%252e%252e%252fprivate/secret.pdf</font>\r\n  </p>\r\n  <p>A vulnerable application decodes the malicious string twice and translates it to a path traversal string, completing the attack. </p>\r\n  <h2>\r\n    Scenario 2: Cross-site Scripting\r\n  </h2>\r\n  <p>During a cross-site scripting attack, an attacker needs to submit special characters like pointed brackets, slashes, and backslashes. The attacker might first try to execute a string like this:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">&lt;script&gt;alert('XSS')&lt;/script&gt;</font>\r\n  </p>\r\n  <p>If the above string doesn’t work, the attacker might try to URL-encode special characters one time:</p>\r\n  <p>\r\n    <font face=\"'Courier New'\">%3Cscript%3Ealert('XSS')%3C%2Fscript%3E</font>\r\n  </p>\r\n  <p>However, the application disallows this string because it contains dangerous URL-encoded characters such as <i>%3C and %3E.</i></p>\r\n  <p>Next, the attacker tries double encoding the attack string: </p>\r\n  <p>\r\n    <font face=\"'Courier New'\">%253Cscript%253Ealert('XSS')%253C%252Fscript%253E</font>\r\n  </p>\r\n  <p>Note that the new construct no longer contains singly encoded dangerous hex characters like <em>%3C</em>. The application recognizes the string as safe, and, because it is vulnerable to double encoding, it double decodes the string, translating it to the original XSS construct. </p>\r\n  <h1>Step 2: Analyze causes and countermeasures</h1>\r\n  <p>The next step in testing for double encoding bugs is to understand what causes them and how to protect against them.</p>\r\n  <p />\r\n  <p>Some applications protect against malicious input by filtering out dangerous characters. Incoming strings are checked against a list, known as a <i>blacklist</i>, of dangerous constructs<i>. </i>If the input contains a blacklisted construct like “<em>../</em>”, the application doesn’t allow the operation. For instance, the following code implements a blacklist check in <i>exsistsInBlacklist:</i></p>\r\n  <pre>if (!existsInBlackList(Request.QueryString[\"filename\"]))\r\n{\r\nstring filename = Server.UrlDecode(Request.QueryString[\"filename\"]);\r\nStreamReader streamReader = new StreamReader(filename);\r\nwhile (streamReader.Peek() &gt;= 0)\r\n{\r\nResponse.Write(streamReader.ReadLine());\r\n}\r\nstreamReader.Close();\r\n}\r\n</pre>\r\n  <p>If the application wants to protect against path traversal, it would need to include double-encoded characters sequences such as <i>%252e%252e%252f </i>in its blacklist. Failing to do so would lead to a double encoding vulnerability. A better option would be implementing the check for a malicious construct on the canonical form. However, blacklists are not recommended because they must account for 100% of dangerous constructs; any dangerous construct not covered in the blacklist allows attacks on the application.</p>\r\n  <p>To protect against this vulnerability, use a <i>whitelist</i> approach. Whitelists allow only valid constructs; any construct not in the whitelist is automatically disallowed. This way, developers need only define what is good, and don’t have to worry about covering 100% of all dangerous constructs. For instance, the code below enforces a whitelist that uses a regular expression to check for safe input filenames. The regular expression allows only filenames of five to eight upper- or lower-case letters followed by the “<em>.doc</em>” string (with no quotes). Any string that doesn’t match this form, like the path traversal string “<em>../</em>”, causes the application to produce an error message:</p>\r\n  <pre>string filename = Server.UrlDecode(Request.QueryString[\"filename\"]);\r\nRegex validFilename = new Regex(\"^[a-zA-Z]{5,8}\\.doc$\");\r\nif (!validFilename.IsMatch(filename))\r\n{\r\nResponse.Write(\"invalid input\");\r\n}\r\nelse\r\n{\r\nStreamReader streamReader = new StreamReader(filename);\r\nwhile (streamReader.Peek() &gt;= 0)\r\n/* continue opening file */\r\n}</pre>\r\n  <p>Note that the code uses the whitelist approach on the canonical form of the input. It first decodes the input and then calls the regular expression on the decoded input.</p>\r\n  <h1>Step 3: Start Testing and Exploring</h1>\r\n  <p>Now that you’ve looked at double encoding attack scenarios and understand what causes them and how to protect against them, it is necessary to include double encoding issues when testing for different security issues.  </p>\r\n  <h2>\r\n    Test for Double Encoding during Path Traversal\r\n  </h2>\r\n  <p>Follow the next steps to test for double encoding bugs during path traversal attacks:</p>\r\n  <ol>\r\n    <li>Identify all locations in the application where the input is used to find a file on the server. </li>\r\n    <li>Submit path traversal attack strings on all such locations. Modify any path traversal attack string with a double encoding string.<i></i></li>\r\n    <li>Check if the path is traversed.</li>\r\n  </ol>\r\n  <p>Expected results:  No paths should be allowed to be traversed.</p>\r\n  <p>\r\n    Example Attack Strings:\r\n  </p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          <b>Attack String</b>\r\n        </td>\r\n        <td>\r\n          <b>Single encoding</b>\r\n        </td>\r\n        <td>\r\n          <b>Double encoding</b>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n../../..\r\n        </td>\r\n        <td>\r\n          ..%2F..%2F..\r\n        </td>\r\n        <td>\r\n          ..%252F..%252F..\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          ../../..\r\n        </td>\r\n        <td>\r\n          %2E%2E%2F%2E%2E%2F%2E%2E\r\n        </td>\r\n        <td>\r\n          %252E%252E%252F%252E%252E%252F%252E%252E\r\n        </td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <p>Note that some attack strings can be single-encoded differently. This applies to all of the remaining attacks.<b></b></p>\r\n  <h2>\r\n    Test for Double Encoding during Cross-site Scripting (XSS)\r\n  </h2>\r\n  <p>Follow the next steps to test for double encoding bugs during cross-site scripting:</p>\r\n  <ol>\r\n    <li>Identify all locations in the application where the input is a) reflected from web forms, b) URL parameters, or c) loaded from a persistent store such as a database. </li>\r\n    <li>Submit XSS attack strings on all such locations. Modify any URL-encoded XSS attack string with a double-encoded string. </li>\r\n    <li>Reload the page containing the modified location and check if the injected script executes.</li>\r\n  </ol>\r\n  <p>Expected results: None of the injected scripts should execute.</p>\r\n  <p>\r\n    Example Attack Strings:\r\n  </p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          <b>Attack String</b>\r\n        </td>\r\n        <td>\r\n          <b>Single encoding</b>\r\n        </td>\r\n        <td>\r\n          <b>Double encoding</b>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          &lt;script&gt;alert('XSS')&lt;/script&gt;\r\n        </td>\r\n        <td>\r\n          %3Cscript%3Ealert('XSS')%3C%2Fscript%3E\r\n  \r\n        </td>\r\n        <td>\r\n          %253Cscript%253Ealert('XSS')%253C%252Fscript%253E\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          &gt;\"'&gt;&lt;img src='javascript:alert('XSS');\"&gt;\r\n        </td>\r\n        <td>\r\n          %3E%22%27%3E%3Cimg%20src%3D%27javascript%3Aalert%28%27XSS%27%29%3B%22%3E\r\n        </td>\r\n        <td>\r\n          %253E%2522%2527%253E%253Cimg%2520src%253D%2527javascript%253Aalert%2528%2527XSS%2527%2529%253B%2522%253E\r\n        </td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <h2>\r\n    Test for Double Encoding during SQL Injection\r\n  </h2>\r\n  <p>Follow the next steps to test for double encoding bugs in SQL injection scripting:</p>\r\n  <ol>\r\n    <li>Identify all locations in the application where input is\r\n<ol><li>reflected from web forms\r\n</li><li>URL parameters\r\n</li><li>GUIs\r\n</li><li>loaded from a persistent store such as a database.</li></ol></li>\r\n    <li>Submit SQ<i>L injection strings </i>on all such locations<i>. </i><b></b>Modify any URL-encoded SQL injection attack string with a double-encoded string.<i></i></li>\r\n    <li>Check if the application processed the injected SQL statement.</li>\r\n  </ol>\r\n  <p />\r\n  <p>Expected results: None of the injected statements should be allowed.</p>\r\n  <p>\r\n    Example Attack Strings:\r\n  </p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\n          <b>Attack String</b>\r\n        </td>\r\n        <td>\r\n          <b>Single encoding</b>\r\n        </td>\r\n        <td>\r\n          <b>Double encoding</b>\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          a' or 1=1--\r\n        </td>\r\n        <td>\r\n          a%27%20or%201%3D1--\r\n        </td>\r\n        <td>\r\n          a%2527%2520or%25201%253D1--\r\n        </td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\n          ') or ('a'='a\r\n        </td>\r\n        <td>\r\n          %27%29%20or%20%28%27a%27%3D%27a\r\n        </td>\r\n        <td>\r\n          %2527%2529%2520or%2520%2528%2527a%2527%253D%2527a\r\n        </td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <h1>Step 4: Execute Additional Testing</h1>\r\n  <p>The final step in testing for double encoding vulnerabilities is to look for them when executing any attacks that use hex character encoding. Additional attacks may include:</p>\r\n  <ul>\r\n    <li>XML injection </li>\r\n    <li>LDAP injection </li>\r\n    <li>Command injection </li>\r\n    <li>HTTP response splitting </li>\r\n    <li>URL parameter tampering </li>\r\n    <li>XPath injection </li>\r\n  </ul>\r\n  <h1>Conclusions</h1>\r\n  <p>Attackers commonly use double encoding to bypass security filters when attacking the application through HTTP request parameters. To test for double encoding bugs, you must understand the attack scenarios, what causes them, and how to defend against them. Apply this knowledge when testing for request parameter bugs such as XSS, SQL injection, and path traversal. Finally, include double encoding test cases for any security vulnerability payloads tested via HTTP request parameters.</p>"
        ]
      }
    ]
  }
}