{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1934389847",
      "Content_Hash": "-930427268"
    },
    "Metadata": [
      {
        "Id": [
          "ed20009a-59ef-415d-8e72-0ff3221a1346"
        ],
        "Id_History": [
          "ed20009a-59ef-415d-8e72-0ff3221a1346,7538cd93-e57a-4fef-8671-e261eb77a750,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Integer Underflow Bugs in Java"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Integer Underflow Bugs in Java"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>\r\nApplies to\r\n</h1>\r\n  <ul>\r\n    <li>J2EE applications</li>\r\n  </ul>\r\n  <p>\r\n    <b>\r\n    </b>\r\n  </p>\r\n  <h1>\r\nSummary\r\n</h1>\r\n  <p>Integer underflow bugs occur when an application doesn’t properly check the boundaries of an arithmetic operation involving integer variables, allowing one of the integer variables to take a value that is less than the minimum integer.When this happens, the underflowed integer variable wraps up to a very large integer and ends up holding an unexpected value.   </p>\r\n  <p>Integer underflows are similar to integer overflows with the only difference being that the goal of an integer underflow attacks is to generate a value that is lower than the lower boundary of an integer while overflows target at exceeding the higher boundary of the integer.Attackers use integer underflow bugs to execute attacks on the business logic of J2EE Web applications.</p>\r\n  <p>Follow these steps to test for integer underflows in J2EE:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Execute test cases</li>\r\n  </ul>\r\n  <p>\r\n    <b>\r\n    </b>\r\n  </p>\r\n  <h1>\r\nStep 1: Understand Attack Scenarios\r\n</h1>\r\n  <p>The first step in learning how to test for integer underflow bugs is to understand the anatomy of an integer underflow scenario. In unmanaged applications written in languages like C or C++, attackers use integer underflow conditions to create an incorrect buffer size and trigger a stack or heap overflow to execute arbitrary code or to crash the application to create a denial-of-service attack. Although these two attacks are not possible in J2EE environments, attackers can exploit integer underflow conditions to execute logical attacks on J2EE applications.</p>\r\n  <p>An integer underflow attack is possible when an application uses client-supplied input as a variable in an integer operation. To trigger the underflow, an attacker usually passes a small or large enough value, depending on the underlying application,so that the result of the operation is unexpected.Consider the following code:</p>\r\n  <pre>response.setContentType(\"text/html;charset=UTF-8\");<br />PrintWriter out = response.getWriter();<br /><br />int fixed_score  = 10000;<br />int current_score = 0;<br />int errors  = Integer.parseInt(request.getParameter(\"errors\"));<br /><br />if (errors &gt; 0)<br />{<br /><strong>current_score  = fixed_score -(errors * 50);</strong><br />out.write(\"Current score is: \" + Integer.toString(current_score));<br />}<br />else<br />{<br />out.write(\"Invalid input\");<br />}<br />out.close();\r\n</pre>\r\n  <p>The application uses the code above to calculate a score for its clients. It starts from a fixed score set to 10,000 and subtracts error points (50 points for each error) from the URL parameter <strong>errors</strong>.If the application uses a normal error count like 10, the score is calculated as expected:</p>\r\n  <pre>http://some_site/example/getScore?errors=10\r\n<br />\r\nCurrent score is: 9500\r\n</pre>\r\n  <p>However an attacker might tamper with the <em>errors </em>URL parameter and pass a value that generates an underflow when used by the application to calculate the current score:</p>\r\n  <pre>http://some_site/example/getScore?errors=42949873\r\nCurrent score is: 2147483646\r\n</pre>\r\n  <p>\r\nThis occurs because the application multiplies 42949873 by 50 and subtracts the result from 10000. This generates an exceedingly large negative number which exceeds the lower integer boundary (-2147483647 in case of 32-bit signed integers).  As a consequence, the result of the operation wraps up to a large positive integer.Attackers can exploit this flaw to set higher scores for themselves.</p>\r\n  <p>\r\nIn summary, an integer underflow attack follows these steps:\r\n</p>\r\n  <ol>\r\n    <li>\r\n  The attacker finds an input variable that takes an integer value.\r\n</li>\r\n    <li>\r\n  The attacker modifies the input variable with an unexpected value, far from the default.\r\n</li>\r\n    <li>\r\n  The attacker submits a request including modified input variable.\r\n</li>\r\n    <li>\r\n  The attacker observers how the application reacts.\r\n</li>\r\n  </ol>\r\n  <h1>\r\nStep 2: Analyze Causes and Countermeasures\r\n</h1>\r\n  <p>\r\nNext it is necessary to analyze what causes integer underflow bugs and and how to protect against them. This knowledge will help you identify integer underflow vulnerabilities in source code and prepare to test for them in your application.\r\n</p>\r\n  <p>\r\nInteger underflows occur when an application uses a client-supplied value in an arithmetic operation involving integer variables without checking if the supplied value will cause one of the integer variables to exceed its minimum bondary.For instance, in the previous scenario the application calculates the current score with an integer variable that is directly provided by<i></i>client using the <em>errors </em>URL parameter:\r\n</p>\r\n  <pre>current_score  = fixed_score - (errors * 50);\r\n</pre>\r\n  <p>\r\nEven though the application checks for errors being a negative (so that attackers don’t add their error points directly), it failes to check for an upper boundary of errors and allows for an underflow situation.\r\n</p>\r\n  <p>\r\n\r\n\r\nTo protect against an underflow situation, the application could have added an additional check for a maximum number of errors:\r\n\r\n\r\n</p>\r\n  <pre>response.setContentType(\"text/html;charset=UTF-8\");<br />PrintWriter out = response.getWriter();<br /><br />int fixed_score  = 10000;<br />int maximum_errors = 500;<br />int current_score  = 0;<br />int errors  = Integer.parseInt(request.getParameter(\"errors\"));<br /><br /><strong>if (errors &gt; 0 && errors &lt;= maximum_errors)</strong><br />{<br />      current_score  = fixed_score -(errors * 50);<br />      out.write(\"Current score is: \" + Integer.toString(current_score));<br />}<br />else<br />{<br />      out.write(\"Invalid input\");<br />}<br />out.close();\r\n<br /></pre>\r\n  <h1>\r\nStep 3: Execute Test Cases\r\n</h1>\r\n  <p>Now that you’ve reviewed the theoretical aspects of integer underflow bugs, it is necessary to execute practical test cases to check for them in your J2EE application.</p>\r\n  <h2>\r\n    <em>Test for Integer Underflow Bugs</em>\r\n  </h2>\r\n  <p>It is recommended to test for integer underflow bugs by modifying any client-accessible integer variable such as a URL parameter as shown in the scenarios section.Follow these steps to test for integer underflow bugs:</p>\r\n  <ol>\r\n    <li>Identify an input variable that takes an integer variable.Such as input variables are usually passed in URL parameters, Web forms (using visible or hidden input tags), cookies, or Flash parameters. </li>\r\n    <li>Modify the input variable with an expected integer value and see how the application reacts.  </li>\r\n    <li>Modify the input variable with a value that is close to the minimum and maximum integer value (see Table 1 below).<br />During this step, consider cases where the application performs an arithmetic operation on the client input such as the scenario shown in Section 1.Note that in the scenario, the attacker modifies the integer variable with 42949873, a variable that is not close to any of the integer type boundaries. However, the application multiplies the input by 50 and subtracts the result from 10,000, so the attacker is actually trying to modify the target unsigned integerto -2147483648, a value that is close the boundary.</li>\r\n  </ol>\r\n  <p>Expected results: A vulnerable application will most likely show a different behavior or output for Steps 2 and 3.  For instance, it might display an exceedingly large number for Step 3 while displaying expected output for Step 2 .</p>\r\n  <table>\r\n    <tbody>\r\n      <tr>\r\n        <td>\r\nData type\r\n\r\n\t</td>\r\n        <td>\r\nMinimum / Maximum Value\r\n\r\n\t</td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\nint\r\n\r\n\t</td>\r\n        <td>\r\n-2147483647 / 2147483647\r\n\r\n\t</td>\r\n      </tr>\r\n      <tr>\r\n        <td>\r\nshort\r\n\r\n\t</td>\r\n        <td>\r\n-32767 / 32767\r\n\t  \r\n\t</td>\r\n      </tr>\r\n    </tbody>\r\n  </table>\r\n  <p>\r\n    <strong>Table 1 - Minimum and maximum integer values for integer-related types in Java</strong>\r\n  </p>\r\n  <h1>\r\nConclusions\r\n</h1>\r\n  <p>Integer underflow vulnerabilities occur due to implementation flaws that allow attackers to alter an integer variable that is used by an application&nbsp;in an arithmetic operation. Attackers attempt to store in the target integer variable a value that is less than the minimum allowed by the variable’s type.&nbsp;Integer underflows can be used by attackers to attack the business logic of an application such as calculating incorrect scores and so on.&nbsp;To test for them, it is first necessary to understand how integer underflow attacks occur and how to protect against them, then alter any input integer variable with a value close to the minimum or maximum boundaries for that data type.</p>"
        ]
      }
    ]
  }
}