{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-413481607",
      "Content_Hash": "1785227933"
    },
    "Metadata": [
      {
        "Id": [
          "f0bdff3b-759b-452f-bd22-58eed4669652"
        ],
        "Id_History": [
          "f0bdff3b-759b-452f-bd22-58eed4669652,abd645b4-492a-4f15-b006-533058320a71,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "How to Instrument Applications for Security"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Instrument Applications for Security"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>ASP.NET 4.0</li>\n  </ul>\n  <h1>Summary</h1>\n  <p>This How To shows you how to use custom health monitoring events to instrument your ASP.NET application to track security-related events and operations. ASP.NET provides health monitoring that includes instrumentation for many standard security-related and infrastructure events common to all ASP.NET applications. If you want to track additional security-related activity not covered by the standard events, or if you want to report on application-specific events, you need to create and raise custom events. This How To includes three samples that show how to build custom events that you can use to track password change events, user account lockout, and access to sensitive business logic.</p>\n  <h1>Contents</h1>\n  <ul>\n    <li>Objectives </li>\n    <li>Overview </li>\n    <li>Platform Default Security Events </li>\n    <li>Additional Custom Security Events </li>\n    <li>Sample: Password Change Event </li>\n  </ul>\n  <h1>Objectives</h1>\n  <ul>\n    <li>Identify the security related events that are raised automatically. </li>\n    <li>Learn about additional security related events you might want to track. </li>\n    <li>Raise custom events to track specific security related activity. </li>\n    <li>Instrument your code to detect password changes. </li>\n    <li>Instrument your code to detect when the membership system locks out an account. </li>\n    <li>Instrument your code to track access to sensitive business logic. </li>\n  </ul>\n  <h1>Overview</h1>\n  <p>To react promptly to security incidents or infrastructure and application failures, you need to instrument and monitor your ASP.NET applications. ASP.NET runtime components and controls are instrumented for health monitoring and they raise events for many common situations. This includes login failures and successes when using the ASP.NET membership system, attempts to tamper with or reuse forms authentication tickets, and infrastructure issues such as disk access failures. By default, the ASP.NET health monitoring system is configured to report all security-related error events, and all infrastructure-related error events, to the Windows event log.</p>\n  <p>When planning the instrumentation of an ASP.NET application, you should start by deciding the standard ASP.NET events that you want to report, where you want to report them, and how you want to monitor them. ASP.NET includes event logging providers to write to the following locations:</p>\n  <ul>\n    <li>Windows event log </li>\n    <li>SQL Server database </li>\n    <li>E-mail recipient </li>\n    <li>Windows Management Instrumentation (WMI) </li>\n  </ul>\n  <p>You can also create your own custom event providers. You can use standard monitoring tools and products such as Microsoft Operations Manager (MOM) to monitor events.</p>\n  <h2>Event Class Hierarchy</h2>\n  <p>The class hierarchy of the standard events is shown in Figure 1, together with the major event code associated with each event. Some events also log a detail code as well as a major code, but these are not shown in Figure 1. For more information about the standard event codes, see <a onclick=\"javascript:Track('ctl00_LibFrame_ctl01|ctl00_LibFrame_ctl04',this);\" href=\"http://msdn.microsoft.com/en-us/library/system.web.management.webeventcodes_members.aspx\">WebEventCodes Class</a> of the .NET Framework Class Library on MSDN.</p>\n  <p>\n    <img alt=\"\" src=\"http://msdn2.microsoft.com/en-us/library/ms998325.f01paght00001601(en-us,MSDN.10).gif\" border=\"0\" />\n  </p>\n  <p>\n    <b>Figure 1. Class hierarchy of the standard event classes with major event codes</b>\n  </p>\n  <p>By default, ASP.NET health monitoring is configured to log to the Windows event log all events of type <em>WebFailureAuditEvent</em> (including its descendants, <em>WebAuthenticationFailureAuditEvent</em> and <em>WebViewStateFailureAuditEvent</em>) and all events of type <em>WebBaseErrorEvent</em> (and its descendants, <em>WebErrorEvent</em> and <em>WebRequestErrorEvent</em>). These classes are shown highlighted in Figure 1. </p>\n  <p>You can configure health monitoring to log a different set of events. You can select specific event codes by specifying a range of codes to log, and you can log to different event sinks through different event providers. </p>\n  <h1>Platform Default Security Events</h1>\n  <p>ASP.NET supports many events that you can use to monitor the health of your application. The most critical of these are those of type <em>WebErrorEvent</em> and <em>WebFailureAuditEvent</em> (including its descendants, <em>WebAuthenticationFailureAuditEvent</em> and <em>WebViewStateFailureAuditEvent</em>), which are logged by default, while others may be added to aid investigation in the case of an attack.</p>\n  <h2>Platform Default Security Events Logged By Default</h2>\n  <p>The following events are logged to the Windows event log by default.</p>\n  <h3>Forms Authentication Events</h3>\n  <p>The following major event codes are logged for events of type <em>WebAuthenticationFailureAuditEvent</em>. </p>\n  <ul>\n    <li>\n      <b>AuditFormsAuthenticationFailure</b> (code 4005). This is used to identify brute force or dictionary attacks when using forms authentication classes. This code may also be accompanied by one of the following detail codes: <ul><li><b>ExpiredTicketFailure</b>. This is used to identify cookie replay attacks. </li><li><b>InvalidTicketFailure</b>. This is used to identify authentication cookie tampering. </li></ul></li>\n    <li>\n      <b>AuditMembershipAuthenticationFailure</b> (code 4006). This is used to identify brute force or dictionary attacks when using the membership feature. </li>\n  </ul>\n  <h3>Invalid ViewState Events</h3>\n  <p>The following major event code is logged for exceptions of type <em>WebViewStateFailureAuditEvent</em>: </p>\n  <ul>\n    <li>\n      <b>AuditInvalidViewStateFailure</b> (code 4009). This is used to identify tampering with ViewState. </li>\n  </ul>\n  <h3>Authorization Events</h3>\n  <p>The following major event codes are logged for events of type <em>WebFailureAuditEvent</em>, which are associated with authorization failures: </p>\n  <ul>\n    <li>\n      <b>AuditFileAuthorizationFailure</b> (code 4008). This is used to identify attempts to access unauthorized files or folders. </li>\n    <li>\n      <b>AuditUnhandledAccessException</b> (code 4011). This is used to identify attempts of unauthorized access to resource. </li>\n    <li>\n      <b>AuditUnhandledSecurityException</b> (code 4010). This is used to identify attempts to perform actions not allowed by the current trust level. </li>\n    <li>\n      <b>AuditUrlAuthorizationFailure</b> (code 4007). This is used to identify attempts to access an unauthorized path or page. </li>\n  </ul>\n  <h3>Application Failure Events</h3>\n  <p>The following major event codes are logged for exceptions of type <em>WebErrorEvent</em>, which are associated with compilation or configuration errors and may indicate unauthorized alteration of the content of your Web site: </p>\n  <ul>\n    <li>\n      <b>WebErrorCompilationError</b> (code 3007). This indicates that an error occurred during application compilation. </li>\n    <li>\n      <b>WebErrorConfigurationError</b> (code 3008). This indicates that a configuration error occurred. </li>\n    <li>\n      <b>WebErrorObjectStateFormatterDeserializationError</b> (code 3011). This indicates that an error deserializing internal state objects occurred. </li>\n    <li>\n      <b>WebErrorOtherError</b> (code 3009). This indicates that an unclassified error occurred. </li>\n    <li>\n      <b>WebErrorParserError</b> (code 3006). This indicates that a parser error occurred. </li>\n    <li>\n      <b>WebErrorPropertyDeserializationError</b> (code 3010). This indicates that an error deserializing internal state objects occurred. </li>\n  </ul>\n  <h3>Runtime Error Events</h3>\n  <p>The following major event codes are logged for exceptions of type <em>WebRequestErrorEvent</em>, which are associated with runtime errors, and may indicate an attack on your Web site: </p>\n  <ul>\n    <li>\n      <b>DiskOutputCacheInformation</b> (code 5003). This indicates that a disk output cache event occurred. This event is always accompanied by a detail code giving more information. </li>\n    <li>\n      <b>DiskOutputCacheQuotaExceeded</b> (code 5001). This indicates that the disk output cache quota was exceeded. </li>\n    <li>\n      <b>RuntimeErrorPostTooLarge</b> (code 3004). This indicates that the size of the posted information exceeded the allowed limits. </li>\n    <li>\n      <b>RuntimeErrorRequestAbort</b> (code 3001). This indicates that the Web request has been aborted. </li>\n    <li>\n      <b>RuntimeErrorUnhandledException</b> (code 3005). This indicates that an unhandled exception occurred. </li>\n    <li>\n      <b>RuntimeErrorValidationFailure</b> (code 3003). This indicates that a validation error occurred. </li>\n    <li>\n      <b>RuntimeErrorViewStateFailure</b> (code 3002). This indicates that a view state failure occurred. </li>\n  </ul>\n  <h2>Platform Default Events Not Logged by Default</h2>\n  <p>The following events are not logged by default.</p>\n  <h3>Application Life Time Events</h3>\n  <p>The following events can be logged for detecting application availability. These are not on by default, but we recommend that all of them are turned on in order to detect potential attacks: </p>\n  <ul>\n    <li>\n      <b>ApplicationStart </b>(code 1001) / <b>ApplicationShutdown</b> (code 1002). These events indicate application startup and shutdown, and they are always accompanied by a detail code giving more information. If you see a large quantity of these events, your application may be the target of a denial of service attack. </li>\n    <li>\n      <b>ApplicationCompilationStart</b> (code 1003) / <b>ApplicationCompilationEnd</b> (code 1004). These events indicate the compilation of the application has started and finished. If you see these events, it may be an indication of unauthorized modification of your application content. </li>\n  </ul>\n  <h3>Forms Authentication Events</h3>\n  <p>For additional forms authentication information, log the following events: </p>\n  <ul>\n    <li>\n      <b>AuditFormsAuthenticationSuccess</b> (code 4001). This is used to maintain audit trail of successful forms authentication, which can then be retraced if the system is compromised, when using forms authentication classes. </li>\n    <li>\n      <b>AuditMembershipAuthenticationSuccess</b> (code 4002). This is used to maintain audit trail of successful authentications in the ASP.NET membership system, which can then be retraced if the system is compromised, when using the membership feature. </li>\n  </ul>\n  <h3>Authorization Events</h3>\n  <p>To provide additional authorization information, log the following events: </p>\n  <ul>\n    <li>\n      <b>AuditFileAuthorizationSuccess</b> (code 4004). This is used to maintain an audit trail, which can then be retraced to identify all successful file accesses by an attacker if the system is compromised. </li>\n    <li>\n      <b>AuditUrlAuthorizationSuccess</b> (code 4003). This is used to maintain an audit trail, which can then be retraced to identify all successful URL and path accesses by an attacker if the system is compromised. </li>\n  </ul>\n  <h3>Web Heartbeat Event</h3>\n  <p>The <em>WebHeartbeatEvent</em> may be logged to provide an audit trail that monitors normal operation of your application: </p>\n  <ul>\n    <li>\n      <b>ApplicationHeartbeat</b> (code 1005). This is used to log a heartbeat for the application. The heartbeat interval is defined by the <em>heartBeatInterval</em> attribute of the &lt;<em>healthMonitoring</em>&gt; element. The default value is 0, indicating no heartbeat. </li>\n  </ul>\n  <h3>Web Request Events</h3>\n  <p>These events may be logged to provide an audit trail of normal request completion and abort: </p>\n  <ul>\n    <li>\n      <b>RequestTransactionComplete</b> (code 2001). This indicates the Web request was completed. </li>\n    <li>\n      <b>RequestTransactionAbort</b> (code 2002). This indicates the Web request was aborted. </li>\n  </ul>\n  <h2>Additional Custom Security Events</h2>\n  <p>There are additional custom security events that you can instrument to improve your ability to detect and understand attacks on your application. The following list identifies some additional security events that you should consider logging. In addition to the events that follow, you might also have to instrument unique events to monitor critical functionality in your application.</p>\n  <h3>Authorization Events</h3>\n  <p>Following is a list of authorization scenarios for which you can create custom events in order to improve visibility on the health of your application: </p>\n  <ul>\n    <li>Accessing in memory object/keys. This is used to instrument success and failure events, can be used to identify objects/keys compromise. </li>\n    <li>Roles Authorization success events. This is used to maintain audit trail for user activities. </li>\n    <li>Roles Authorization failure events. This is used to identify attempts at unauthorized access. </li>\n  </ul>\n  <h3>Session Management Events</h3>\n  <p>Instrumenting the following events can aid your ability to track user activities and detect anomalies in user behavior: </p>\n  <ul>\n    <li>Session lifetime events </li>\n    <li>Session creation </li>\n    <li>Session termination </li>\n    <li>Session timeout </li>\n    <li>Session expiration </li>\n  </ul>\n  <h3>User Management Events</h3>\n  <p>Instrumenting the following events can aid your ability to track anomalies in user account changes: </p>\n  <ul>\n    <li>Password resets/changes </li>\n    <li>Account creation/deletion/modification/lockout </li>\n    <li>Roles assignment </li>\n  </ul>\n  <h1>Sample: Password Change Event</h1>\n  <p>This sample provides a custom Web event that you can use to record when a user changes his or her password in an application that uses ASP.NET membership to authenticate users with forms authentication.</p>\n  <h2>To create a password changed Web event </h2>\n  <ol>\n    <li>To build a Web event, create a class in a class library that derives from <em>System.Web.Management.WebSuccessAuditEvent</em>. Use the following code. <pre>using System;<br />using System.Web.Management;<br />using System.Text;<br />using System.Web;<br />namespace MyWebEvents<br />{<br />&nbsp;&nbsp;&nbsp; public class PasswordChangedEvent : WebSuccessAuditEvent<br />&nbsp;&nbsp;&nbsp; {<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; public PasswordChangedEvent(string msg, object eventSource, int eventCode)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; : base(msg, eventSource, eventCode)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; {<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; public PasswordChangedEvent(string msg, object eventSource, int eventCode, int eventDetailCode)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; : base(msg, eventSource, eventCode, eventDetailCode)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; {<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }<br />        public override void FormatCustomEventDetails(WebEventFormatter formatter)<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; {<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; base.FormatCustomEventDetails(formatter);<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // Add custom data.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.AppendLine(\"\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.IndentationLevel += 1;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.AppendLine(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"******** SampleWebSuccessAuditEvent Start ********\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.AppendLine(string.Format(\"Request path: {0}\",<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; RequestInformation.RequestPath));<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.AppendLine(string.Format(\"Request Url: {0}\",<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; RequestInformation.RequestUrl));<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // Display custom event message.<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.AppendLine(\"Password changed\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.AppendLine(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"******** SampleWebSuccessAuditEvent End ********\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; formatter.IndentationLevel -= 1;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }&nbsp; <br />&nbsp;&nbsp;&nbsp; }<br />}   </pre></li>\n    <li>Compile the class library to build an assembly. </li>\n  </ol>\n  <h2>To instrument an application with the password changed event </h2>\n  <ol>\n    <li>\n      <p />Create a new ASP.NET Web application that includes the following <em>Login.aspx</em> page. Note that this page contains <em>CreateUserWizard</em> and <em>ChangePassword</em> controls. Within the <em>OnChangePassword</em> event handler, the custom <em>PasswordChangedEvent</em> is raised. <pre>&lt;%@ Page Language=\"C#\" %&gt;<br />&lt;%@ Import namespace=\"System.Web.Management\" %&gt;<br />&lt;!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.1//EN\" \"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd\"&gt;<br />&lt;script runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp; protected void OnChangePassword(object sender, EventArgs e)<br />&nbsp;&nbsp;&nbsp; {<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MyWebEvents.PasswordChangedEvent pcEvt = new <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MyWebEvents.PasswordChangedEvent(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"Password changed\", <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; this, <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; WebEventCodes.WebExtendedBase + 1);<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pcEvt.Raise();<br />&nbsp;&nbsp;&nbsp; }<br />&lt;/script&gt;<br />&lt;html&nbsp; &gt;<br />&lt;head runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp; &lt;title&gt;Untitled Page&lt;/title&gt;<br />&lt;/head&gt;<br />&lt;body&gt;<br />&nbsp;&nbsp;&nbsp; &lt;form id=\"form1\" runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp; &lt;div&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;asp:CreateUserWizard ID=\"CreateUserWizard1\" runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;WizardSteps&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;asp:CreateUserWizardStep runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;/asp:CreateUserWizardStep&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;asp:CompleteWizardStep runat=\"server\"&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;/asp:CompleteWizardStep&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;/WizardSteps&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;/asp:CreateUserWizard&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&lt;/div&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;asp:ChangePassword ID=\"ChangePassword1\" runat=\"server\"<br />           OnChangedPassword=\"OnChangePassword\"&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;/asp:ChangePassword&gt;<br />&nbsp;&nbsp;&nbsp; &lt;/form&gt;<br />&lt;/body&gt;<br />&lt;/html&gt;  </pre></li>\n    <li>\n      <p />Add a <em>Web.config</em> file to your application and add the following configuration, to configure your application for forms authentication. <pre>&lt;system.web&gt;<br />&nbsp;&nbsp;&nbsp; ...<br />&nbsp;&nbsp;&nbsp; &lt;authentication mode=\"Forms\" /&gt;<br />&nbsp;&nbsp;&nbsp; &lt;authorization&gt;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;deny users=\"?\" /&gt;<br />&nbsp;&nbsp;&nbsp; &lt;/authorization&gt;<br />&nbsp;&nbsp;&nbsp; ...<br />&lt;/system.web&gt;  </pre></li>\n    <li>\n      <p />Configure health monitoring for the custom event by adding the following &lt;<em>healthMonitoring</em>&gt; element to your application's <em>Web.config</em> file within the &lt;<em>system.web</em>&gt; element. <pre>&lt;healthMonitoring&gt;<br />&nbsp;&nbsp;&nbsp; &lt;eventMappings&gt; <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;add name=\"Password Change Event\" <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; type=\"MyWebEvents.PasswordChangedEvent,MyWebEvents\"/&gt;<br />&nbsp;&nbsp;&nbsp; &lt;/eventMappings&gt;<br />&nbsp;&nbsp;&nbsp; &lt;rules&gt; <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;add name=\"Custom event\" <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; eventName=\"Password Change Event\" <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; provider=\"EventLogProvider\" <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; minInterval=\"00:00:01\"/&gt;<br />&nbsp;&nbsp;&nbsp; &lt;/rules&gt;&nbsp;&nbsp;&nbsp;&nbsp; <br />&lt;/healthMonitoring&gt;  </pre></li>\n    <li>\n      <p>Run the application. Use the <em>CreateUserWizard</em> control to create a new user. The default membership configuration requires a password of at least 7 characters in length with at least one non-alphanumeric character. </p>\n    </li>\n    <li>\n      <p>Use the <em>ChangePassword</em> control to change the user's password. </p>\n    </li>\n    <li>\n      <p />Examine the Windows application event log to verify that the custom event has been raised and logged. You should see details similar to the following. <pre>Event Type:&nbsp; Information<br />Event Source:&nbsp;&nbsp;&nbsp; ASP.NET 3.5<br />Event Category:&nbsp;&nbsp;&nbsp; Web Event <br />Event ID:&nbsp;&nbsp;&nbsp; 1312<br />Date:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 22/06/2009<br />Time:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 12:09:50<br />User:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; N/A<br />Computer:&nbsp;&nbsp;&nbsp; MachineName<br />Description:<br />Event code: 100002 <br />Event message: Password changed <br />Event time: 22/06/2009 12:09:48 <br />Event time (UTC): 22/06/2009 11:09:48 <br />Event ID: 1cc7c6fd96ea459892fd8896ceabf912 <br />Event sequence: 5 Event occurrence: 1 <br />Event detail code: 0<br />Application information:<br />&nbsp;&nbsp;&nbsp;&nbsp; Application domain: 39a139ed-2-127639121611001296<br />&nbsp;&nbsp;&nbsp;&nbsp; Trust level: Full<br />&nbsp;&nbsp;&nbsp;&nbsp; Application Virtual Path: /HealthMonitoring<br />&nbsp;&nbsp;&nbsp;&nbsp; Application Path: C:\\Documents and Settings\\{UserName}\\my documents\\visual studio\\Projects\\Websites\\HealthMonitoring\\<br />&nbsp;&nbsp;&nbsp;&nbsp; Machine name: MachineName<br />Process information:<br />&nbsp;&nbsp;&nbsp;&nbsp; Process ID: 3052<br />&nbsp;&nbsp;&nbsp;&nbsp; Process name: WebDev.WebServer.EXE<br />&nbsp;&nbsp;&nbsp;&nbsp; Account name: DomainName\\UserName<br />&nbsp;<br />Request information:<br />&nbsp;&nbsp;&nbsp;&nbsp; Request URL: http://localhost:2076/HealthMonitoring/default.aspx<br />&nbsp;&nbsp;&nbsp;&nbsp; Request path: /HealthMonitoring/default.aspx<br />&nbsp;&nbsp;&nbsp;&nbsp; User host address: 127.0.0.1&nbsp;&nbsp;&nbsp;&nbsp; User: UserName&nbsp;&nbsp;&nbsp;&nbsp; Is authenticated: True<br />&nbsp;&nbsp;&nbsp;&nbsp; Authentication Type: Forms<br />&nbsp;&nbsp;&nbsp;&nbsp; Thread account name: DomainName\\UserName <br />Custom event details: <br />&nbsp;&nbsp;&nbsp; ******** SampleWebSuccessAuditEvent Start ********<br />&nbsp;&nbsp;&nbsp; Request path: /HealthMonitoring/default.aspx<br />&nbsp;&nbsp;&nbsp; Request Url: http://localhost:2076/HealthMonitoring/default.aspx<br />&nbsp;&nbsp;&nbsp; Password changed<br />&nbsp;&nbsp;&nbsp; ******** SampleWebSuccessAuditEvent End ********<br />For more information, see Help and Support Center at http://go.microsoft.com/fwlink/events.asp.<br /></pre></li>\n  </ol>\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}