{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-752976830",
      "Content_Hash": "221467037"
    },
    "Metadata": [
      {
        "Id": [
          "fb110891-3b63-4f04-b943-213e7847d08d"
        ],
        "Id_History": [
          "fb110891-3b63-4f04-b943-213e7847d08d,d5e99e89-d049-48fa-957c-b8588755915a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Reflection Vulnerabilities"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Reflection Vulnerabilities"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>Summary</h1>\r\n  <p>ASP.NET applications that authenticate their clients using a challenge-response, Diffie-Hellman-like algorithm, for mutual authentication may be vulnerable to reflection attacks where the attacker’s main goal is to trick the application into using its own response as the answer to an authentication challenge.</p>\r\n  <p>Follow these steps to test for reflection bugs in ASP.NET:</p>\r\n  <ul>\r\n    <li>Step 1: Understand attack scenarios </li>\r\n    <li>Step 2: Analyze causes and countermeasures </li>\r\n    <li>Step 3: Execute test cases&nbsp;</li>\r\n  </ul>\r\n  <h1>Step 1: Understand Attack Scenarios</h1>\r\n  <p>First, it is necessary to understand the anatomy of a reflection attack scenario by reviewing a common challenge-response mutual authentication process.&nbsp;During a challenge-response authentication sequence the client connects to the server. The server sends a server challenge <i>sc</i> to the client.&nbsp;The client must then respond to the challenge successfully by sending a client response <i>cr </i>along with its own client challenge <i>cc</i> to the application.&nbsp;The application authenticates the client by verifying the client’s response <i>cr</i> and responds to the client’s challenge <i>cc </i>with a server response <i>sr.</i>&nbsp;The client then validates the server response<i> sr</i> and completes mutual authentication.</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>The client connects to the server. </li>\r\n    <li>The server sends a server challenge <i>sc.</i></li>\r\n    <li>The client creates its own challenge <i>cc </i>sends it along with the client’s response <i>cr </i>to the server’s challenge. </li>\r\n    <li>The server validates the client’s response <i>cr.&nbsp;</i>The server sends its own response <i>sr</i> to the client’s challenge. </li>\r\n    <li>The client validates the server’s response <i>sr.</i></li>\r\n  </ol>\r\n  <p>To exploit a reflection bug an attacker connects to the target application, which in turns sends a target challenge <i>tc</i> to the attacker.&nbsp;As the attacker doesn’t know how to respond to the target’s challenge to complete authentication (the attacker doesn’t know the shared secret) it opens a second connection with the target application and sends the target challenge <i>tc </i>as its own challenge to the application.&nbsp;The attacker waits till the target application responds to the challenge sending a target response <i>tr </i>through the second connection and then uses this response as its own response to complete authentication though the first connection.</p>\r\n  <p>In detail:</p>\r\n  <ol>\r\n    <li>The attacker connects to the target application. </li>\r\n    <li>The target sends the attacker a challenge<i> tc.</i></li>\r\n    <li>The attacker opens a second connection to the target and sends the target challenge as the attacker’s own challenge (<i>ac = tc)</i> through the second connection. </li>\r\n    <li>Through the second connection, the target responds to the attacker’s challenge with a target response <i>tr.</i></li>\r\n    <li>Through the original connection, the attacker uses the target response as its own response (<i>ar = tr</i>). </li>\r\n    <li>Through the original connection, the target validates the attacker response <i>ar </i>and authenticates the attacker.&nbsp;</li>\r\n  </ol>\r\n  <h1>Step 2: Analyze Causes and Countermeasures</h1>\r\n  <p>Now it is necessary to understand what causes and how to protect against reflection bugs.&nbsp;&nbsp; </p>\r\n  <h2>\r\n    Insecure protocol design\r\n  </h2>\r\n  <p>Reflection attacks are possible because of poor implementation of mutual authentication protocols.&nbsp;For instance, in the previous scenario the attacker is able to initiate authentication and the application accepts its own response as an answer to its own challenge.&nbsp;Applications can protect against reflection attacks by using a <i>nonce</i> (number used once).&nbsp;When a client connects to it, the application will start by sending the client a nonce for that specific connection as the server challenge <i>sc. </i>The client must then send his identifier along with the nonce encrypted with the shared key <i>K.&nbsp;</i>The application then decrypts the message sent the client.&nbsp;The application makes sure the response doesn’t correspond to a different challenge by checking if the nonce sent back by the original nonce for the connection.&nbsp;To avoid reflection attacks, the application detects and disallows a nonce being used in the past or used across more than one connection.</p>\r\n  <p>Insecure protocol design occurs in ASP.NET applications that poorly implement an authentication scheme.&nbsp;In most cases, ASP.NET application use authentication for login in their clients to the application.&nbsp;If this is the case, developers are encouraged to use ASP.NET’s Forms Authentication<i></i>which provides a simple environment for client sessions and login forms which is abstracted from the developers. &nbsp;<b>&nbsp;</b></p>\r\n  <h1>Step 3: Execute Test Cases</h1>\r\n  <p>Now that you’ve reviewed the background in reflection attacks it is necessary to execute practical test cases to check if your application is vulnerable.</p>\r\n  <h2>\r\n    Test for Reflection Bugs\r\n  </h2>\r\n  <p>Follow these steps to test for reflection bugs:</p>\r\n  <ol>\r\n    <li>Connect to the target application<i></i>to start authentication. Wait for the application to send a challenge. </li>\r\n    <li>Open a second connection to the target and send the target challenge from the previous step through this connection. Wait for the target application to send a response for the challenge. </li>\r\n    <li>Send the response sent by the application in the previous step through the original connection.</li>\r\n  </ol>\r\n  <p>Expected results:&nbsp;The application is vulnerable to reflection attacks if you are able to successfully authenticate in step 3.&nbsp;</p>\r\n  <h1>Conclusions</h1>\r\n  <p>Reflection attacks focus on exploiting logical flaws on applications using a mutual-authentication protocol and responding to an application challenge using an application’s own response.&nbsp;To test for this bug it is suggested you start by understanding its attack scenario as well as what causes it and how to protect against it.&nbsp;Then execute a trivial test case to check if your ASP.NET application is vulnerable.</p>"
        ]
      }
    ]
  }
}