{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "009f7534-d5e9-413a-9a6c-01a679e34011"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Avoid Dangerous APIs"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nAvoid dangerous APIs. \r\n\r\n\r\n## Why ##\r\n\r\nSome of the most dangerous vulnerabilities are usually caused by the same few APIs on most platforms. Each platform often has its own peculiar features that are prone to causing security vulnerabilities when not used with great care. There are usually safer, alternative APIs available that can do the same thing. It is usually simpler to implement the application using safe APIs than to have to maintain potentially dangerous code. Some notable examples of dangerous APIs are eval(), system(), printf(), etc. but each platform has its own issues and APIs to avoid. \r\n\r\n\r\n## How ##\r\n\r\nTo avoid dangerous APIs:\r\n\r\n1. **Identify the dangerous APIs for your platform.** Look up information about dangerous APIs for your platform. There are additional articles on this subject in TeamMentor. Make a list of each dangerous API for your platform.\r\n\r\n2. **Search code for dangerous APIs.** Use the list of dangerous APIs as a list of search keywords to search code for potential trouble area.\r\n\r\n3. **Rewrite code to use safe APIs.** Wherever calls to dangerous APIs are found, rewrite the code to use safe API alternatives.\r\n\r\n4. **Document code that uses dangerous APIs.** Use this documentation when patching discovered vulnerabilities - when searching for code responsible for vulnerabilities, checking code that is known to use dangerous APIs is a good idea.\r\n\r\n\r\n## Vulnerabilities ##\r\n\r\n* [Code Injection](5869ac6a-0a19-4541-ac8f-0d74e09f3156)"
        ]
      }
    ]
  }
}