{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "01a343ff-a1c7-44d6-a21d-a07f45b1b4d5"
        ],
        "Id_History": [
          "01a343ff-a1c7-44d6-a21d-a07f45b1b4d5,a4b018bd-f846-40f5-b06b-5dcd0a03f29f,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "SSL Is Enabled"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "SSL Is Enabled"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n\r\n==What to Check For==\r\n\r\nVerify that SSL/TLS is used.\r\n\r\n==Why==\r\n\r\nSSL/TLS should be used to protect all pages that handle sensitive data to protect from eavesdropping attacks.\r\n\r\n==How to Check==\r\n\r\nTo verify that SSL/TLS is used:\r\n\r\n# **Browse areas on the web site that require authentication.** Verify that the browser displays that SSL/TLS is being used.\r\n# **Examine the server configuration files.** Review the web application server configuration files to make sure that SSL/TLS is properly configured and is being used.\r\n\r\n==How to Fix==\r\n\r\nThe exact instructions for enabling SSL/TLS are different for different servers. Enabling SSL/TLS is a common task and is well documented for common web server platforms. Links at the bottom of this page lead to documentation that explains how to enable SSL/TLS on different platforms. There are some general guidelines that apply to different platforms:\r\n\r\n# **Get valid certificates.** Purchase a valid SSL certificate. You may purchase a valid SSL/TLS key from VeriSign, Thawte, or your web hosting provider. Follow the vendor's instructions for purchasing the SSL certificate. The certificate is usually a .cer file. \r\n# **Identify sensitive pages.** Make a list of all pages that handle sensitive information, including all pages that use authentication or authorization features.\r\n# **Enable SSL/TLS on the web server. The exact instructions for enabling SSL are different for different web servers. Please, see the links at the bottom of this page for more information about enabling SSL/TLS on some common web application platforms.\r\n# **Use SSL to protect the sensitive pages.** The exact instructions for doing so are different for different web servers. Use the web server administration interface or edit the server configuration files to enable SSL/TLS for all folders containing sensitive pages.\r\n# **Redirect non-SSL requests to SSL-protected pages.** The exact instructions for doing so are different for different web servers. Use the web server administration interface or edit the server configuration files to redirect non-SSL requests to SSL-protected pages. \r\n"
        ]
      }
    ]
  }
}