{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "02b0be6c-99ed-4ff6-8805-8fc0a7402ae5"
        ],
        "Id_History": [
          "02b0be6c-99ed-4ff6-8805-8fc0a7402ae5,f16cae17-c17e-4cd2-9e33-009709432ae7,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Account Administration Functionality Is Secured"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Account Administration Functionality Is Secured"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <p>Scala and Play Framework 2.1.0+</p>\n  <h1>What to Check For</h1>\n  <p>Ensure that the account administration interface is separate from the main application interface.</p>\n  <h1>Why</h1>\n  <p>Account administration requires higher privileges than the main application interface. Separating the two interfaces decreases the risk that a normal user will be able to escalate privileges to that of an administrator.</p>\n  <h1>How to Check</h1>\n  <p>To verify that the account administration interface is separate from the main application interface:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Verify that your application has a separate administrative interface. </strong>Review your application's design and verify that it passes the following checks:</p>\n      <ul>\n        <li>\n          <strong>Administrative Functionality</strong>: Verify that all administrative functionality is clearly identified and separate from the rest of your application's functionality. Exceptions are allowed only when your application allows users to modify their own accounts.</li>\n        <li>\n          <strong>Code Organization</strong>: Ensure all administrative functionality is structured as a single module and not scattered throughout your application.</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Ensure that the administrative interface is secure. </strong>Examine the security of your application's administrative interface:</p>\n      <ul>\n        <li>\n          <strong>Security Policy</strong>: Ensure that your application has a security policy regarding its administrative interface.</li>\n        <li>\n          <strong>Separate Authentication</strong>: Verify that privileged users are forced to re-authenticate before accessing the administrative interface. Check if your application's administrative interface uses a separate authentication module from the rest of your application.</li>\n        <li>\n          <strong>Access Controls</strong>: Verify that only valid, privileged users can access your application's administrative interface.</li>\n        <li>\n          <strong>Connection</strong>: Depending on your application's requirements, it may be necessary to check if your application's administrative interface is utilizing TLS. Ensure your application's proper use of TLS.</li>\n      </ul>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>When designing an administrative interface:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Only privileged users can administer all accounts. </strong>Design\n your application such that the administrative module is separate from \nthe main application interface. Since the separation requires using \nseparate authentication mechanisms for the application and \nadministration, there is a reduced risk of escalation-of-privilege \nattacks.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Users may be allowed to administer their own accounts. </strong>It\n may be necessary to allow users to administer their own accounts. This \ninvolves the ability to change passwords, account details, etc. Such \nadministration can be done through the main application interface. \nBecause the user is modifying sensitive data, extra security precautions\n must be enforced:</p>\n      <ul>\n        <li>\n          <strong>Track userID at the server-side</strong>: The user \nshould always be tracked at the server-side. Store the userID inside a \nsession. The only data the client needs to know is the session \nidentifier. This reduces the risk of an attacker modifying another \nuser's account information.</li>\n        <li>\n          <strong>Force re-authentication</strong>: Enforce \nre-authentication when modifying the user's password. This helps verify \nthat the user is aware of the password change and is not a victim of a \nsession hijacking. Consult the <a target=\"_blank\" style=\"color: rgb(51, 51, 153);\" href=\"479b9ff4-f0fb-4870-8929-8b63b2b7d0b3\">Force Re-Authentication When Executing Critical Functionality</a> guideline for more details.</li>\n        <li>\n          <strong>Modify accounts in sections</strong>: Do not modify \nall account information at once. Split the account modification \nprocedure in sections. For example, group the account information into \ncredentials, personal data, contact information and additional \ninformation. Modifying the account information in groups reduces the \nrisk of information leakage when the user is updating his/her account.</li>\n        <li>\n          <strong>Use TLS when modifying accounts</strong>: The use of \nTLS provides encryption when transmitting sensitive data over the \nnetwork. TLS also certifies the authenticity of the application against \nthe user. Consult the <a target=\"_blank\" style=\"color: rgb(51, 51, 153);\" href=\"5de9c87b-5678-4810-8636-65b720e023bf\">Use TLS When Transmitting Credentials</a> guideline for more details.</li>\n      </ul>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}