{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "06c0bd2f-6d23-45ce-9c08-5145215ca9d8"
        ],
        "Id_History": [
          "06c0bd2f-6d23-45ce-9c08-5145215ca9d8,0a045e0b-bd32-4e50-ba98-b5fb91ed0bec,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Sensitive Data Is Not Cached"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Sensitive Data Is Not Cached"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\n\n- Scala with Play Framework 2.1.0+\n\n\n## What to Check For ##\n\nEnsure that caution is exercised when manipulating sensitive data, and that the data is not cached on the client.\n\n\n## Why ##\n\nSensitive data that is cached on the client can cause significant problems:\n\n- Loss of synchronization with the server. The server's data might change and become inconsistent with the cached data. This is not a security risk but could cause issues with the application's performance.\n\n- The cache may reside on the client following the application's lifespan. Once the application is closed, the cache may be readable by an attacker, leaking sensitive information. This is especially serious in cases where the client is a non-trusted environment, such as a shared computer. Attackers may look up the \"Temporary Internet Files\" or corresponding browser cache and uncover useful fragments of information pertaining to the last logged on user.\n\n\n## How to Check ##\n\nCaching is a mechanism of storing temporary data to avoid frequent server access, which improves an application's performance. There are three types of web caches:\n\n- **Browser caches:** Browser caches let your application's users set aside a section of their computers’ hard disk to store any web data that they have previously obtained. This type of caching is typically useful when a user is reviewing previously visited pages or performing offline browsing.\n\n- **Proxy caches:** Web proxy caches perform like the browser caches but on a larger scale. Typically deployed by network administrators, proxy servers allow hundreds or thousands of users to improve their browsing experience by caching data that is common for all users. Because proxy caches are shared, they are very good at reducing latency and network traffic.\n\n- **Gateway caches:** Also known as \"reverse proxy caches\" or \"surrogate caches\", gateway caches improve the performance of your application at the server level. Typically deployed by application administrators, these caches serve to make web applications more scalable and reliable, as well as improve performance.\n\nBecause caching is a very useful mechanism, developers try to cache as much data as possible. However, this is a downfall when your application serves sensitive data. Use the following steps to ensure that your application does not perform caching when handling sensitive data:\n\n1. **Identify sensitive data.** Sensitive data is any information that is kept secret and should be disclosed only to authorized parties. Common examples of sensitive data include, but are not limited to, customer names, government issued ID numbers, credit card and other financial information, passwords, and private keys. Some industries, such as health care and banking, have regulatory standards that define sensitive information. Use regulatory requirements as they apply to your application to identify sensitive data. Sensitive data can be defined as follows:\n\t- Information that either contains personally identifiable information or can be used to derive personally identifiable information that should not be shared with others.\n\t- Information that a user provides that they would not want shared with other users of the application.\n\t- Information that comes from an external trusted source that is not designed to be shared with users.\n\n2. **Ensure that HTTP headers and meta tags are used to prevent caching.** Ensure that the following techniques are used:\n\t- Verify that pages containing sensitive content have the appropriate cache control tags set.\n\t- Verify that your application includes the appropriate cache control HTTP headers in the outputted HTTP response.\n\n3. **Verify that sensitive data is not stored in hidden fields or script variables.** Check all hidden fields and client-side scripts in your application. Verify that no sensitive data is stored in a hidden field or a script variable. Ensure all sensitive data that needs to be passed back to the application is stored inside server-side sessions.\n\nAn example of storing sensitive data into hidden fields:\n\n\t<input type=\"hidden\" name=\"ccNum\" value=\"4111111111111111\">          \n\nVerify that autocomplete attributes are used. Autocomplete should be disabled for input fields used for sensitive information. This will prevent users' browsers from caching the information. To disable autocomplete, set the \"autocomplete\" attribute to \"off\". For example:\n\n\t<input type=\"password\" name=\"pass\" autocomplete=\"off\" />\n\n\n## How to Fix ##\n\nJavascript variables and hidden input fields must not be used to store sensitive data, which may be rendered invalid. The only thing that may be stored on the client side across browser requests should be the Session ID. Session IDs are most often stored in an HTTP cookie, though other solutions exist.\n\nAutocomplete should be disabled for input fields used for sensitive information. This will prevent users' browsers from caching the information. To disable autocomplete, set the \"autocomplete\" attribute to \"off\". For example:\n\n\t<input type=\"password\" name=\"pass\" autocomplete=\"off\" />\n\nWeb pages containing sensitive data should be marked as such, using appropriate meta tags, to prevent caching. When generating/serving the web page, add the appropriate HTTP headers. This will serve as a guideline to proxies and browsers alike that the data must not be cached. A possibly negative impact of this is the invalidation of the browser \"back\" button.\n\nExamples of the appropriate META tags and HTTP headers are below:\n\nCaching META tags:\n\n\t<HTML>\n\t  <HEAD>\n\t\t<META HTTP-EQUIV=\"CACHE-CONTROL\" CONTENT=\"NO-CACHE\">\n\t\t<META HTTP-EQUIV=\"PRAGMA\" CONTENT=\"NO-CACHE\">\n\t\t<META HTTP-EQUIV=\"EXPIRES\" CONTENT=\"-1\">\n\t\t...\n\t  </HEAD>\n\t  <BODY>\n\t\t...\n\t  </BODY>\n\t</HTML>\n\nCaching HTTP Headers (an example of a Global.scala class):\n\n\timport play.api._\n\timport play.api.mvc._\n\timport play.api.http.HeaderNames._\n\n\t/**\n\t * Global application settings.\n\t */\n\tobject Global extends GlobalSettings {\n\n\t  /**\n\t   * Global action composition.\n\t   */\n\t  override def doFilter(action: EssentialAction): EssentialAction = EssentialAction { request =>\n\t\taction.apply(request).map(_.withHeaders(\n\t\t  PRAGMA -> \"no-cache\"\n\t\t  Cache-Control -> \"no-cache\"\n\t\t  Expires -> \"-1\"\n\t\t))\n\t  }\n\t}\n\n"
        ]
      }
    ]
  }
}