{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "06f6d4b0-4ba4-4b73-ba58-1e41aa3eecbd"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Separate Parameters from Command Names"
        ],
        "Category": [
          "Dangerous APIs"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Ruby"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- Ruby\r\n\r\n\r\n## What to Do ##\r\n\r\nUse the Ruby `system` method to separate parameters from command names. Do not concatenate parameter values or use interpreter commands directly when a safer, parameterized solution is available.\r\n\r\n\r\n## Why ##\r\n\r\nYour Ruby programmatic code is a bridge between the user and system resources. The internals of the operating system can be exposed by Ruby commands, including `exec(command)`, `syscall(command)`, `system(command)`, and `command`. If these methods are used improperly, your coding technique may expose sensitive data to an intruder. If a developer allows untrusted input, attackers are able to inject their own commands into communication messages. Unexpected, dangerous commands can be executed directly in the operating system, even when the attacker does not have direct access to the resources.\r\n\r\nIf parameters are not separated from commands, an attacker may be able to specify commands that are beyond the privileges of the user. The result is that special system privileges may possibly be used, and the amount of damages would be extensive, costly, and in some cases, unrecoverable.\r\n\r\n\r\n## When ##\r\n\r\nAlways use user-supplied command line parameters with caution. If the Ruby application must execute commands in the operating system, be overly-cautious in the use of `exec`, `syscall`, `system`, and `command`. When the commands are combined with user input, means must be used to not allow concatenation of additional commands with a semicolon (;) or a vertical bar (|).\r\n\r\n\r\n## How ##\r\n\r\nTo separate parameters from commands names, follow these steps:\r\n\r\n1. **Find all calls to external commands.** Search for any code that executes external operating system commands. The commands are system-specific, and may include `exec`, `syscall`, `system`, and `command`. Be sure to familiarize yourself with all system calls that may be executed.\r\n\r\n2. **Identify parameterized solutions.** Review the associated documentation for classes and APIs that present secure methods for your calling statements. The goal is to neutralize any commands that could be modified when sent downstream.\r\n\r\n3. **Avoid using external processes.** Review each case where an external process is called, to determine if the call is absolutely necessary. Command injection vulnerabilities are very dangerous, so calling external processes should be avoided whenever possible to reduce the risk of such threats. If external processes must be used, be sure to use mitigation techniques.\r\n\r\n4. **Avoid direct use of external processes.** Remove any code that directly executes external commands and replace the code with best practice coding and/or or APIs that enforce parameterization. Do not let the user choose the external application or method. Allowing the user this choice is essentially the definition of a command injection vulnerability.\r\n\r\n5. **Validate data passed to command execution APIs and external commands.** Input passed to external commands should be very carefully validated. Even if parameterization is used, passing untrusted user data to such processes may result in command injection vulnerabilities. User data should be positively validated in all cases before being passed on.\r\n\r\n6. **Use parameterized command method.** Replace all code previously identified with the parameterized `system` method. Be sure to use positive input validation on data passed to the `system` method. Use the countermeasure `system(command, parameters)` to pass command line parameters safely:\r\n\r\n\t\tsystem(\"/bin/echo\",\"hello; rm *\")\r\n\t\t# prints \"hello; rm *\" and does not delete files\r\n\r\n"
        ]
      }
    ]
  }
}