{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "0c167dc8-c7c6-49df-a146-a46f819338cb"
        ],
        "Id_History": [
          "0c167dc8-c7c6-49df-a146-a46f819338cb,7ca24b7f-7378-4f5d-826e-1181c40ce60d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6204f2d47eb7"
        ],
        "Title": [
          "Session Hijacking"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "Session Hijacking"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Description==\r\n\r\nSession hijacking (a.k.a. credential and session prediction) vulnerabilities occur when the application uses easy to predict session identifiers or other easy to predict methods to track user sessions.  This allows an attacker to guess the session identifier of a user and then carry out actions on the behalf of that user within the application.\r\n\r\nAll web applications that use sessions are potentially affected by session hijacking vulnerabilities.\r\n\r\n==Impact==\r\n\r\nThe impact of session hijacking vulnerabilities is that an attacker will be able to carry out actions on behalf of authenticated users with currently active sessions. \r\n\r\nThe greatest danger occurs when an attacker is able to hijack an administrative session. This enables the attacker to perform actions with administrative privileges and attempt to inject malicious code into the application or its data. If the attacker is able to inject malicious code, they will be able to execute arbitrary code on the server with the privileges of the compromised application. \r\n\r\nIn the event that the attacker compromises the session of a regular user, they will be able to perform actions on behalf of the hijacked user account. Usually, the attacker will be able to take over the account by changing the password, send messages to other users if the application allows it, and access the user's application data.\r\n\r\n==Countermeasures==\r\n\r\nTo prevent session hijacking vulnerabilities, use platform-provided session management and force re-authentication for sensitive operations.\r\n\r\n* [[96059535-1543-458e-afb7-e40360b9dcd2|Use ASP.NET Session Management]]\r\n\r\n* [[ae289022-d611-4fe4-b177-45066a398da8|Force Re-authentication When Executing Critical Functionality]]\r\n\r\n==Application Check==\r\n\r\nTo make sure that session hijacking vulnerabilities are prevented, verify that platform-provided session management is used and re-authentication is forced for sensitive operations.\r\n\r\n* [[505042f3-ae71-4a3a-bf71-03fa1dbe34a7|ASP.NET Session Management Is Used]]\r\n\r\n* [[4e186cf4-06df-4cf1-aeb9-731e218612d1|Re-authentication Is Enforced When Executing Critical Functionality]]\r\n\r\n==Additional Resources==\r\n\r\n* For more information about credential and session prediction, see http://projects.webappsec.org/w/page/13246918/Credential%20and%20Session%20Prediction\r\n"
        ]
      }
    ]
  }
}