{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "0d489ceb-0472-4f1c-9f69-edb53f81796b"
        ],
        "Id_History": [
          "0d489ceb-0472-4f1c-9f69-edb53f81796b,d3d14612-ce46-43c7-b8da-e9d62d84001f,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Improper Input Handling"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "Improper Input Handling"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Description==\n\nImproper input handling vulnerabilities occur when the application does not properly validate or encode user input. (The difference between validation and encoding is that validation will reject input data that does not match the expected format, while encoding will take whatever data passes validation and turn it into a form that cannot be used to exploit additional vulnerabilities.) \n\nIf the application does not validate user input, an attacker can pass malicious data to the application to exploit additional vulnerabilities that might be present in the application. \n\nIf data is not encoded properly when it is being processed, it might include exploit code that targets additional vulnerabilities within the application. \n\nIf data is not encoded properly when it is being displayed, the data might include exploit code that attacks the user of the application. \n\nIn general, improper input handling allows additional vulnerabilities to be exploited, while proper input handling prevents them from being exploited. Proper input handling should always be implemented. It is the first line of defense for application security and is effective against most common vulnerabilities. \n\nAll applications are affected by improper input handling vulnerabilities. Improper input handling vulnerabilities are one of the most common types of vulnerabilities and frequently result in additional vulnerabilities.\n\n\n==Impact==\n\nThe overall impact of improper input handling vulnerabilities depends on the additional vulnerabilities that are present in the application. The immediate impact  is that it allows additional vulnerabilities to be exploited. If there are no additional vulnerabilities, then the application itself will not be affected. \n\nHowever, if input data is not encoded properly before being displayed to the users, the data might contain exploit code that attacks the users, usually in the form of a cross-site scripting (XSS) attack. A successful attack on the users typically results in the attacker gaining some degree of access to the application itself. If the attacker gains sufficient access to the application as a result of compromising the systems of the users, the attacker will be able to take over the application. \n\nIf input is not properly validated, then the attacker will be able to send exploit code to the application to trigger additional vulnerabilities. This particularly applies to injection attacks. For example, if an application has a username field and the username input is not validated, the attacker will be able to inject SQL attack strings to the vulnerable code through that field. If the input is properly validated, the attacker will not be able to pass SQL attack strings through the field, because they will not match the valid username format.\n\nIf input is not properly encoded when it is being processed, then the attacker might include exploit code to the application to trigger additional vulnerabilities. For example, if an application uses parameterized APIs to encode input data that is used to query an SQL database, even if the attacker is able to smuggle SQL attack strings past validations, they will be encoded into forms that will not be interpreted as queries by the SQL driver, thus preventing SQL injection. Correct use of parameterized APIs that encode data automatically and correctly is the most effective way to prevent injection vulnerabilities, including SQL injection, command injection, code injection and cross-site scripting (XSS).\n\n\n==Countermeasures==\n\nTo prevent improper input handling vulnerabilities, validate all input and encode all untrusted data that is going to be processed or displayed for the correct context.\n\n* [[11a15f3a-7fe8-4e4c-be5e-309ab7227b3d|Validate All Input]]\n\n* [[9b0ef1a5-c143-4e64-81cc-9e02ccbd9fbd|Encode Untrusted Data in Output]]\n\n\n==Application Check==\n\nTo make sure that sufficient defenses are implemented against input handling vulnerabilities, verify that all input is validated and that all untrusted data that is going to be processed or displayed is encoded for the correct context.\n\n* [[8d8c24b0-096b-43f4-9391-9b293313a0e8|All Input Is Validated]]\n\n* [[13112146-7c14-4b6d-9e94-24daa22eefc4|Echoed Input Is Encoded]]\n\n\n==Computer Based Training Links==\n\nUse the following Computer Based Training course(s) for more background information about this type of vulnerabilities.\n\n===Fundamentals of Application Security===\n\nThis two-part course is ideal for security and development practitioners that want to understand software security risk and seek specific implementation guidance on how to build and deploy more secure software applications.  It starts off describing why software security is critical and the risk that software vulnerabilities represent, and proceeds to lay the foundation for secure software development by presenting specific security controls and principles that development teams can implement immediately to reduce software risk. \n\n[[https://teamprofessor.absorbtraining.com/ninja/#/courses/course/127105|AWA 101 Fundamentals of Application Security]]\n\n//Valid login credentials and enrollment in the course itself are required to access Team Professor content. If you need login credentials, please contact support@securityinnovation.com for help.//"
        ]
      }
    ]
  }
}