{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "102fa882-8f61-496d-b3a5-b6f2c75f1136"
        ],
        "Id_History": [
          "102fa882-8f61-496d-b3a5-b6f2c75f1136,95d44a75-c588-4356-a9ac-e094a60223ff,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Sensitive and Resource Intensive Operations Are Throttled"
        ],
        "Category": [
          "Other"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Sensitive and Resource Intensive Operations Are Throttled"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET 4.0\r\n\r\n==What to Check For==\r\n\r\nMake sure that sensitive and resource intensive operations are throttled.\r\n\r\n==Why==\r\n\r\nThrottle sensitive and resource intensive operations to thwart automated attack tools.\r\n\r\n==How to Check==\r\n\r\nTo make sure that sensitive and resource intensive operations are throttled:\r\n\r\n# **Identify code that implements sensitive operations.** Make a spreadsheet about sensitive operations performed by the application and the code that implements them. Some examples of sensitive operations are: authentication, user management, administrative actions, and file uploads.\r\n# **Identify code that implements resource intensive operations.** Make a spreadsheet about resource intensive operations performed by the application and the code that implements them. Some examples are: search functionality, anything that performs expensive database lookups, anything that performs a lot of computations, anything that performs a lot of disk access, anything that takes up a lot of memory, anything that sends a lot of network traffic, anything that sends email.\r\n# **Verify that sensitive operations are throttled.** Examine the code that performs sensitive operations to make sure that some kind of throttling mechanism is used to limit the frequency with which a user is able to perform each sensitive operation.\r\n# **Verify that resource intensive operations are throttled.** Examine the code that performs resource intensive operations to make sure that some kind of throttling mechanism is used to limit the frequency with which a user is able to perform each resource intensive operation.\r\n\r\n==How to Fix==\r\n\r\nTo throttle sensitive and resource intensive operations:\r\n\r\n# **Identify code that implements sensitive operations.** Make a spreadsheet about sensitive operations performed by the application and the code that implements them. Some examples of sensitive operations are: authentication, user management, administrative actions, and file uploads.\r\n# **Identify code that implements resource intensive operations.** Make a spreadsheet about sensitive operations performed by the application and the code that implements them. Some examples are: search functionality, anything that performs expensive database lookups, anything that performs a lot of computations, anything that performs a lot of disk access, anything that takes up a lot of memory, anything that sends a lot of network traffic, anything that sends email.\r\n# **Choose a throttling mechanism.** Choose  a throttling mechanism for each sensitive and resource intensive operation. Some common throttling mechanisms are: CAPTCHA, time-out per user session, and time-out per IP. The amount of throttling depends on the amount of resources available to the application and the cost of performing the operation that is being throttled. It is recommended to only allow authenticated users to perform sensitive and resource intensive operations and to impose time-outs per user session. For example, only authenticated users should be allowed to perform searches and only one search per second. Authentication is a sensitive operation that cannot be performed by authenticated users, so it can either be throttled by IP, using a CAPTCHA, using time-outs per username or using time-outs per session. It is recommended to throttle authentication by IP and by time-outs per username. (A session state can be created for unauthenticated users and this session state can be used to impose time-outs on authentication but this isn't sufficient, because the attacker can drop the session state cookie.) \r\n# **Add throttling to sensitive operations.** Add code that implements the chosen throttling mechanism to each sensitive operation.\r\n# **Add throttling to resource intensive operations.** Add code that implements the chosen throttling mechanism to each resource intensive operation.\r\n"
        ]
      }
    ]
  }
}