{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "10886993-6dcd-4905-b577-2032edd530c5"
        ],
        "Id_History": [
          "10886993-6dcd-4905-b577-2032edd530c5,933d2bb8-1f01-4a25-acf6-38c491d595c2,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use TLS"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use SSL"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>Scala and Play Framework 2.1.0+<br /><h1>What to Do</h1><p>Enable TLS for all the sensitive pages on the web application server.</p><h1>Why</h1><p>TLS should be used to protect all pages that handle sensitive data to protect from eavesdropping attacks.</p><h1>When</h1><p>Always enable TLS for all the sensitive pages on the web application server.</p><h1>How</h1><p>The exact instructions for enabling TLS are different for different servers. Enabling TLS is a common task and is well documented for common web server platforms. Links at the bottom of this page lead to documentation that explains how to enable TLS on different platforms. Some general guidelines apply:</p><ol><li><p><strong>Get valid certificates.</strong>&amp;nbsp;Purchase a valid TLS certificate. You may purchase a valid TLS key from VeriSign, Thawte, or your web hosting provider. Follow the vendor's instructions for purchasing the TLS certificate. The certificate is usually a .cer file.</p></li><li><p><strong>Identify sensitive pages.</strong>&amp;nbsp;Make a list of all pages that handle sensitive information, including all pages that use authentication or authorization features.</p></li><li><p><strong>Enable TLS on the web server.</strong>&amp;nbsp;The exact instructions for enabling TLS are different for different web servers. Please see the links at the bottom of this page for more information about enabling TLS on some common web application platforms.</p></li><li><p><strong>Use TLS to protect the sensitive pages.</strong>&amp;nbsp;The exact instructions for doing so are different for different web servers. Use the web server administration interface or edit the server configuration files to enable TLS for all folders containing sensitive pages.</p></li><li><p><strong>Redirect non-TLS requests to TLS-protected pages.</strong>&amp;nbsp;The exact instructions for doing so are different for different web servers. Use the web server administration interface or edit the server configuration files to redirect non-TLS requests to TLS-protected pages.</p></li></ol><h1>Additional Resources</h1><ul><li>For information about using TLS on Nginx as front-end server with Scala and Play Framework , please see&amp;nbsp;<a href=\"http://tomcat.apache.org/tomcat-6.0-doc/ssl-howto.html\">ww.playframework.com/documentation/2.1.1/HTTPServer</a></li></ul>"
        ]
      }
    ]
  }
}