{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "10d68548-6322-4a61-a24c-1dbdad4e75ef"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Perform Code Reviews for Cloud Deployments"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##Applies To##\r\n\r\n- Amazon Web Services (AWS)\r\n\r\n\r\n##What to Do##\r\n\r\nIdentify security objectives and effectively review code for security issues. Identify the type of issues that have security implications for your cloud code. Use automatic and manual methods to scan the code, and generate a list of security issues prioritized for repair. Submit change requests for code updating in accordance with change control policy.\r\n\r\n\r\n##Why##\r\n\r\nA properly-conducted code review for cloud deployments ensures the security posture is maintained at a safe level. A code review may lead you to find newly discovered vulnerabilities in the deployment, and is also valuable in identifying newer types of exploits for your controls in place.\r\n\r\nThe code review process enables sharing of security best practices within the development team. This can help prevent future security issues.\r\n\r\nPCI DSS (Requirement 6.3.2) calls for mandatory code review by individuals who are not the code author. The code reviewers must be knowledgeable and experienced with secure coding practices (Requirement 6.5).\r\n\r\n\r\n##When##\r\n\r\nCloud code reviews are conducted periodically throughout deployment. Your security policy states minimum intervals for code review milestones. It is also necessary to review code when new threats appear, or old exploits are modified to exploit different vulnerabilities. When the configuration of sub-components changes in your deployment, you must review any affected code to prevent the introduction of vulnerability. If you receive security bulletins notifying you of the availability of zero day fixes, review your development platform code library, and update libraries as recommended.\r\n\r\n\r\n##How##\r\n\r\nThe code review process for deployment, and its findings, should be documented and recorded. Other steps may be required by your security management policy before your findings are implemented in revised code.\r\n\r\n1. **Identify security code review objectives.** Establish goals and constraints for the review. Understand the attack surface. Some vulnerability types can have elevated priority and others can be out of scope based on your security objectives. For more information about security code review coverage, see https://www.owasp.org/.\r\n\r\n2. **Perform a preliminary scan.** Use automated security analysis tools to find an initial set of security issues and to improve your understanding of where you will most likely find security issues when you review the code more fully.\r\n\r\n3. **Review the code for security issues.** Use the results of step 2 to focus your analysis. Review the code thoroughly with the goal of finding security vulnerabilities that are common to many applications. Sample portions of the code, and manually review.\r\n\r\n4. **Review for security issues unique to the architecture.** Complete a final analysis by looking for security issues that relate to the interaction of code with the unique architecture of your cloud deployment. In particular, carefully inspect custom security mechanisms and features which are mitigating a known security threat.\r\n\r\n5. **Prioritize the security issues found.** Prioritization should be based on the impact the security issue could have on the cloud deployment. Use threat modeling technique to identify the maximum damage potential. Use this information to rank your findings.\r\n\r\n6. **Evaluate the risks of fixing security issues.** Each security issue fixed has the potential to introduce a new, unknown security issue. Sometimes the security issue you know is less dangerous than the security issue you don't. If an issue can be mitigated immediately through a policy change, it may be more effective to delay the code change.\r\n\r\n7. **Initiate code change.** Record your findings and recommendations. Initiate cloud deployment update requests in accordance with change management policy and procedure.\r\n\r\n\r\n##Additional Resources##\r\n\r\n- [AWS Security Best Practices](http://aws.amazon.com/security/ \"AWS Security Best Practices\")\r\n- [Payment Card Industry (PCI) Data Security Standard (DSS) - Requirements and Security Assessment Procedures](https://www.pcisecuritystandards.org/security_standards/index.php \"PCI DSS Requirements and Security Assessment Procedures\")\r\n- [Security Architecture and Design Review](https://msdn.microsoft.com/en-us/library/ \"Security Architecture and Design Review\")\r\n- [Security Code Review Coverage](https://www.owasp.org/ \"Security Code Review Coverage\")\r\n"
        ]
      }
    ]
  }
}