{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "11a15f3a-7fe8-4e4c-be5e-309ab7227b3d"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Validate All Input"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* All applications\r\n* All system types\r\n\r\n## What to Do ##\r\n\r\nValidate all untrusted input using whitelist/positive input validation. Whitelist input validation allows only input that is explicitly defined as valid, as opposed to blacklist input validation, which filters out known bad input. Identify all types of input handled by the application and determine the valid format for each type, then add checks in code to make sure the data is valid before processing it.\r\n\r\n## Why ##\r\n\r\nProperly implemented input validation mitigates many types of injection vulnerabilities, such as Cross-Site Scripting and SQL injection. For native code applications, input validation can also mitigate memory management issues, such as Buffer Overflows.\r\n\r\n## How ##\r\n\r\nTo validate all untrusted input using whitelist input validation:\r\n\r\n1. **Identify all entry points for untrusted input.** Make a list of all possible sources of untrusted input in your application. For a web application, this includes: form fields, request parameters, cookies, headers, files and databases. For a rich client or a mobile application, this includes: keyboard input, files, databases and network connections. \r\n\r\n2. **Identify all types of input accepted by the application.** For each source of untrusted input on the list, define valid characters, length, format, and range (for numerical values).\r\n\r\n3. **Define an input validation subsystem.** Define a set of validator functions to validate each type of input handled by the application. Input has to be validated on the server for client-server applications; it can be validated on the client-side as well, but not instead of on the server.\r\n\r\n4. **(All input) Validate length.** Add code to all validators to check that the length of the untrusted input is valid. Checking length before using regular expressions helps prevent regular expression Denial-of-Service attacks.\r\n\r\n5. **(Text input) Validate characters.** Add code to validators that handle text input to restrict the acceptable range of characters in text input using regular expressions.\r\n\r\n6. **(Structured input) Validate format.** For validators that handle input that has a specific pattern, such as a date or a phone number, use regular expressions to make sure untrusted input matches the input type specified by the application. \r\n\r\n7. **(Numeric input) Validate range.** For validators for numeric input, add code to restrict the acceptable range of numerical input by comparing the input to the maximum and minimum acceptable values.\r\n\r\n8. **(Optional) Reject and respond to known bad input.** This step does not add much actual security, but it might provide defense in depth. The input validation subsystem can check for known attack strings and respond to these likely attacks by doing things like logging detailed attacker information, alerting the administrator, blocking the attacker's IP address for some time, and displaying an error message to the attacker. \r\n\r\n9. **(Context-sensitive) Encode input.** If the input is going to be displayed back through a web browser, consider encoding it to prevent Cross-Site Scripting attacks before processing or storing it. Be careful not to introduce double-encoding issues by encoding this data again elsewhere in the code.\r\n\r\n\r\n## Computer Based Training ##\r\n\r\nUse the following Computer Based Training course for more information about data validation:\r\n\r\n* [AWA 101 Fundamentals of Application Security](https://teamprofessor.absorbtraining.com/ninja/#/courses/course/127105) - This two-part course is ideal for security and development practitioners that want to understand software security risk and seek specific implementation guidance on how to build and deploy more secure software applications.  It starts off describing why software security is critical and the risk that software vulnerabilities represent, and proceeds to lay the foundation for secure software development by presenting specific security controls and principles that development teams can implement immediately to reduce software risk. \r\n\r\n*Valid login credentials and enrollment in the course itself are required to access Team Professor content. If you need login credentials, please contact support@securityinnovation.com for help.*\r\n\r\n\r\n## Code Examples ##\r\n\r\n* [.NET](e59923e7-c2fb-4a75-8db7-a9a91e869f74)\r\n* [Java JSP](c98695c5-cf02-44a1-96bf-1f8046b8ad9d)\r\n* [Java JSF](0f49430b-2abe-408f-b046-89fa739f5d53)\r\n* [Java SpringMVC](18ac74df-602b-4a58-8998-52f638f3a045)\r\n* [Java Struts 1](d124abb1-e230-43ef-8762-1caa0dbb89ca)\r\n* [Java Struts 2](2f917654-65a8-49c9-b000-c17f9765bf42)\r\n* [Scala](b6795407-d01e-44ec-8aed-a440d388902b)\r\n* [Ruby](bfe99a04-1254-47a9-acae-f3dd233f9315)\r\n* [Ruby - Anchor Regular Expressions](15aa6cfc-9e95-44a6-8e6f-25bc2fac7911)\r\n\r\n\r\n## Vulnerabilities ##\r\n\r\n* [SQL Injection](c4914e51-2609-4edc-8133-31491f1b03c0)\r\n* [Command Injection](94e52aca-06b6-4747-9bc9-f0149208f18c)\r\n* [Code Injection](5869ac6a-0a19-4541-ac8f-0d74e09f3156)\r\n* [Cross-Site Scripting](683d33a8-7979-4307-8cf0-3a82457f9f47)\r\n* [Buffer Overflow](0530569f-b6bb-4a31-ae68-55dac9f4781a)\r\n\r\n\r\n## Guides ##\r\n\r\n* [Data Validation Guide](bf53d602-1d86-489c-858d-f5efb6424412)\r\n"
        ]
      }
    ]
  }
}