{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "11a15f3a-7fe8-4e4c-be5e-309ab7227b3d"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Validate All Input"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nValidate all user input using whitelist/positive input validation. Whitelist input validation allows only input that is explicitly defined as valid, as opposed to blacklist input validation, which filters out known bad input.\r\n\r\n## Why ##\r\n\r\nProperly implemented input validation mitigates many types of injection vulnerabilities, such as Cross-Site Scripting and SQL injection.\r\n\r\n## How ##\r\n\r\nTo validate all user input using whitelist input validation:\r\n\r\n1. **Identify all entry points for user input.** Make a list of all possible sources of user input in your application.\r\n\r\n2. **Identify all types of input accepted by the application.** For each source of user input on the list, define valid characters, length, format, and range (for numerical values).\r\n\r\n3. **Define an input validation subsystem.** Define a set of validator functions to validate each type of input handled by the application. Input should be validated on the server.\r\n\r\n4. **Validate length.** Check that the length of the user input is valid. Checking length before using regular expressions helps prevent regular expression Denial-of-Service attacks.\r\n\r\n5. **Validate characters.** Restrict the acceptable range of characters in text input using regular expressions.\r\n\r\n6. **Validate format.** If the input type has a specific pattern, such as a date or a phone number, use regular expressions to make sure user input matches the input type specified by the application. Use regular expressions to enforce strong password requirements.\r\n\r\n7. **Validate range.** Restrict the acceptable range of numerical input by comparing the input to the maximum and minimum acceptable values.\r\n\r\n8. **(Optional) Reject and respond to known bad input.** This step does not add much actual security, but it may provide defense in depth. The input validation subsystem may check for known attack strings and respond to these likely attacks by alerting the user. The options for responding to invalid input are: reject invalid input, log invalid input, take evasive action.\r\n\r\n9. **(Optional) Encode input.** If the input is going to be displayed back through the web application, consider encoding it to prevent Cross-Site Scripting attacks.\r\n"
        ]
      }
    ]
  }
}