{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "11b418e8-895c-4061-8631-d631aef36a24"
        ],
        "Id_History": [
          "11b418e8-895c-4061-8631-d631aef36a24,12429c23-013c-43f5-b922-d900428e67f1,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Logs Are Protected"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Logs Are Protected"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\r\n\r\nEnsure log files are protected.\r\n\r\n==Why==\r\n\r\nLog files often contain internal application details that could enable an attacker to more effectively target your application.\r\n\r\n==How to Check==\r\n\r\nUse these steps to ensure log files are protected:\r\n\r\n# **Verify that the log location is not disclosed.** Scan your application's code base to verify that the location of the log files is known only to the internal logging framework.\r\n# **Check the file permissions of logs.** Verify that the logs are set with the appropriate file system permissions. All entities, excluding your application and its administrators/developers, must be prohibited access to the logs. If your application backs up its logs, verify that log backups are stored into an environment that is as secure as the storage environment for the current logs.\r\n# **Check the log server capabilities.** The log server should protect the log files. Ask the vendor for information about controls used to protect the log files on the log server.\r\n# **Check that only users with job-related needs have access to logs.** Verify that only authorized employees have user accounts on the log server. Examine the administration interface on the log server to get a list of users. Make sure that all the users are authorized and that their authorizations are based on legitimate job-related needs by interviewing them.\r\n# **Check that measures are taken to prevent tampering.** Consult the documentation or technical support to make sure the log server solution implements measures to prevent tampering. Verify that the log server is physically secure, preferably in a separate locked room.\r\n# **Verify that logs are current.** Get the list of network devices from the network documentation. For a random sample of devices, verify that the logs from them are present on the log server and that the logs are current.\r\n# **Confirm file-integrity monitoring capability.** Consult the vendor's documentation or technical support to make sure the log server solution implements some form of file-integrity monitoring.\r\n\r\n==How to Fix==\r\n\r\nPerform the following actions to secure the log files:\r\n\r\n# **Secure the log server.** All the functionality to comply with this requirement should be provided by the centralized log server. Ask the vendor for information about securing the log server.\r\n# **Only allow access to users with job-related needs.** Most centralized log servers have built-in access control. The flexibility of this access control is different for different solutions. To satisfy this requirement, it is sufficient to only create access accounts for authorized employees who have a legitimate job-related need to view the logs. Ideally, the authentication mechanism on the log server should be integrated with the rest of the network.\r\n# **Prevent tampering.** Most centralized log server solutions have built-in controls to prevent tampering. The exact controls vary, but they typically include an access control list and some means of preventing privileged users or users with physical access from altering the log files. The latter typically does not need to be configured. It is recommended to segregate the log server physically by placing it in a locked room.\r\n# **Configure all network devices to send logs to the log server.** Forward the logs from all compatible devices to the log server. For detailed instructions on sending the logs to the log server, please refer to the vendor's documentation or technical support.\r\n# **Configure file-integrity monitoring.** This feature should be implemented by the log server solution itself. It should not require configuration on the part of the staff. Please refer to the vendor's documentation or technical support to make sure that your log server is compliant with this requirement.\r\n"
        ]
      }
    ]
  }
}