{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "16bac044-a243-4e5b-98dd-683e0040efc2"
        ],
        "Id_History": [
          "16bac044-a243-4e5b-98dd-683e0040efc2,5bf4c910-d6b2-4cb8-bad8-42b85cc8cc63,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "SOAP Array Sizes Are Validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "SOAP Array Sizes Are Validated"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Web Services\n\n\n==What to Check For==\n\nVerify that SOAP array sizes are validated using schemas before SOAP messages are passed to the parser.\n\n\n==Why==\n\nValidate SOAP array size to prevent SOAP array abuse attacks. SOAP array abuse occurs when an attacker sends SOAP messages that say they have very large arrays in them. The parser allocates a lot of memory upon seeing such messages, so the attacker is able to exhaust the server's memory by sending a large amount of these SOAP messages rapidly. The result of SOAP array abuse is a denial of service condition.\n\n\n==When==\n\nUse this checklist item for applications that use SOAP.\n\n\n==How to Check==\n\nTo verify that SOAP array sizes are validated:\n\n# **Find all code that uses SOAP messages.** Create a spreadsheet of all code that handles SOAP messages. Schema validation should be performed whether or not SOAP arrays are present in messages, so include all code that handles SOAP messages in the spreadsheet.\n# **Verify that SOAP messages are validated.** Examine each piece of code that handles SOAP messages to make sure it uses schemas to validate each message before passing it to the parser.\n# **Verify that maximum array size is specified in schemas.** Examine each schema used to validate SOAP messages to make sure that all arrays have reasonable maximum sizes explicitly specified.\n\n\n==How to Fix==\n\nTo validate SOAP array size:\n\n# **Find all code that uses SOAP messages.** Create a spreadsheet of all code that handles SOAP messages. Schema validation should be performed whether or not SOAP arrays are present in messages, so include all code that handles SOAP messages in the spreadsheet.\n# **Define schemas that limit the maximum size of SOAP arrays.** Write a schema for each type of SOAP message that is handled by your application. Set the maximum sizes of SOAP arrays in each schema. While doing this, set the known maximums and minimums for other values in the schemas to take full advantage of schema validation.\n# **Add code that validates SOAP array size using the schemas.** Validate SOAP messages using the schema that limits the maximum size of SOAP arrays and is appropriate for the message. Validate SOAP messages before passing them to the parser.\n\n==Additional Resources==\n\n* For more information about SOAP array validation, see http://clawslab.nds.rub.de/wiki/index.php/Soap_Array_Attack\n"
        ]
      }
    ]
  }
}