{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "17176ab2-aeee-4847-bd4a-a4109040710b"
        ],
        "Id_History": [
          "17176ab2-aeee-4847-bd4a-a4109040710b,0321e060-4497-4644-b9d3-8a431c4bb983,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "A Strong PRNG Is Used"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "A Strong PRNG Is Used"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Java\n\n==What to Check For==\n\nVerify that a cryptographically strong pseudo-random number generator (PRNG) is used for cryptography.\n\n==Why==\n\nMost common encryption algorithms rely on difficult to predict random numbers to be used properly. The level of difficulty to predict or enumerate the output of a random number generator is called its entropy. Cryptographically strong PRNGs are software algorithms that produce pseudo-random numbers considered to have sufficient entropy to be suitable for use in cryptography. Using PRNGs that have low entropy is likely to make the resulting cryptographic solution easier to break and thus compromise the data or the authentication mechanism that the solution is used for.\n\n==How to Check==\n\nTo verify that a cryptographically strong pseudo-random number generator (PRNG) is used for cryptography:\n\n# **Find code that uses PRNGs.** Review all code that uses cryptography to find code that uses pseudo-random numbers. Make a spreadsheet of all the code that uses pseudo-random numbers for cryptography. \n# **Verify that the java.security.SecureRandom class is used.** Review each piece of code that uses pseudo-random numbers for cryptography and make sure that it uses the java.security.SecureRandom class as the PRNG.\n\n\n==How to Fix==\n\nTo use cryptographically strong PRNGs:\n\n# **Find code that uses PRNGs.** Review all code that uses cryptography to find code that uses pseudo-random numbers. Create a spreadsheet of all the code that uses pseudo-random numbers for cryptography. \n# **Use the java.security.SecureRandom class.** Update all code that uses PRNGs for cryptography to use the java.security.SecureRandom class.\n\n==Additional Resources==\n\n* For more information about using PRNGs in Java, see https://www.securecoding.cert.org/confluence/display/java/MSC02-J.+Generate+strong+random+numbers\n"
        ]
      }
    ]
  }
}