{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "1a89b5be-d8eb-4948-9e87-079fa6bf8320"
        ],
        "Id_History": [
          "1a89b5be-d8eb-4948-9e87-079fa6bf8320,5f38bb79-6eae-47de-8cb3-949c6107b3af,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6204f2d47eb7"
        ],
        "Title": [
          "XPath Injection"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "XPath Injection"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "=Description=\r\nXPath injection is a type of vulnerability that allows attackers to execute arbitrary queries on XML databases. XPath injection vulnerabilities are similar to SQL injection vulnerabilities, but they affect XML databases instead of SQL databases. XPath injection is often more dangerous than SQL injection, because permissions are not enforced and the malicious queries can access every part of the XML documents. \r\n\r\nXPath injection applies to any application that uses XPath to query XML documents. \r\n\r\n=Impact=\r\nXPath injection attacks may allow an attacker to retrieve, manipulate, or destroy data stored in XML documents. The exact impact depends on the type of XML data that is exposed via XPath injection. If authentication data is exposed, the attacker is able to take over any user account. By taking over the administrator's account, the attacker is able to take full control of the application. \r\n\r\n=Countermeasures=\r\nTo prevent this vulnerability, validate all input. \r\n\r\n* [[c0a4f56c-1e8c-4d3a-97e2-fc9e969d5d52|Use Positive Input Validation]]\r\n\r\n=Application Check=\r\nTo check for adequate protection against this vulnerability, find all code that uses XPath queries and make sure it does not include unvalidated user input.\r\n\r\n* [[d4129497-3a66-44d1-881e-e6f004af2e0d|Positive Input Validation Is Used]]"
        ]
      }
    ]
  }
}