{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "1b8a0fd9-7af1-4a1f-9901-efab973e9742"
        ],
        "Id_History": [
          "1b8a0fd9-7af1-4a1f-9901-efab973e9742,efc67359-c6eb-4f1f-8eb7-306c4601a4e4,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Authentication Credentials Are Sent Over Encrypted Tunnels"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Authentication Credentials Are Sent Over Encrypted Tunnels"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* C++\r\n\r\n==What to Check For==\r\n\r\nVerify that authentication credentials are sent over encrypted tunnels.\r\n\r\n==Why==\r\n\r\nUsing encrypted communication tunnels prevents the credentials from being sniffed or tampered with as they are transmitted over the network. TLS/SSL libraries are available for most mature development platforms and are ideal for protecting the authentication credentials in transit.\r\n\r\n==When==\r\n\r\nUse this checklist item when your application sends authentication credentials over the network.\r\n\r\n==How to Check==\r\n\r\nTo verify that authentication credentials are sent over encrypted tunnels:\r\n\r\n# **Identify authentication security requirements.** Make sure that your application actually does send authentication credentials over the network. For example, if the application authenticates against a local credential store, then there is no need for network tunnels. If credentials are sent over the network, then they need to be protected in transit and, for most scenarios, TLS/SSL will be suitable. When using TLS/SSL, some thought will have to be given to what certificates to use. It is highly recommended to use valid certificates, however it is possible to encrypt network traffic with self-signed certificates. \r\n# **Identify the network authentication mechanism.** Find the code that sends authentication credentials over the network.\r\n# **Verify that authentication credentials are encrypted in transit.** Examine the code that sends authentication credentials over the network to make sure that TLS/SSL sockets are used instead of regular sockets for connections that are used to transmit credentials.\r\n\r\n\r\n==How to Fix==\r\n\r\nTo protect authentication credentials in transit:\r\n\r\n# **Identify authentication security requirements.** Make sure that your application actually does send authentication credentials over the network. For example, if the application authenticates against a local credential store, then there is no need for network tunnels. If credentials are sent over the network, then they need to be protected in transit and for most scenarios TLS/SSL will be suitable. When using TLS/SSL, some thought will have to be given to what certificates to use. It is highly recommended to use valid certificates, however it is possible to encrypt network traffic with self-signed certificates. \r\n# **Identify available communication security APIs.** Determine what libraries and APIs that implement TLS/SSL are available for your development platform. Because there are many different platforms and development environments that use C++, there are a lot of options. The platform-provided APIs should be the first choice but if these are not available, OpenSSL is a good alternative. \r\n# **Identify the network authentication mechanism.** Find the code that sends authentication credentials (usually hashes or keys) over the network.\r\n# **Encrypt authentication credentials in transit.** Use the chosen TLS/SSL APIs to encrypt the hashes or keys as they are transmitted over the network. Modify all the code that sends the credentials over the network to always use TLS/SSL for the task. When doing so, it is recommended to use valid certificates and check them with a certificate authority to help prevent man-in-the-middle attacks.\r\n"
        ]
      }
    ]
  }
}