{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "1c2b0859-c898-4f1c-b826-21392a7fc773"
        ],
        "Id_History": [
          "1c2b0859-c898-4f1c-b826-21392a7fc773,4de4763a-e340-47cf-a953-033369443fc7,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Reauthentication Is Enforced When Executing Critical Functionality"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Reauthentication Is Enforced When Executing Critical Functionality"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* HTML5\r\n* Server-side\r\n\r\n==What to Check For==\r\n\r\nEnsure your application forces the user to re-authenticate when executing security-critical functionality including, but not limited to change of password, account modifications and critical transactions.\r\n\r\n==Why==\r\n\r\nForcing the user to re-authenticate verifies the user's decision to execute the given functionality and preserves the application's integrity in the event that a user's account has been compromised via session hijacking.\r\n\r\n==How to Check==\r\n\r\nTo verify that re-authentication is required for sensitive operations:\r\n\r\n# **Identify all critical functionality within your application.** Locate all critical functionality within your application's code base. Common places to look include:\r\n## Creating new accounts \r\n## Changing passwords for existing users \r\n## User transactions that are sensitive in nature \r\n## Changing your application's global configuration \r\n## Any operation affecting your application's overall wellness such as start-up and shutdown \r\n# **Ensure that your application has adopted a re-authentication mechanism.** Ensure that your application's design and requirements ask for re-authentication mechanisms. Common re-authentication mechanisms include:\r\n## **Current password.** The user uses their current password to confirm the identity. This technique ensures that the user is aware of the action to be performed and holds responsibility for executing it. \r\n## **CAPTCHA.** CAPTCHA is a mechanism where alpha-numeric codes are embedded into displayed pictures. Forcing the user to confirm the embedded code helps ensure that the application is interacting with a human. If your application uses CAPTCHA, ensure that your version of CAPTCHA is up-to-date with its security updates. \r\n## **Second factor.** If your application supports it, then a second factor of authentication, such as a token, could play a role in the re-authentication scheme.\r\n# **Verify that re-authentication is enforced.** Ensure that the re-authentication procedures are positioned properly throughout your application's critical functionality. Verify that re-authentication is performed immediately upon entering a critical component. \r\n\r\n==How to Fix==\r\n\r\nFollow these steps when forcing re-authentication:\r\n\r\n# **Identify critical functionality.** Evaluate your application's design and requirements to determine which parts and resources of your application are very important to your organization's business model or your application's security architecture. This could include activities such as financial transactions or resetting user passwords.\r\n# **Adopt a re-authentication mechanism.** Establish a mechanism that requires the user to verify their authenticity:\r\n## **Current password.** The user uses their current password to confirm their identity. This technique ensures that the user is aware of the action to be performed and holds responsibility for executing it. \r\n## **CAPTCHA.** CAPTCHA are mechanisms designed to ensure that a human, not an automated script, is using the system. A CAPTCHA should be used in addition to, not instead of, a password. Many CAPTCHA systems embed distorted letters or numbers into displayed images, and require the user to enter the letters or numbers. There are a number of problems with many CAPTCHA systems, so don't rely on them too heavily. Many graphical CAPTCHAs can be trivially broken by optical character recognition systems, so it is difficult to ensure that a CAPTCHA is sufficiently strong. If CAPTCHAs are reused, the attacker can simply record the session IDs of CAPTCHAs with known values and replay them. CAPTCHAs can also be broken by using a man-in-the-middle technique where the image is saved and forwarded to another site controlled by the attacker. An unsuspecting user of that site solves the CAPTCHA and the attacker forwards the answer to the victim site. CAPTCHAs also create accessibility problems for users, as blind and sometimes even color-blind individuals can find them impossible. If you choose to implement a CAPTCHA, be aware of the trade-offs involved and ensure that the system you use is appropriately protected against any anticipated attacks.\r\n## **Second factor.** If your application supports it, then a second factor of authentication, such as a token, could play a role in the re-authentication scheme.\r\n# **Enforce the re-authentication mechanism.** Once you've identified the critical functionality and established the re-authentication mechanism, enforce the re-authentication mechanism before permitting any security-critical actions.\r\n\r\n==Essential Server-side Security Guidelines==\r\n\r\n* [[e2c5d605-2b34-4e1c-80aa-211a0ad7b64f|Validate All Input]]\r\n* [[397488da-ce91-4768-9ad9-1e6928980d72|Use Prepared Statements for SQL Queries]]\r\n* [[496b6306-dca6-48b6-920e-67e768dbe334|Encode Input Included in Output]]\r\n* [[45d61f0a-c4d3-44f0-93b1-d8205cd13fbe|Force Reauthentication when Executing Critical Functionality]]\r\n* [[fdb460e6-5d18-4e35-a093-4b260155d79e|Include Unique Tokens in HTTP Requests]]\r\n* [[00000000-0000-0000-0000-0000007ecacc|Use Role-based Authorization]]\r\n* [[1445abaf-4bb9-474c-b7e4-7bf58fe80f39|URL-Encode Data in HTTP Response Headers]]\r\n\r\n==Essential Server-side Security Checklist Items==\r\n\r\n* [[8dfa8088-a6cb-4062-8a44-0df8f2bc1cc4|All Input Is Validated]]\r\n* [[b5fb44c5-1702-42cf-b6be-894c511af7ac|Prepared Statements Are Used for SQL Queries]]\r\n* [[0ee9bc9f-c363-4a2d-be89-f84c069bda65|Input Included in Output Is Encoded]]\r\n* [[1c2b0859-c898-4f1c-b826-21392a7fc773|Reauthentication Is Enforced When Executing Critical Functionality]]\r\n* [[a2ef2a76-e562-4dd0-af9e-a6eb2b76c0d3|Unique Tokens Are Included in HTTP Requests]]\r\n* [[00000000-0000-0000-0000-0000008495ec|Role-based Authorization Is Used]]\r\n* [[3eb26600-9126-493a-a3cf-9d4b9815efc9|Data in HTTP Response Headers Is URL-Encoded]]\r\n"
        ]
      }
    ]
  }
}