{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "1fdc5862-1807-450d-be32-90b724588b2b"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "SQL Injection"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "iOS"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Description ##\r\n\r\nSQL injection is a type of vulnerabilities in database access code that allows attackers to execute unauthorized queries on the database. SQL Injection vulnerabilities are caused by concatenating data into SQL query syntax. A vulnerable application allows the attacker to inject malicious data into SQL queries granting the ability to execute arbitrary queries. The specific code and configuration determine the exact impact of the vulnerability by imposing some restrictions on how the attacker is able to manipulate the query while keeping it syntactically valid. SQL injection applies to all applications that query SQL databases. \r\n\r\n## Impact ##\r\n\r\nSQL injection allows the attacker to access any data in the database. The attacker will usually use this to extract any sensitive data from the database. If there are any passwords in the database, the attacker is likely to try to use them to login as the administrator and take over the application or the server. Some database servers allow so-called \"stacked queries\". \"Stacked queries\" allow executing multiple queries separated by a semi-colon from one string. If \"stacked queries\" are enabled, SQL injection allows the attacker to execute any queries on the database server. This usually allows the attacker to take full control of the application. Many database servers also allow executing arbitrary operating system commands. The attacker may abuse that functionality with SQL injection to take full control of the application or the server. \r\n\r\n## Countermeasures ##\r\n\r\nTo prevent this problem, validate all input and use parameterized APIs with type-safe parameters for database access.\r\n\r\nValidate all input:\r\n\r\n* [Validate All Input](00000000-0000-0000-0000-00000051c329)\r\n\r\nUse parameterized APIs for database access:\r\n\r\n* [Use Parameterized Methods for Database Access](00000000-0000-0000-0000-0000005366ca)\r\n\r\n## Application Check ##\r\n\r\nTo check for adequate protection against this vulnerability, ensure that all input is validated and that parameterized APIs with type-safe parameters are used for database access.\r\n\r\nAll input is validated:\r\n\r\n* [All Input Is Validated](00000000-0000-0000-0000-000000396c19)\r\n\r\nParameterized APIs are used for database access:\r\n\r\n* [Parameterized Methods Are Used for Database Access](00000000-0000-0000-0000-00000045b2ed)\r\n\r\n\r\n"
        ]
      }
    ]
  }
}