{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "20225a20-5c18-4b9b-9af6-8b981e85ddbe"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use Platform Session Management"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Ruby"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- Ruby\r\n\r\n\r\n## What to Do ##\r\n\r\nUse the built-in Ruby on Rails (RoR) session management features and functions to provide security for your Ruby applications.\r\n\r\n\r\n## Why ##\r\n\r\nPlatform session management features are provided by the RoR framework, and work on a lower level than the application. Session management is a crucial process which impacts both the end user experience and the security of an application. When implementing a session management process, it is important to factor in the security and protocol used to transmit information to and from the user. Without session management security precautions, the application can allow a man-in-the-middle attack which can intercept credentials or account information, and steal session data.\r\n\r\nThe built-in RoR session management gives users a session ID in a cookie, and keeps session data server-side. Disclosure of session data to the user is prevented. The platform tracks what session belongs to what user based on the session cookie. A custom session management approach, however, tends to break this security chain.\r\n\r\n\r\n## When ##\r\n\r\nAlways use the platform session management techniques to provide a solid foundation for defense-in-depth and a sound security posture. Do not use custom alternatives, as the framework-supplied functionality is maintained at the highest security level.\r\n\r\n\r\n## How ##\r\n\r\nUse these steps to implement RoR's built-in session management platform, provide secure transmission of session information, and protect the user session.\r\n\r\n1. **Determine session management requirements.** Examine the functions of the web application to determine what information is being stored. Identify those instances where application users have access to critical and sensitive resources through the web server and database server. Identify what information needs to be stored for typical use-case scenarios. Where possible, reduce the amount of sensitive information storage.\r\n\r\n2. **Identify the session management solution being used.** Determine how session management is implemented by the application. It is necessary to identify whether built-in RoR functionality is being used (`ActionDispatch::Session` module) or whether custom code is being used.\r\n\r\n3. **Use platform-provided session management.** If built-in RoR session management is being used, further work is not required, and the sessions are sufficiently protected. However, if custom code is in use, rewrite the application code to use the built-in RoR session management functions.\r\n\r\n\r\n"
        ]
      }
    ]
  }
}