{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "20930700-f532-4cbc-9367-e7ab7e311d53"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Load Balancing Is Used Carefully"
        ],
        "Category": [
          "System Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##What to Check For##\r\n\r\nMake sure that load balancing is used in a manner that takes the possibility of denial of service attacks into consideration.\r\n\r\n##Why##\r\n\r\nLoad balancing is used to distribute requests to multiple instances of EC2. This reduces the risk of overloading a single EC2 instance during expected increases in requests. During a Distributed Denial of Service Attack (DDoS), EC2 will become unavailable as unexpected requests grow in frequency. The effect can be mitigated with the use of load balancing.\r\n\r\nIf solutions are not in place to balance expected and unexpected requests, the site may become unavailable for its intended business use. The AWS network provides protection against DDoS attacks, and additional layers of protection can be added by using Amazon Exit 53 and Elastic Load Balancing (ELB). However, measure performance to compare the solution to other load balancing products such as NGINX Plus.\r\n\r\nUse of load balancing provides for continuity of operations for mission/business functions (NIST SP 800-53, control IR-4).\r\n\r\n\r\n##When##\r\n\r\nLoad balancing is used with web applications when it is necessary to mitigate deterioration of performance (ingesting a large load of data) and/or a sudden break in availability (DDoS). When maintaining quality of service (QoS) at network speeds with zero data loss is required, automatic methods of load balancing should be in place. Load balancing also protects data in transit and security of back-end processing.\r\n\r\n##How to Check##\r\n\r\nTo make sure that load balancing is set up in a way that is resilient to denial of service attacks:\r\n\r\n1. **Review available load-balancing options.** Make a list of load-balancing products, and determine what features are provided, such as: request routing, URL rewriting and redirecting, health checks, and auto scaling.\r\n\r\n2. **Examine the load-balancing system.** Verify that the load balancing option being used is the best match for your requirements out of the available options. \r\n\r\n3. **Examine the load-balancing system configuration.** Review the configuration of the load-balancing system to make sure that it takes the possibility of denial of service attacks into account. Interview the people responsible for setting up the load-balancing solution about denial of service resiliency and that the load-balancing system is being monitored.\r\n\r\n##How to Fix##\r\n\r\nBegin with these steps for a secure load-balancing implementation.\r\n\r\n1. **Review available load-balancing options.** Make a list of load-balancing products, and determine what features are provided, such as: request routing, URL rewriting and redirecting, health checks, and auto scaling.\r\n\r\n2. **Choose load-balancing solution.** One solution may not provide the necessary features for your application. For example, URL rewriting and redirecting may be built-in, but auto scaling is missing. You may need to integrate different products in order to implement 100% of your security design features.\r\n\r\n3. **Configure load-balancing solution.** For Amazon ELB configuration, prepare your virtual private cloud (VPC) and back-end instances, and use the management console or command line interface (CLI) to create *load balancers*. Other load-balancing products may require additional development resources to implement with AWS.\r\n\r\n4. **Test load balancing solution.** Before going live, test the load balancer. For Amazon ELB, look at the metrics in CloudWatch associated with your load balancer. These include statistics such as `HealthyHostCount`, `RequestCount`, and `Latency`. For more information about CloudWatch metrics for your load balancer, see http://docs.aws.amazon.com/ElasticLoadBalancing/latest/DeveloperGuide/.\r\n\r\n5. **Make adjustments to configuration.** After evaluating the performance of the load balancer, configuration changes may be required. An ELB example is that you may need to adjust the idle timeout with the `elb modify-load-balancer-attributes` command. For more information about configuring the load balancer, see http://docs.aws.amazon.com/ElasticLoadBalancing/latest/DeveloperGuide/.\r\n\r\n6. **Monitor performance.** Monitor on-going performance of the load balancer by using a combination of CloudWatch metrics, access logs, and AWS CloudTrail. CloudWatch can be configured to monitor health state and take additional action to supplement the effectiveness of load balancing. For more information about monitoring performance, see http://docs.aws.amazon.com/AmazonCloudWatch/latest/DeveloperGuide/.\r\n\r\n\r\n##Additional Resources##\r\n\r\n- [Amazon CloudWatch Developer Guide](http://docs.aws.amazon.com/AmazonCloudWatch/latest/DeveloperGuide/ \"Amazon CloudWatch Developer Guide\")\r\n- [Amazon Web Services: Risk and Compliance](http://aws.amazon.com/compliance/aws-whitepapers/ \"Amazon Web Services: Risk and Compliance\")\r\n- [AWS Security Best Practices](http://aws.amazon.com/security/ \"AWS Security Best Practices\")\r\n- [Elastic Load Balancing Developer Guide](http://docs.aws.amazon.com/ElasticLoadBalancing/latest/DeveloperGuide/ \"Elastic Load Balancing Developer Guide \")\r\n- [NGINX Plus and Amazon Elastic Load Balancer on AWS](http://nginx.com/blog/using-ngnix-amazon-elastic-load-balancer-aws/ \"NGINX Plus and Amazon Elastic Load Balancer\")\r\n- [NIST SP 800-53 Security and Privacy Controls for Federal Information Systems and Organizations](http://csrc.nist.gov/publications/PubsSPs.html \"NIST SP 800-53 Security and Privacy Controls for Federal Information Systems and Organizations\")\r\n\r\n\r\n"
        ]
      }
    ]
  }
}