{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "27c44978-3b5a-4f90-aa45-d3c52a1f0e0d"
        ],
        "Id_History": [
          "27c44978-3b5a-4f90-aa45-d3c52a1f0e0d,da6e27aa-fdcc-439c-817a-ec14712acd6a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Dangerous Functions Are Disabled by Default"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Dangerous Functions Are Disabled by Default"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\n\nMake sure that dangerous functions are disabled by default.\n\n==Why==\n\nDangerous functions should be disabled by default so that attackers do not abuse them.\n\n==How to Check==\n\nTo make sure that dangerous functions are disabled by default:\n\n# **Identify code that implements dangerous functions.** Determine which application features implemented by your application might be dangerous. Some examples are: file uploads, code execution, direct database access, and data deletion. Make a spreadsheet about all code that implements dangerous features.\n# **Verify that dangerous functions are configurable.** Examine the code that implements the dangerous functions. Make sure that this code checks configuration settings before running, and that dangerous functions are only executed if they are explicitly enabled.\n# **Verify that dangerous functions are disabled by default.** Examine the code that implements the dangerous functions. Make sure the default setting is for the dangerous functions not to run. If there are no explicit settings to enable dangerous functions, they should not run. The default settings that are present immediately after the application is installed should have dangerous functions disabled.\n# **Verify that dangerous functions are documented.** Examine documentation to make sure that all dangerous functions are documented, their security impact is explained, and the procedures to enable them are described.\n\n==How to Fix==\n\nTo disable dangerous functions by default:\n\n# **Identify code that implements dangerous functions.** Determine which application features implemented by your application might be dangerous. Some examples are: file uploads, code execution, direct database access, and data deletion. Make a spreadsheet about all code that implements dangerous features.\n# **Make dangerous functions configurable.** Modify each piece of code that implements a dangerous function to check application settings to see whether the user has explicitly enabled the dangerous feature. Only allow the dangerous features to be executed if the user has explicitly enabled them.\n# **Make dangerous functions disabled by default.** For each dangerous feature, write code so that the feature can only be executed if it has been explicitly enabled by the user.\n# **Document the dangerous functions.** Add information about all the dangerous features to the documentation. Explain why each feature is dangerous. Describe how to configure each feature.\n\n"
        ]
      }
    ]
  }
}