{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "2f4a6a39-0932-4c76-88fd-921eacfc9e44"
        ],
        "Library_Id": [
          "de693015-55c9-4328-bbc8-42db82ae8b7a"
        ],
        "Title": [
          "Common PHP Vulnerabilities"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          ""
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "PHP is a widely used server side scripting language commonly found in conjunction with HTML. Because PHP is located on the server side, users may not even know they are interacting with PHP generated content, but this does not make it less susceptible to attacks. PHP can be embedded into the HTML body, and allows for communication with many other protocols and database frameworks. View each topic below to better understand some of the most common exploits used against PHP scripts, and how to best combat each.\n\n  * [[/article/940d6e95-fc25-4e9d-8545-2262ed6e99ba|Code Injection]] - Scripting languages often have functions, such as eval(), that allow interpreting a string or a file as a part of the application. The danger of using these functions is that, under certain conditions, an attacker may be able to supply malicious code and it will be executed as a part of the application. This gives the attacker full control of the application.\n  * [[/article/9178de03-1ccd-4987-b4e1-6db7a164fc4c|Command Injection]] - Applications often execute external commands as a part of their functionality. If an attacker is able to manipulate the choice of external commands or their parameters, he may be able to use this functionality to execute arbitrary commands.\n  * [[/article/11baa288-69b3-4bbd-9133-e9675228e75d|Cross-Site Request Forgery]] - A cross-site request forgery (CSRF) attack occurs when an attacker tricks a victim into loading a page that contains a malicious request. This request may be able to change the state of the web application, and is possible because the request is sent in the context of the logged in victim. For many sites, each request automatically sends the victim's credentials, such as the session cookie or authentication credentials. Due to this fact, there is no way to distinguish the false request from a legitimate request. CSRF vulnerabilities affect web applications that allow authenticated users to perform operations that are not available to guest users.\n  * [[/article/add8a099-08da-40cc-a202-5e083267cef7|Cross-Site Scripting]] - A web application's output is rendered as a web page. If user input is included in the web application output, then it is also rendered as a part of the web page. If user input is included in output without being validated and encoded, a cross-site scripting (XSS) vulnerability results. In that case, an attacker can modify the output web page to include malicious script, which is then executed by the browser that views the vulnerable page.\n  * [[/article/fc1d8337-3bc1-40f5-bc88-db1575d5657a|File Upload]] - File upload vulnerabilities allow attackers to upload malicious code. (Technically, allowing users to upload anything that the application's design doesn't account for can be considered a file upload vulnerability. In practice, real file upload vulnerabilities are those that allow attackers to upload and execute malicious code.)\n  * [[/article/2abc6c1b-dd8b-41d3-ad24-c717807e43e9|SQL Injection]] - SQL injection is a type of vulnerability in database access code that allows attackers to execute unauthorized queries on the database. SQL injection typically occurs when an application uses input to construct dynamic SQL statements to access the database. SQL injection may also occur if stored procedures use dynamic queries that include untrusted input. Using the SQL injection attack, an attacker can execute arbitrary commands on the database with the privileges of the application. \n\n[[e2f97ef0-6ced-4f3d-bdce-7a72e359eb7b|Back to the Vulnerabilities Area]]"
        ]
      }
    ]
  }
}