{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "3064ad63-40cc-476e-a160-8a91d7ae5121"
        ],
        "Id_History": [
          "3064ad63-40cc-476e-a160-8a91d7ae5121,ae852ca7-afed-47a1-9938-0405021bfbdd,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Block Search Engines from Sensitive Areas"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Block Search Engines from Sensitive Areas"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Do==\n\nUse a robots.txt file to block search engines from indexing sensitive data on your site.\n\n\n==Why==\n\nIf a search engine indexes sensitive data on your web site, an attacker will be able to retrieve that data from the search engine.\n\n\n==How==\n\nTo block search engines from indexing sensitive data on your site by using a robots.txt file:\n\n# **Identify sensitive URI locations.** Enumerate all the URIs that lead to sensitive data in your application. These URIs will usually correspond to the filesystem structure of the application, but sometimes they will be produced dynamically by the application itself. Whatever the case, consider how the URIs look from the perspective of the client when enumerating the locations of the sensitive data. It is strongly recommended to prevent indexing of any administrative pages.\n# **Write a robots.txt file.** The robots.txt file has a simple syntax. Study the reference at the link at the bottom of this page, and write a robots.txt file that prevents indexing of all the sensitive URI locations.\n# **Upload the robots.txt file to the web site.** Upload the robots.txt file to the web root directory on your application server. \n# **(Optional) Examine search engine caches.** Use popular web search engines to execute search queries that include sensitive URI locations on your server. See if these locations have already been cached. If sensitive data has already been cached, it should be purged automatically some time later when the search engine crawls your site again and parses the robots.txt file correctly. If that is not acceptable, consider contacting the search engine operator and asking them to remove the sensitive data from their caches.\n\n\n==Additional Resources==\n\n* For information about the robots.txt file syntax, see http://www.w3.org/TR/html4/appendix/notes.html#h-B.4.1.1\n\n"
        ]
      }
    ]
  }
}