{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "33041189-7ef0-4bda-b40a-0ea6258fb1e7"
        ],
        "Id_History": [
          "33041189-7ef0-4bda-b40a-0ea6258fb1e7,c1cef2ed-ea9e-4e89-82cf-8da2bfa304de,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "All User-Supplied Filename And Path Input is validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All User-Supplied Filename And Path Input is validated"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <p>Applications written using Scala and Play Framework 2.1.0+</p>\r\n  <h1>What to Check For</h1>\r\n  <p>Check that all filename and path input is validated and treated as untrusted data. Ensure data is validated using whitelisting techniques to check against known good input.</p>\r\n  <h1>Why</h1>\r\n  <p>Filenames and paths interact directly with the underlying filesystem. Allowing malicious users to manipulate file system operations directly or indirectly through their input can expose important sensitive system files. Canonicalization vulnerabilities can result in an attacker gaining access to unexpected resources.</p>\r\n  <h1>How to Check</h1>\r\n  <p>To check for this problem, use the following steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Establish the base directory.&nbsp;</strong>\r\n        <span style=\"color: rgb(17, 17, 17); font-family: 'Segoe UI', 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: small; line-height: 1.5em;\">The base directory is where your application should store any user-supplied files. Verify the following:</span>\r\n      </p>\r\n      <ul style=\"margin: 10px 0px 10px 25px; padding: 0px 0px 0px 30px; color: rgb(17, 17, 17); font-family: 'Segoe UI', 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: small;\">\r\n        <li style=\"margin: 0px; padding: 0px;\">The location of the base directory should not be a subdirectory of any important directory such as&nbsp;<em style=\"margin: 0px; padding: 0px;\">/etc</em>&nbsp;or&nbsp;<em style=\"margin: 0px; padding: 0px;\">C:\\Windows</em>.</li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Check that there is write access only to the base directory and its children, but not to its parents.</li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Because of read access misuses, make sure that there is no stored sensitive information inside any of the base directory's parents.</li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Check the possibility of read/write access outside the base directory and its parents.&nbsp;<br style=\"margin: 0px; padding: 0px;\" /></li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Make sure that proper whitelist validations are used on the user-supplied filename and strict access control from the filesystem is ensured.</li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Check that the application's local user account is not an owner of any of the base directory's parents.</li>\r\n      </ul>\r\n      <ul>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check for presence of &nbsp;validations via whitelisting.&nbsp;</strong>The syntax for accessing filesystems is well known. Make sure that whitelist techniques are used to allow good input and discard bad input. Be careful with canonicalization issues. Canonicalization problems occur when the user attempts to traverse directories by using special pathname sequences to direct your application into a directory it should not access.  </p>\r\n      <p>\r\n        <font face=\"Arial, Verdana\" size=\"2\">Assume your application has created the file</font>\r\n      </p>\r\n      <pre>d:\\myapp\\temp\\file.dat</pre>\r\n      <font face=\"Arial, Verdana\" size=\"2\">The following strings can also represent the same file:</font>\r\n      <p />\r\n      <p>\r\n        <span style=\"font-family: Arial, Verdana; font-size: small;\">\r\n        </span>\r\n      </p>\r\n      <pre>d:\\myapp\\temp\\..\\temp\\file.dat d:\\myapp\\temp\\..\\temp\\..\\temp\\file.dat d%3A%5Cmyapp%5Ctemp%5Cfile.dat</pre>\r\n      <p />\r\n      <p>\r\n        <font face=\"Arial, Verdana\" size=\"2\">Using whitelisting can help avoid canonicalization problems.</font>\r\n      </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check the permissions on the filesystem.&nbsp;</strong>\r\n        <span style=\"font-size: 10pt;\">Filesystem permissions are also a very important mechanism to avoid canonicalization problems. Restrict the access rights of your application's local account to prevent access to sensitive system data. Verify the following:</span>\r\n      </p>\r\n      <ul style=\"margin: 10px 0px 10px 25px; padding: 0px 0px 0px 30px; color: rgb(17, 17, 17); font-family: 'Segoe UI', 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: small;\">\r\n        <li style=\"margin: 0px; padding: 0px;\">Check if there is full access only within the base directory.</li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Make sure that there is only read access within the base directory's parents.</li>\r\n        <li style=\"margin: 0px; padding: 0px;\">Make sure there is no access anywhere else on the filesystem.</li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <ol>\r\n    <li>\r\n      <p>To validate filename and path input:</p>\r\n      <ol>\r\n        <li>\r\n          <p>\r\n            <strong>Establish a base directory.&nbsp;</strong>The base directory is where your application should store any user-supplied files.</p>\r\n          <ul>\r\n            <li>Choose the location of the base directory carefully. It should not be a subdirectory of any important directory such as&nbsp;<em>/etc</em>&nbsp;or&nbsp;<em>C:\\Windows</em>.</li>\r\n            <li>Allow write access only to the base directory and its children, but not to its parents.</li>\r\n            <li>Because of read access misuses, do not store sensitive information inside any of the base directory's parents.</li>\r\n            <li>Prohibit read/write access outside the base directory and its parents.&nbsp;<br /></li>\r\n            <li>Use whitelist validation on the user-supplied filename and ensure strict access control from the filesystem.</li>\r\n            <li>Avoid setting your application's local user account as owner of any of the base directory's parents.<br /><br /><strong>Note:</strong>&nbsp;If your application is Windows based, create your base directory in a partition different than the partition hosting all critical system services. Because Windows prohibits changing partitions through canonicalization, it is impossible for an attacker to access a resource that is located in another partition. For instance, if your Windows installation is located at&nbsp;<em>C:\\Windows</em>, place your base directory at<em>d:\\myapp\\temp</em>.</li>\r\n          </ul>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Validate via whitelisting.&nbsp;</strong>The syntax for accessing filesystems is well known. Use whitelist techniques to allow good input and discard bad input. Be careful with canonicalization issues. Canonicalization problems occur when the user attempts to traverse directories by using special pathname sequences to direct your application into a directory it should not access.&nbsp; For example:<br /><br />Assume your application has created the file</p>\r\n          <pre>d:\\myapp\\temp\\file.dat</pre>\r\n          <p>The following strings can also represent the same file:</p>\r\n          <pre>d:\\myapp\\temp\\..\\temp\\file.dat d:\\myapp\\temp\\..\\temp\\..\\temp\\file.dat d%3A%5Cmyapp%5Ctemp%5Cfile.dat</pre>\r\n          <p>Using whitelisting can help avoid canonicalization problems.<br /></p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <b>Set the right permissions at the filesystem level.</b>&nbsp;Filesystem permissions are also a very important mechanism to avoid canonicalization problems. Restrict the access rights of your application's local account to prevent access to sensitive system data. It is recommended to:</p>\r\n          <ul>\r\n            <li>Give full access only within the base directory.</li>\r\n            <li>Give read access only within the base directory's parents.</li>\r\n            <li>Do not give access anywhere else on the filesystem.<br /><br />It is also recommended to execute your application with its own local account rather than as the hosting server so that any restrictions applied to your application would not affect the performance of the hosting server.<p /></li>\r\n          </ul>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Avoid common mistakes.</strong>\r\n          </p>\r\n          <ul>\r\n            <li>\r\n              <p>\r\n                <strong>Use the Java File object.</strong>&nbsp;As mentioned in the&nbsp;<a href=\"http://www.playframework.com/documentation/2.0/ScalaStream\">Scala guidelines</a>, always use a&nbsp;<em>java.io.File</em>&nbsp;object to represent a file, rather than a&nbsp;<em>String&nbsp;</em>or&nbsp;<em>val</em>&nbsp;object. Using the&nbsp;<em>File</em>&nbsp;object allows you to access the actual file and some useful and relevant information such as the file's size, parent, path, etc. Example:</p>\r\n              <pre>File file = new File(\"d:\\myapp\\temp\\file.dat\");</pre>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Verify the canonical path.</strong>&nbsp;The&nbsp;<em>File</em>&nbsp;object provides the file's path in&nbsp;three different forms -- original, absolute and canonical. Always use the canonical path when using whitelisting to verify the file's path.</p>\r\n              <p />For instance, the file<pre>d:\\myapp\\temp\\..\\temp\\..\\temp\\file.dat</pre><p>would have the following paths:</p><pre>d:\\myapp\\temp\\..\\temp\\..\\temp\\file.dat<br /> (Original via the <strong>File.getPath</strong> method)<br />d:\\myapp\\temp\\..\\temp\\..\\temp\\file.dat<br /> (Absolute via the <strong>File.getAbsolutePath</strong> method)<br />D:\\myapp\\temp\\file.dat<br /> (Canonical via the <strong>File.getCanonicalPath</strong> method)</pre></li>\r\n            <li>\r\n              <p>\r\n                <strong>Verify&nbsp;that the filesystem is case-sensitive.</strong>&nbsp;Always be sure&nbsp;that your application's filesystem is case-sensitive. Because most UNIX based operating systems have case-sensitive filesystems,<em>FILE.DAT</em>&nbsp;and&nbsp;<em>file.dat</em>&nbsp;represent&nbsp;two different files. However, Windows has a case-insensitive filesystem; therefore,&nbsp;<em>FILE.DAT</em>&nbsp;and&nbsp;<em>file.dat</em>&nbsp;represent the same file. If your application's filesystem is case-insensitive, make sure to specify the&nbsp;<em>CASE_INSENSITIVE</em>&nbsp;flag when using regular expressions to validate your file inputs. Example:</p>\r\n              <pre>val goodPattern = \"d:(\\\\\\\\|/)myapp(\\\\\\\\|/)temp(\\\\\\\\|/)(\\\\w|\\\\s|\\\\.|-|){1,20}\";\r\nval issafe = goodPattern.pattern.matcher(thepattern).matches</pre>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>Verify the filesystem's path delimiters.</strong>&nbsp;Verify the path delimiters that your application's filesystem uses and keep them consistent throughout the code. For example, Windows uses '<strong><em>\\</em></strong>' or '/' to distinguish directories inside a path while UNIX based systems use only '/' to accomplish the same task.</p>\r\n            </li>\r\n          </ul>\r\n        </li>\r\n      </ol>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>A tutorial on regular expressions is available at&nbsp;<a href=\"http://www.regular-expressions.info/\">Regular-Expressions.info</a>.</li>\r\n    <li>For more information on using regular expression in Scala, see: Documentation for&nbsp;<a href=\"http://www.scala-lang.org/api/current/index.html#scala.util.matching.Regex\">Regex Pattern</a>&nbsp;in Scala documentation.</li>\r\n  </ul>\r\n  <div>\r\n    <br />\r\n  </div>"
        ]
      }
    ]
  }
}