{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "34456ac9-adfc-4f0c-bad6-4d054cae64bd"
        ],
        "Id_History": [
          "34456ac9-adfc-4f0c-bad6-4d054cae64bd,e36555cf-afda-41dd-bece-95dd17da8e7e,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "Application Fingerprints Are Reduced"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Application Fingerprints Are Reduced"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Java\n\n==What to Check For==\n\nMake sure that application fingerprints have been reduced by removing as many uniquely identifiable strings as possible from the public areas of your application.\n\n==Why==\n\nUniquely identifiable strings, such as application name and version number, are telltale signs that the application is running on your system. These telltale signs, or fingerprints, are often searched for via automated scripts that look for a target to attack. \n\nRemoving uniquely identifiable strings from the public areas of your application makes it more difficult for attackers’ automated scripts to find and attack your application. \n\n(It is impractical to attempt to eliminate the possibility of fingerprinting altogether, because the effort required to do would almost certainly outweigh the benefits.)\n\n==How to Check==\n\nTo verify that as many uniquely identifiable strings as possible have been removed from the public areas of your application:\n\n# **Identify public areas of the application.** Identify all portions of the application that send information of any kind to the user without requiring authentication. This includes the login page, the forgot password page, any kind of public content page, help pages, contact pages, URL strings, error pages, and particularly banners that include the application name and version. Make a spreadsheet about all of these sources of information made publically available by the application.\n# **Find uniquely identifiable strings.** In the code, examine each source of information disclosed by the application. If there are strings that can be used to uniquely identify your application, add this information to the spreadsheet.\n# **Determine whether uniquely identifiable strings can be removed.** Examine each string that can be used to uniquely identify the application. Consider whether this string can be removed completely or replaced by a more ambiguous string.\n\n\n==How to Fix==\n\nTo remove uniquely identifiable strings from the public areas of your application:\n\n# **Identify public areas of the application.** Identify all portions of the application that send information of any kind to the user without requiring authentication. This includes the login page, the forgot password page, any kind of public content page, help pages, contact pages, URL strings, error pages, and particularly banners that include the application name and version. Make a spreadsheet about all of these sources of information made publically available by the application.\n# **Consider locking down public areas.** Go through the spreadsheet of sources of information disclosed to the public by the application Consider whether it is possible to lock down any of these sources by requiring authentication before the information is disclosed.\n# **Find uniquely identifiable strings.** In the code, examine each source of information disclosed by the application. Identify strings that can be used to uniquely identify your application. Add this information to the spreadsheet.\n# **Remove or replace uniquely identifiable strings.** For each string that can be used to uniquely identify the application, consider whether this string can be removed completely or replaced by a more ambiguous string. Remove or replace every such string, if possible.\n"
        ]
      }
    ]
  }
}