{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "39a8edc5-ab6d-46ad-8b42-3ca073eaa848"
        ],
        "Id_History": [
          "39a8edc5-ab6d-46ad-8b42-3ca073eaa848,7212f74f-da3f-455f-92c0-218d983521d2,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Debugging Data Is Not Included in Output"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Debugging Data Is Not Included in Output"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Web Applications\n\n==What to Check For==\n\nVerify that debugging data is not included in output.\n\n==Why==\n\nDebug information may have sensitive information, such as call stacks, fragments of the source code, SQL statements and more. This information may aid an attacker by giving them additional information about the application, especially in buggy areas. Since debugging data is often displayed in error messages, the fact that error messages are being displayed may indicate the presence of a vulnerability, and the debugging data may provide information necessary to exploit the vulnerability.\n\n==How to Check==\n\nTo verify that debugging data is not included in output:\n\n# **Verify that PHP error messages are disabled.** If you are using PHP, examine the php.ini file to make sure the display_errors directive is used to disable PHP error messages, like so: {{{ display_errors = off }}\n# **Verify that debugging is turned off.** If the application has a debugging mode switch, make sure that it is disabled.\n# **Verify the debugging data is not included in error messages.** Find all code that generates error messages and review it to make sure that debugging information is not included in the messages. This is the most important step, because attackers often use error messages to look for vulnerabilities.\n# **Verify that any code used to display debugging output is disabled.** It is a common practice to include temporary code that generates debugging messages during program execution. If your developers use this practice, review their code for any such code. Usually, a developer will use the same type of code to display debugging output, so a simple string search should be able to find all of it. \n\n==How to Fix==\n\nTo prevent the application from displaying debugging data in output:\n\n# **Disable PHP error messages.** If you are using PHP, use the display_errors directive in php.ini to disable PHP error messages, like so: {{{ display_errors = off }}}\n# **Turn off debugging.** If the application has a debugging mode switch, disable it.\n# **Do not display debugging information in error messages.** Find all code that generates error messages and review it to make sure that debugging information is not included in the messages. This is the most important step, because attackers often use error messages to look for vulnerabilities.\n# **Disable any custom logging functions used for debugging.** It is a common practice to include temporary code that generates debugging messages during program execution. All of this code has to be found and disabled, either by commenting it out or removing it."
        ]
      }
    ]
  }
}