{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "3a08b87e-3c13-43b8-be34-3bcad5314888"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Sensitive Data in the Cloud Is Encrypted"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##What to Check For##\r\n\r\nVerify that sensitive data in the cloud is encrypted.\r\n\r\n##Why##\r\n\r\nData at rest requires safe storage practices to address security concerns such as:\r\n\r\n- Accidental information disclosure\r\n- Data integrity compromise\r\n- Unintended deletion\r\n- Availability of infrastructure hardware and software.\r\n\r\nThese concerns are addressed by your encryption methods which satisfy the requirement for protection of cardholder data (PCI-DSS Requirement 3).\r\n\r\n\r\n##When##\r\n\r\nWhen encryption is available at the file, partition, volume, or application-level, you should use it. Some data may not be confidential, but it is simpler to enable encryption for an entire bucket or volume, for example, in order to eliminate the possibility that an intruder could use any data in your cloud.\r\n\r\nBackup and replication approaches must also use encryption, or respect the encryption method already in use.\r\n\r\n\r\n##How to Check##\r\n\r\nTo verify that sensitive data in the cloud is encrypted:\r\n\r\n1. **Identify sensitive data.** Examine your cloud architecture and services used. Look for customer data, intellectual property, and access credentials.\r\n\r\n2. **Classify sensitive data.** Review the list of sensitive data and prioritize the classification. Customer data and your business data is important, but the financial impact of losing customer data may be higher than losing a list of employees. Use such comparisons as well as threat level to rank and classify data.\r\n\r\n3. **Identify where sensitive data is stored.** Find all the places where sensitive data is stored.\r\n\r\n4. **Verify that sensitive data is encrypted.** Examine each place where sensitive data is stored to make sure that it is encrypted.\r\n\r\n\r\n##How to Fix##\r\n\r\nTo use encryption with your AWS resources, include the following steps as part of your management of sensitive data in the cloud:\r\n\r\n1. **Identify sensitive data.** Examine your cloud architecture and services used. Look for customer data, intellectual property, and access credentials.\r\n\r\n2. **Classify sensitive data.** Review the list of sensitive data and prioritize the classification. Customer data and your business data is important, but the financial impact of losing customer data may be higher than losing a list of employees. Use such comparisons as well as threat level to rank and classify data.\r\n\r\n3. **Protect data at rest on S3.** Use permissions at the bucket or object level in combination with IAM policies. This will secure your S3 resources against unauthorized access, deletion, and disclosure.\r\n\r\n4. **Protect data at rest on EBS.** Use Elastic Block Store (EBS) encryption on non-boot volumes. For boot volumes you will use an encryption method supported by the operating system (OS). For example, in Windows this might be Encrypted File System (EFS) or BitLocker. \r\n\r\n5. **Protect data at rest on RDS.** Relational Database Service (RDS) offers platform-level protection for MySQL, Oracle, and MS SQL. You can add more protection at the application layer by using a built-in encryption function. Your application can manage keys with PKI or other asymmetric technique.\r\n\r\n6. **Protect data at rest on Glacier.** Your data is always protected by server-side encryption. For an additional layer of security you can also encrypt your data before uploading to Glacier.\r\n\r\n7. **Protecting data at rest on DynamoDB.** You will need to implement a data encryption layer over the standard service. This can be done at the application layer. For more information about NoSQL development, see http://aws.amazon.com/dynamodb/.\r\n\r\n8. **Protecting data at rest on EMR.** Elastic MapReduce (EMR) uses Amazon Machine Images (AMI) to create instances, which by default do not encrypt data at rest. For more information about S3 server-side and client-side encryption, see http://docs.aws.amazon.com/AmazonS3/latest/dev/.\r\n\r\n\r\n##Additional Resources##\r\n\r\n- [Amazon Relational Database Service User Guide](http://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/ \"Amazon RDS User Guide\")\r\n- [Amazon Simple Storage Service Developer Guide](http://docs.aws.amazon.com/AmazonS3/latest/dev/ \"Amazon Simple Storage Service: Developer Guide\")\r\n- [AWS Security Best Practices](http://aws.amazon.com/security/ \"AWS Security Best Practices\")\r\n- [Encrypting Data at Rest](http://aws.amazon.com/whitepapers/encrypting-data-at-rest/ \"Encrypting Data at Rest\")\r\n- [Payment Card Industry (PCI) Data Security Standard (DSS) - Requirements and Security Assessment Procedures](https://www.pcisecuritystandards.org/documents/PCI_DSS_v3.pdf \"PCI DSS Requirements and Security Assessment Procedures\")\r\n\r\n\r\n"
        ]
      }
    ]
  }
}