{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "3b306aa2-2aaa-4b58-9f0a-08beb5a3cafa"
        ],
        "Id_History": [
          "3b306aa2-2aaa-4b58-9f0a-08beb5a3cafa,6019b800-5c78-40c3-869a-e739e8e25339,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Verify the Application Authenticity to the User"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Verify the Application Authenticity to the User"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <p>Scala and Play Framework 2.1.0+<br /></p>\n  <h1>What to Do</h1>\n  <p>Allow the user to verify the authenticity of your application.</p>\n  <h1>Why</h1>\n  <p>Some applications are targets for phishing attacks. Failure to authenticate against the user allows attackers to spoof the application. This can&amp;nbsp;fool the users into submitting their credentials or other sensitive information into an attacker's malicious application.</p>\n  <h1>When</h1>\n  <p>If your application handles sensitive data and allows public access, verify&amp;nbsp;your application's authenticity to your users.</p>\n  <h1>How</h1>\n  <p>Use the following measures to authenticate your application to its users:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Use TLS.&amp;nbsp;</strong>Due to the nature of the TLS certificates, TLS can be used to certify the remote host's name. Because of TLS's chain of trust and DNS limitations, it is very diffcult to spoof a host that uses TLS.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Display personalized and identifiable content.&amp;nbsp;</strong>Do not ask the user for credentials in one step. Instead,&amp;nbsp;after the user&amp;nbsp;enters a valid username, display personal and identifiable content to which the user can relate, such as:&amp;nbsp;a personal user-supplied question, an image that has been pre-selected from a library, or a personalized color schema. After the user has authenticated the application, they may enter their password.</p>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>MyApp is a financial application with a public web interface. Because the application does not use TLS to certify its identity in front of the user, an attacker can set up a fake site and pretend to be MyApp. Because the user's browser has no mechanism of identifying the real from the fake MyApp interface, it will not provide any warning signs to the user. Once a user accesses the fake MyApp interface, they may be fooled into providing their credentials to the attacker.</p>\n  <h1>Solution Example</h1>\n  <p>MyApp is a financial application with a public web interface. Because the application uses TLS to certify its identity in front of the user, the user's browser uses the TLS chain of trust and MyApp's URL to verify MyApp's identity. If an attacker attempts to spoof the MyApp interface, the user's browser has a mechanism for detecting the fake site, and&amp;nbsp;the user will be warned that they are not accessing the real MyApp interface.</p>\n  <h1>Additional Resources</h1>\n  <ul>\n    <li>To learn more about anti-phishing techniques, see&amp;nbsp;<a href=\"http://en.wikipedia.org/wiki/Phishing\">Phishing</a>&amp;nbsp;in Wikipedia.</li>\n  </ul>"
        ]
      }
    ]
  }
}