{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "3eb26600-9126-493a-a3cf-9d4b9815efc9"
        ],
        "Id_History": [
          "3eb26600-9126-493a-a3cf-9d4b9815efc9,6b0b552c-08d9-42b9-babd-ddbb63fef567,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Data in HTTP Response Headers Is URL-encoded"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Data in HTTP Response Headers Is URL-Encoded"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\n\nVerify that data in HTTP response headers is URL-encoded. \n\n==Why==\n\nData in HTTP response headers should be URL-encoded to prevent response-splitting vulnerabilities. \n\n==How to Check==\n\nTo verify that data in HTTP response headers is URL-encoded: \n\n# **Identify all data included in HTTP response headers.** Identify the functions that are provided by your platform to include data in HTTP response headers. Search your code for calls to these functions in order to find all code that adds data to HTTP response headers.\n# **Verify that data included in HTTP response headers is validated.** Examine code that adds data to response headers. Make sure that any user data is passed through positive validation routines before being included in HTTP response headers.\n# **Verify that data included in HTTP response headers is URL-encoded.** Identify functions provided by your platform to URL-encode data. Examine code that adds data to response headers. Make sure that any user data is URL-encoded (using the functions that URL-encode data) before being included in HTTP response headers.\n\n==How to Fix==\n\nTo URL-encode data in HTTP Response headers: \n\n# **Identify all data included in HTTP response headers.** Identify the functions that are provided by your platform to include data in HTTP response headers. Search your code for calls to these functions in order to find all code that adds data to HTTP response headers.\n# **Validate all data included in HTTP response headers.** Use positive validation routines to check all data that gets included in HTTP response headers.\n# **URL-encode all data included in HTTP response headers.** Identify the functions that are provided by your platform to URL-encode data. Use these functions to URL-encode data that gets included in HTTP response headers.\n"
        ]
      }
    ]
  }
}