{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "408f56bf-9ca6-482d-bff2-a2495ff80917"
        ],
        "Id_History": [
          "408f56bf-9ca6-482d-bff2-a2495ff80917,3b088604-bd1b-4bf3-95fa-2091b7fed73e,"
        ],
        "Library_Id": [
          "c037d0d2-0617-44f3-b846-21dc3d02c4f8"
        ],
        "Title": [
          "The Server Is Hardened"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Server Is Hardened"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n*Any\n\n==What to Do==\nVerify that all servers are hardened. Make sure that attack surface is reduced by removing unused applications and disabling unused features, that servers are configured according to defined standards, that user accounts are limited to the lowest necessary privileges, that access controls are used to limit access, and that logs from the servers are sent to a centralized logging station where they are analyzed.\n\n==Why==\nHarden your server(s) to reduce the potential for successful attacks and to limit exposure in the event of a successful attack.\n\n==How to Check==\nTo make sure that your servers are hardened:\n\n# **Verify that the attack surface is minimal.** Create a spreadsheet of all the software and code libraries installed on each server. Determine whether each software package or library is necessary for the server to function properly. Make sure that only software that is necessary for the server to operate is installed. For each necessary software package, examine all features that can be disabled and make sure that all the features that are not necessary for the server to work are disabled.\n# **Verify that there is robust documentation for configuration standards.** Examine network documentation to make sure that it includes configuration standards for all servers.\n# **Verify that servers are configured according to standards.** Examine each server to make sure it is configured according to the documented standards.\n# **Verify that unused accounts are disabled and that user account privileges are limited.** Make sure all unused user accounts are disabled. Verify that privileges of each user account are limited to the minimum necessary for that account to be used for its intended purpose. Do this at the operating system level and for each application that manages user accounts.\n# **Verify that access controls are locked down.** Make sure that all access control lists are configured to provide minimum access for the server to function properly. Do this at the operating system level and for each application that implements access controls.\n# **Review the logging system.** Verify that all the logging options available to applications and the operating system are configured to log all security sensitive operations and to send logs to a centralized server. \n\n==How to Fix==\nTo harden your server(s):\n\n# ** Reduce the attack surface by removing unused software and disabling unnecessary features.** Create a spreadsheet of all the software and code libraries installed on each server. Determine whether each software package or library is necessary for the server to function properly. Remove those that are not necessary. For each software package that remains, examine all features that can be disabled, and disable all the features that are not necessary for the server to work.\n# ** Prepare hardening guides for all servers.** Look up some hardening guides on the Internet to use as a foundation, or write your own guides from scratch. Document all the configuration settings required to set up each server, with an accent on security-sensitive features.\n# ** Configure all security-relevant settings to an acceptable standard.** Configure the settings on each server according to the defined configuration guides.\n# ** Disable unused accounts, and limit user account privileges to the minimum necessary for job functions.** Disable all unused user accounts. Reduce privileges of each user account to the minimum necessary for that account to be used for its intended purpose. Do this at the operating system level and for each application that manages user accounts.\n# ** Limit access to the minimum necessary for job functions.** Configure all access control lists to provide minimum access for the server to function properly. Do this at the operating system level and for each application that implements access controls.\n# **Set up centralized logging.** Make sure to configure all the logging options that can facilitate sending logs to a centralized server. If possible, install software that will send logs to a centralized log server. Review all the logging options available by applications and the operating system and configure them as appropriate for your environment.\n\n==Additional Resources==\n* For a centralized log monitoring solution, see http://www.ossec.net/\n"
        ]
      }
    ]
  }
}