{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "42892132-de71-41b9-8c35-8f8ee23cb758"
        ],
        "Id_History": [
          "42892132-de71-41b9-8c35-8f8ee23cb758,dc311aab-f724-4748-9032-418d9eda7125,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Partition the Application Between Public And Private Domains"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Partition the Application Between Public And Private Domains"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <p>Scala and Play Framework 2.1.0+</p>\n  <h1>What to Do</h1>\n  <p>Define a boundary between public and restricted content. For \ninstance, anonymous users are restricted to one part of the application,\n while authenticated users can access both parts.<br /></p>\n  <h1>Why</h1>\n  <p>Defining a boundary between public and restricted content helps \nestablish the check points&nbsp;where access will be allowed&nbsp;to the \nrestricted content.</p>\n  <h1>When</h1>\n  <p>If your application has access control that&nbsp;restricts certain users\n to specific resources, then define a boundary between those resources. <br /></p>\n  <h1>How</h1>\n  <p>To define the boundary between public and restricted content:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Determine roles.&nbsp;</strong>Define the various types of \nusers and their rights. Build a security policy for the restricted \ncontent and base the user groups' privileges around it.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Define the boundary.&nbsp;</strong>Structure the content according to access and logical orders. Try to use a modular approach when establishing the boundary.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Separate on disk.&nbsp;</strong>Once the boundaries have been\n established, reflect these boundaries onto the local file system. \nSeparate the restricted content from the public content on disk.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Set proper permissions.&nbsp;</strong>Set proper permissions \nto the restricted content. Dedicate a special directory for the \nrestricted content and require valid access before accessing content \nwithin this directory. These permissions can be enforced at the \napplication, server and operating system levels, depending on the \nenvironment in use.</p>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}