{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "43cac6d1-4c4c-4b12-83c0-2974ddaabb21"
        ],
        "Id_History": [
          "43cac6d1-4c4c-4b12-83c0-2974ddaabb21,0ba760c6-6f69-4095-99c1-e52202d70c53,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Helper Classes Are Used to Assure Input Validation"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Helper Classes Are Used to Assure Input Validation"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n\r\n==What to Check For==\r\n\r\nCheck if helper classes are used to assure that user input is validated.\r\n\r\n==Why==\r\n\r\nHelper classes may help make sure that user input has been validated.\r\n\r\n==How to Check==\r\n\r\nUse the following steps to check if helper classes are used to assure input validation:\r\n\r\n# **Search code for input validation helper classes.** Search for a definition of a class that is used as a container for validated input.\r\n# **Examine the helper class.** Verify that the helper class includes a member variable for storing user input, a validation function, and a modifier that calls the validation function.\r\n# **Verify that the helper class is used.** Identify where in code user input is handled. Make sure that the helper class is used to handle user input instead of direct operations.\r\n\r\n==How to Fix==\r\n\r\nPerform the following actions to assure that user input is validated: \r\n\r\n# **Define a helper class.** Define a container class for user input. Since user input is most likely to be in the form of a string, declare a private string member. Declare an accessor for retrieving the value of the string member.\r\n# **Define a validation function.** Define a private validation function as a member of the helper class. This validation function may call other validation functions that are implemented in the input validation class or library.\r\n# **Define a modifier.** Define a modifier for the helper class that takes user input as an argument. Call the private validation function on user input. Return an error if user input is not valid. If user input is valid, assign user input as the value for the private string member. Now, whenever an instance of this helper class has data assigned to it, there is assurance that the data it contains has been validated.\r\n# **Use the helper class.** Identify all locations where user input is handled. Replace direct operations on user input with operations using the helper class."
        ]
      }
    ]
  }
}