{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "46dc084c-6913-4fc1-8170-0e8cba371c3f"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Restrict Inbound Traffic Using Security Groups"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          ""
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##Applies To##\r\n\r\n- Amazon Web Services (AWS)\r\n\r\n\r\n##What to Do##\r\n\r\nUse the AWS Management Console to specify and implement security groups in order to restrict inbound traffic to your cloud applications.\r\n\r\n\r\n##Why##\r\n\r\nSecurity groups are one of the measures that protect your services from unwanted intrusion. For example, security groups can be used to reduce the impact of port scans by limiting inbound traffic to as few ports as necessary. \r\n\r\nBy default, all ports are closed. Without the use of security groups, your services are closed. With proper engineering and design, these services are less vulnerable to security threats. \r\n\r\nSecurity group rules allow inbound traffic to instances associated with the security group. Security groups allow all outbound traffic by default.\r\n\r\nDeveloping and maintaining secure systems and applications is required by certification authorities such as PCI-DSS (Payment Card Industry Data Security Standard (Requirement 6).\r\n\r\n\r\n##When##\r\n\r\nInbound traffic is restricted according to the needs of required changes throughout the application lifecycle:\r\n\r\n1. **Design and Testing.** Security Groups are architected during application development and enable developers to run code. Testing requires the creation of groups and rules which mimic the actions of deployed application users.\r\n\r\n2. **Deployment** Test groups and rules are replaced and/or modified to reflect the need for additional security in the face of current security posture.\r\n\r\n3. **Periodic Security Checks.** When periodic security audits identify unwanted inbound traffic, you will modify security groups and rules to mitigate intrusions.\r\n\r\n\r\n##How##\r\n\r\n1. **Open Console.** Go to your account's EC2 Management Console and login. The security group is in the navigation pane on the right, and established groups appear in the top right pane. As you select a group, a list of rules appear in the bottom right pane.\r\n\r\n2. **Security Groups.** Create a new security group, and type in the name and description for the group. Accept the default VPC, or select another where applicable. Note that the name and description fields cannot be changed after the group is created. Any character restrictions for the field can be seen by clicking the info icon next to the field. Once saved, a security group can be copied by selecting Actions > Copy to new.\r\n\r\n3. **Add or Modify Inbound Rules.** Rules can be added when the group is created. Click Rule, select a rule Type, Protocol, Ports or port range, and type in a Source IP or IP range. The fields which can be changed are determined by the type of rule you select. If you need to manually populate all fields in a rule, use one of the custom rule types. When you've added the necessary inbound rules, save (or create), and the rule is applied to instances associated with the security group.\r\n\r\n4. **Delete Rules.** Rules are deleted from security groups and associated instances when you save the changes. Select the security group in the console, and edit. Delete the rule, and save (or cancel) your deletion.\r\n\r\n5. **Delete Security Group.** Security groups are deleted with the Actions > Delete Security Group option. Confirmation is required. Cancel the action to keep the security group, or agree to the deletion.\r\n\r\nAll of the security group and rules operations can be performed with a command line tool, such as:\r\n\r\n- AWS CLI\r\n- Amazon EC2 CLI\r\n- AWS Tools for Windows PowerShell. \r\n\r\nFor command details and use instructions, refer to the API and Command Overview topic in the [Amazon Elastic Compute Cloud User Guide for Linux](http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ \"Amazon Elastic Compute Cloud User Guide for Linux\").\r\n\r\n##Additional Resources##\r\n\r\n- [Amazon Elastic Compute Cloud User Guide for Linux](http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ \"Amazon Elastic Compute Cloud User Guide for Linux\")\r\n- [AWS Security Best Practices](http://aws.amazon.com/security/ \"AWS Security Best Practices\")\r\n"
        ]
      }
    ]
  }
}