{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "48be90af-1177-4e9f-9a2c-60ad76e4a35d"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Place Sensitive Data in Exposed Parameters"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nUse platform provided session handling to prevent storing sensitive data in user accessible parameters.\r\n\r\n## Why ##\r\n\r\nPlacing sensitive information in user accessible parameters allows an attacker to recover and/or tamper with that information. For example, if the application stores the users' group membership information in the URL, the attacker can easily assign themselves to whatever group he chooses, usually making themselves an admin and taking over the application. This used to be a surprisingly common vulnerability during the early days of web applications. Other possible vulnerabilities include allowing an attacker to retrieve sensitive information from parameters using man-in-the-middle attacks. The exact nature of possible vulnerabilities depends on the type of sensitive information that is stored in user accessible parameters. All of these vulnerabilities can be prevented by using platform-provided session management.\r\n\r\n## How ##\r\n\r\nTo prevent storing sensitive data in user accessible parameters:\r\n\r\n1. **Identify all parameters that contain data with security implications.** Review the application code to find all parameters that may contain sensitive information.\r\n2. **Find code that handles security sensitive parameters.** Find the code that is responsible for each user accessible parameter that contains sensitive information.\r\n3. **Replace sensitive user-accessible parameters with platform-provided session management.** Rewrite the code that stores sensitive information in user accessible parameters to store it using sessions instead.\r\n"
        ]
      }
    ]
  }
}