{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "49770cb7-883d-4e42-8489-5eaf2c7407ad"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Risks for Applications in the Cloud Are Identified"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##What to Check For##\r\n\r\nVerify that risks for the applications in the cloud have been identified.\r\n\r\n##Why##\r\n\r\nBy identifying application security risks, you gather details about the impact to an organization when a threat scenario is realized. If the risks are not enumerated and measured, there is great difficulty in having sufficient resources ready for an incident response.\r\n\r\nWhen risks are listed in your security framework, it is clear how immediate your response needs to be when attackers overcome established controls.\r\n\r\n\r\n##When##\r\n\r\nWhen running an application in the cloud, you are required to secure the application. A variety of infrastructure safeguards are provided by AWS. You must always provide additional protection, especially when your application works with sensitive information. Identifying application security risk helps guide the assignment of resources and the actions of your incident response team.\r\n\r\n##How to Check##\r\n\r\nTo make sure that risks for the applications in the cloud have been identified:\r\n\r\n1. **Identify responsible personnel.** Find and interview the employees that are responsible for identifying risks to the applications in the cloud.\r\n\r\n2. **Examine documented risks.** Review the documentation that includes the risks that have been identified and assess its quality.\r\n\r\n##How to Fix##\r\n\r\nThe following activity provides a suggested method for identifying and assessing risks for a cloud application. The goal is to maintain a secure posture by allocating resources for the protection of your cloud assets. The products include a security frame with categories, vulnerabilities, controls and risks laid out for further analysis. \r\n\r\n1. **Choose a security framework.** Select a security framework so that you can organize the application's vulnerabilities and threats. \r\n\r\n2. **Decide on classification categories.** Select common categories (input and data validation, sensitive data, and cryptography, for example) to help segment vulnerabilities into areas of concern.\r\n\r\n3. **Examine vulnerabilities.** In your security frame add vulnerabilities to each category. For example, the cryptography category has vulnerability to failure to secure keys, as well as insecure distribution of keys. For more information on identifying vulnerabilities, see https://nvd.nist.gov/.\r\n\r\n4. **Use a threat model.**  Use a threat risk modeling tool or method to survey the web application, decompose it, and identify vulnerabilities and threats. This will minimize the use of resources, and provide an efficient method to be used for identifying attack vectors.\r\n\r\n5. **Identify attack vectors.** Use the results of threat modeling to identify specific attack vectors for the application. Attack vectors may be associated with multiple threats. Once identified and integrated with your security frame, you can examine the controls and incidence response items which apply.\r\n\r\n6. **Identify threat scenarios.** For each attack vector, develop an impact statement which lists the possible scenarios as well as actor, motive, access mode, and outcome.\r\n\r\n7. **Rate each scenario.** Assign an impact rating to each scenario. For example, use values such as: none (0); low (1); medium (3); or high (4).\r\n\r\n8. **Identify risks.** Each risk consists of an impact statement, and a probability, which is calculated from the threat outcome and the consequence. The impact statement names the resources that will become unavailable or lost as the scenario plays out if unchecked. \r\n\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}