{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "49ecb4cc-4778-493f-b41a-b06bb608ad26"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use Files Safely"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nBe careful when using files. Many platforms have peculiar issues related to opening and creating files. Understand the nuances of using files with your platform and handle files with this understanding.\r\n\r\n\r\n## Why ##\r\n\r\nThe issues with file handling stem from the fact that operating systems implement counter-intuitive functionality as a part of their file handling features, such as being able to manipulate non-files in the same way as files, following symbolic names, or having multiple names for the same file. These features are then typically inherited by whatever platform is running on those operating systems and thus by the application. Sloppy file operations can result in a number of vulnerabilities such as allowing attackers to overwrite or read files in a manner not intended by the application.\r\n\r\n\r\n## How ##\r\n\r\nThe issues related to the To prevent overwriting data in files when writing to them:\r\n\r\n1. **Identify possible file-handling pitfalls for your platform.** TM articles describe some of these pitfalls, but ultimately the developer is responsible for understanding the application's environment.\r\n\r\n2. **Determine best practices for file-handling.** TM articles describe some of the most common file-handling issues and how to control them using best practices.\r\n\r\n3. **Identify code that writes to files.** Search for code that creates, reads, or writes files. Make a spreadsheet of all such code.\r\n\r\n4. **Apply best practices.** Apply the file-handling best practices to the code that uses files.\r\n\r\n\r\n## Additional Articles ##\r\n\r\n- [Create Files Safely on Windows](81f61d02-6521-4d0e-9c4b-7f96889cef76)\r\n- [Open Files Safely on UN*X](10f126b4-a75a-4d26-82e8-b419579942b1)"
        ]
      }
    ]
  }
}