{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "4e9ccc32-97e6-441e-8d0c-9e969c8634ab"
        ],
        "Id_History": [
          "4e9ccc32-97e6-441e-8d0c-9e969c8634ab,3716f538-b958-4c61-b84c-68f353f26b5f,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "All File Name and Path Input Is Canonicalized"
        ],
        "Category": [
          "Canonicalization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All File Name and Path Input Is Canonicalized"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Java\r\n\r\n==What to Check For==\r\n\r\nVerify that all file name and path input is canonicalized before being validated.\r\n\r\n==Why==\r\n\r\nWhen input validation is applied to file paths and names, it only works properly when file paths and names are canonicalized. If file names and paths are not canonicalized before validation, a number of vulnerabilities may be introduced as a result. The possible vulnerabilities range from reading arbitrary files to uploading web shells. \r\n\r\n==How to Check==\r\n\r\nTo verify that all file name and path input is canonicalized before being validated:\r\n\r\n# **Identify all file path and name input.** Examine the application and find all cases where the user may specify file names or paths.\r\n# **Find code that handles file path and name input.** Review application code and find all functions that handle user supplied file names or paths.\r\n# **Determine whether file path and name input is necessary.** If possible, don't accept file names and/or paths from users.\r\n# **Verify that file name and path input is canonicalized.** If it is necessary to use file names and/or paths provided by users, then make sure that the getCanonicalPath() function is used to canonicalize them before validation.\r\n# **Verify that file name and path input is validated.** Review code that handles user-supplied file name and/or path input and make sure that file names and paths are validated after being canonicalized. The canonicalized forms of file names and paths should be passed to validation routines.\r\n\r\n==How to Fix==\r\n\r\nTo canonicalize all file path and name input:\r\n\r\n# **Identify all file path and name input.** Examine the application and find all cases where the user may specify file names or paths.\r\n# **Find code that handles file path and name input.** Review application code and find all functions that handle user supplied file names or paths.\r\n# **Avoid file path and name input if possible.** If possible, remove or replace the code that allows users to enter file names or paths.\r\n# **Canonicalize file path and name input.** Examine each function that handles user supplied file names or paths. Re-write these functions as necessary to use getCanonicalPath() to canonicalize file names and paths.\r\n# **Validate file path and name input.** Examine each function that handles user supplied file names or paths. Re-write these functions as necessary to use positive validation on canonicalized file names and paths. Ensure that the validation routines validate that the user has sufficient rights to access the requested resource.\r\n\r\n==Additional Resources==\r\n\r\n* For more information about canonicalizing file paths in Java, see https://www.securecoding.cert.org/confluence/display/java/IDS02-J.+Canonicalize+path+names+before+validating+them\r\n"
        ]
      }
    ]
  }
}