{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "512783b4-01cd-4256-bb64-2b2e99879af8"
        ],
        "Id_History": [
          "512783b4-01cd-4256-bb64-2b2e99879af8,18b25648-47f8-4ed0-831a-0fc268bf9d48,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encryption Keys Are Protected"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Encryption Keys Are Protected"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* PHP\n\n==What to Check For==\n\nVerify that encryption keys are protected.\n\n\n==Why==\n\nProtect the encryption keys to prevent your encrypted data from being compromised. If the encryption keys are stored together with the data, then an attacker may be able to get the keys together with the data and then use them to decrypt the data. Therefore, keeping the keys together with the encrypted data defeats the purpose of encrypting the data. \n\nThere is no practical encryption key management method available natively in PHP. The only practical way to implement key management in PHP in a manner that will satisfy regulatory requirements is to use a third-party solution that has been found acceptable by various regulatory agencies.\n\n==How to Check==\n\nTo verify that encryption keys are protected:\n\n# **Identify key management requirements.** Determine the key management requirements for your application. These might be defined by the application design and/or by compliance requirements.\n# **Identify the mechanism that is used to protect the encryption keys.** Find code that is responsible for key management in your application.\n# **Verify that encryption keys are protected.** Review code that is responsible for key management to make sure that it matches the requirements defined for the application.\n\n\n==How to Fix==\n\nTo use a trusted third-party for key management in PHP:\n\n# **Identify a trusted third-party key management solution.** There are very few options available. One option is linked to at the bottom of this page.\n# **Use the third-party key management solution.** Work together with the vendor of the third-party key management solution to use it in your application.\n\n==Additional Resources==\n\n* For information about a third-party PHP key management solution, see http://townsendsecurity.com/developers/languages/PHP-Developer-Solutions\n"
        ]
      }
    ]
  }
}