{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "524e7083-1cf4-4db9-8c0c-2479ba45ded2"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Throttle Logs"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nThrottle logging of events when they occur at very high frequencies. When identical events occur multiple times, make a single entry that states that such an event occurred and the amount of times it occurred. Consider sending logs to a remote log server.\r\n\r\n## Why ##\r\n\r\nLogging too much data causes denial of service attacks that may degrade application performance or result in missing log entries.\r\n\r\n## When ##\r\n\r\nConsider log throttling when it is possible for some logged event to occur at a very high frequency. It is up to you to determine what constitutes a high frequency for your application. The main criteria is whether the logging subsystem can handle the resulting amount of data.\r\n\r\n## How ##\r\n\r\nPerform the following actions to throttle logging:\r\n\r\n1. **Consider log throttling.** Use log throttling when important events may occur at a frequency that may overwhelm the logging subsystem.\r\n2. **Identify logging requirements.** Consider which events might occur at a high frequency and may be throttled without losing valuable auditing information. Make a list of all events for which logging should be throttled. Use these requirements for implementation.\r\n3. **Implement log throttling.** Use the list of events for which logging should be throttled to identify code that generates the corresponding log entries. Modify this code to throttle logs by counting identical or similar events that occur at a high frequency and producing a single record that includes the details of the event and the amount of times it has occured.\r\n"
        ]
      }
    ]
  }
}