{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "5339bbde-f2ec-43a3-a689-7652dc6ae151"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Communication Channels Are Encrypted"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\r\n\r\nVerify that sensitive data sent over untrusted networks is protected using TLS with valid certificates.\r\n\r\n==Why==\r\n\r\nUsing TLS with valid certificates to protect sensitive data in transit prevents this data from being sniffed or tampered with. \r\n\r\n==How to Check==\r\n\r\nTo verify that sensitive data sent over untrusted network is protected using TLS with valid certificates:\r\n\r\n# **Check the certificates.** Examine the TLS certificates used by the application to make sure that they are valid by checking them with the issuing Certificate Authority.\r\n# **Identify code that sends data over untrusted networks.** It is more practical to secure all communications that to separate the communications that contain sensitive data from those that don't. Make a spreadsheet of all the code that uses networks to transmit data.\r\n# **Verify that TLS is used to protect sensitive data in transit.** Examine the code that sends data over the network to make sure that data is only sent over sockets that are protected using TLS and that valid certificates are required to successfully negotiate TLS handshakes. In other words, the connection should fail if certificates don't pass validation.\r\n\r\n\r\n==How to Fix==\r\n\r\nTo protect sensitive data in transit over untrusted networks using TLS:\r\n\r\n# **Purchase valid TLS certificates.** You may purchase a valid TLS key from VeriSign, Thawte, or your web hosting provider. Follow the vendor's instructions for purchasing the TLS certificate. The certificate is usually a .cer file. Make sure the certificate matches all domains used by the application.\r\n# **Identify code that sends data over untrusted networks.** It is more practical to secure all communications that to separate the communications that contain sensitive data from those that don't. Make a spreadsheet of all the code that uses networks to transmit data.\r\n# **Use TLS to protect data in transit.** If the code that sends data over the network doesn't already, modify it to only use TLS sockets with valid certificates for network communications.\r\n"
        ]
      }
    ]
  }
}