{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "54335321-0b6a-4d2e-8ee3-594ecf8c00cf"
        ],
        "Id_History": [
          "54335321-0b6a-4d2e-8ee3-594ecf8c00cf,c027ec3b-63dd-4b87-9ec2-fe5ca42f6b20,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "Object References Are Checked for Null Before Being Used"
        ],
        "Category": [
          "Other"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Object References Are Checked for Null Before Being Used"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Java\r\n\r\n==What to Check For==\r\n\r\nVerify that object references that are passed as parameters to functions are checked for null before being used.\r\n\r\n==Why==\r\n\r\nCheck function parameters for null before using them to prevent your application from crashing if it tries to use that parameter as an object.\r\n\r\n==How to Check==\r\n\r\nTo verify that object references that are passed as parameters to functions are checked for null before being used:\r\n\r\n# **Identify all functions that accept object references as parameters.** Make a spreadsheet of all functions that accept object references as parameters. Most functions in your application will probably be in that spreadsheet and that is okay.\r\n# **Verify that object references that are passed as parameters are validated.** Examine each function that accepts object references as parameters. Verify that each object reference is checked for null before being used as an object. If a function is passed null as a parameter instead of an object, the function should either throw an exception or simply not use that parameter as an object.\r\n\r\n==How to Fix==\r\n\r\nTo check function parameters for null before using them:\r\n\r\n# **Identify all functions that accept object references as parameters.** Make a spreadsheet of all functions that accept object references as parameters. Most functions in your application will probably be in that spreadsheet and that is okay.\r\n# **Update all functions that accept object references as parameters to check parameters for null.** At the beginning of each function that accepts object references, add code to check each reference for null. If a function is passed null as a parameter instead of an object, the function should either throw an exception or simply not use that parameter as an object.\r\n"
        ]
      }
    ]
  }
}