{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "55783bb4-54b8-4899-bb07-63f5a77381bb"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use FILE_GET_NAME and FILE_VALIDATE_NAME to Validate File Names"
        ],
        "Category": [
          "Input Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "ABAP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- SAP ABAP\r\n\r\n\r\n## What to Do ##\r\n\r\nUse function modules `FILE_GET_NAME` and `FILE_VALIDATE_NAME` with Advanced Business Application Programming (ABAP) to validate physical filenames and counter the threat of filepath traversal.\r\n\r\n\r\n## Why ##\r\n\r\nThe web and application servers are set up with restrictions to specific areas of the server's file system. Without programmatic protection against file traversal, an intruder could gain access to forbidden areas by altering and manipulating a URL and submitting it to the system. The function modules `FILE_GET_NAME` and `FILE_VALIDATE_NAME` protect the SAP system by converting a logical file name to the corresponding physical file name and path. This ensures that an attacker cannot manipulate the filename and/or path.\r\n\r\n\r\n## When ##\r\n\r\nFile names should always be validated when a SAP program accesses files on the application server. When you are invoking the ABAP command `OPEN DATASET`, or related statements, users may be able to enter the requested file name. This activity must always be restricted and filtered by using the functions `FILE_GET_NAME` and `FILE_VALIDATE_NAME`.\r\n\r\n\r\n## How ##\r\n\r\nTo prevent path traversal attacks in ABAP programs, use the following guided steps. For more detailed instructions and code examples, refer to the Additional Resources section of this document.\r\n\r\n1. **Create a default logical path.** It is necessary to first create a logical path to specify the OS-dependent physical path to the location where users will create filenames. SAP installs a default logical path `TMP` to temporary directories on UNIX and MS Windows.\r\n\r\n2. **Create a logical file of data format DIR.** Create a logical file of data format DIR (directory) that uses the logical path created previously. It is best to use an absolute filename in this case.\r\n\r\n3. **Define a constant logical filename.** The constant logical filename is used for filename validation. For each physical filename parameter in the application, create one constant of type `FILEINTERN` (logical filename).This constant can be a global within your program, local within the program, or defined in a type pool for multiple-use across programs. The constant value is set to the logical filename used for filename validation. For example:\r\n\r\n\t`CONSTANTS lc_log_fname LIKE FILENAME-FILEINTERN VALUE 'ZMY_OUTDIR'.`\r\n\r\n4. **Create a default value for the physical filename.** Call the function module `FILE_GET_NAME` with the parameter `INCLUDING_DIR` set to 'X' (for example, during INITIALIZATION). This establishes a default value for the physical filename. Be sure to catch an exception and change the message type to avoid the program aborting with a message. `FILE_GET_NAME` raises the exception with message type E, which is converted to message type A during Process before Output (PBO).\r\n\r\n5. **Check for a relative filename path.** The function module `FILE_VALIDATE_NAME` always checks absolute filenames with specified paths. If a relative filename is passed for checking, the default path is implicitly added as a prefix to `DIR_HOME` in accordance with the profile parameter. A complete example follows:\r\n\r\n\t\tAT SELECTION-SCREEN\r\n\t\t* Check whether the filename is a relative one \r\n\t\t  IF  cl_fs_path => create (  pv_fname  ) ->is_relative ( ) =  abap_true .\r\n\t\t    \" Filename is a relative one, put the default path before the filename\r\n\t\t    \" We also need to check in this case, as '/tmp' + '../etc/test.txt' is still outside /tmp\r\n\t\t    lv_full_name  =  lv_defaultpath && pv_fname .\r\n\t\t  ELSE .\r\n\t\t    \" Filename is already absolute, just use it.\r\n\t\t    lv_full_name  =  pv_fname . \r\n\t\t  ENDIF .\r\n\r\n6. **Validate input.** Validate the physical filename supplied by the user on the screen where the filename was entered. This ensures that an error is immediately returned when the filename is invalid. The user then has an opportunity to change the filename to a valid entry. If additional logic is performed after entry, the processing time and the use of system resources was unnecessary. A complete input validation example follows:\r\n\r\n\t\tCALL FUNCTION 'FILE_VALIDATE_NAME'\r\n\t\tEXPORTING\r\n\t\tlogical_filename   = lc_log_fname\r\n\t\tCHANGING\r\n\t\tphysical_filename  = lv_full_name\r\n\t\tEXCEPTIONS\r\n\t\t  LOGICAL_FILENAME_NOT_FOUND = 2\r\n\t\t  VALIDATION_FAILED  = 1\r\n\t\tOTHERS   = 4.\r\n\r\n\t\tIF  SY - SUBRC <>  0.\r\n\t\t  IF  SY - SUBRC >  1.\r\n\t\t    MESSAGE ID sy-msgid  TYPE  'A'  NUMBER  sy-msgno\r\n\t\t      WITH sy-msgv1 sy-msgv2 sy-msgv3 sy-msgv4.\r\n\t\t  ELSE .\r\n\t\t    MESSAGE 'The filename >' && pv_fname && '< is not valid, please try again.' TYPE 'E'.\r\n\t\t  ENDIF.\r\n\t\tENDIF.\r\n"
        ]
      }
    ]
  }
}