{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "57829386-5df5-4f7f-993a-3552ab3a292c"
        ],
        "Id_History": [
          "57829386-5df5-4f7f-993a-3552ab3a292c,a26cfecf-b126-4e08-82ca-662d09f0288d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Insufficiently Protected Credentials"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "Insufficiently Protected Credentials"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Description==\n\nAn insufficiently protected credential weakness occurs when the application doesn't store or transmit the authentication credentials securely. If the passwords are not hashed and salted, an attacker might be able to recover stored passwords after compromising the application. If the passwords or hashes are not encrypted during transmission, an attacker might be able to intercept passwords or hashes vis a man-in-the-middle attack. All applications that use authentication are affected by this vulnerability type. \n\n==Impact==\n\nAn insufficiently protected credential vulnerability makes it easier for an attacker to gain access to the authentication credentials. Usually, some other vulnerability has to be present for the attacker to recover the credentials. Once the attacker has the credentials, they can impersonate the user whose credentials have been compromised. Malicious hackers usually target privileged accounts to take over the application. After taking over the application, an attacker might leverage other vulnerabilities to take over the application platform and use it to pivot for other attacks. Compromising the application also gives the attacker access to user data, thus enabling them to impersonate the user. \n\n==Countermeasures==\n\nTo prevent this vulnerability type, use PBKDF2 to secure passwords and send authentication credentials over encrypted tunnels. \n\nUse PBKDF2 to secure passwords:\n* [[00000000-0000-0000-0000-0000006adfa3|Store Passwords Securely]]\n\nSend authentication credentials only over TLS:\n* [[8f9abcf2-db84-4e46-9be6-9d2b166315ad|Protect Authentication Credentials in Transit]]\n\n\n==Application Check==\n\nTo check for adequate protection against this vulnerability type, verify that PBKDF2 is used to secure passwords and that authentication credentials are never sent in plain-text. \n\nPBKDF2 is used to secure passwords:\n* [[00000000-0000-0000-0000-00000077a50c|Passwords Are Stored Securely]]\n\nAuthentication credentials are only sent over TLS:\n* [[806abffc-7528-454e-aa90-826b2fad60a6|Authentication Credentials in Transit Are Protected]]\n\n\n==Computer Based Training Links==\n\nUse the following Computer Based Training course(s) for more background information about this type of vulnerabilities.\n\n===OWASP Top Threats & Mitigations===\n\nThis course examines in depth the vulnerabilities, threats, and mitigations described in the OWASP Top 10 2013. Upon completion of this class, participants will be able to identify and mitigate the greatest threats that web application developers face, including: Injection, Broken Authentication and Session Management, Cross-Site Scripting (XSS), Insecure Direct Object References, Security Misconfiguration, Sensitive Data Exposure, Missing Function Level Access Control, Cross-Site Request Forgery (CSRF), Using Components with Known Vulnerabilities, and Unvalidated Redirects and Forwards.\n\n[[https://teamprofessor.absorbtraining.com/ninja/#/courses/course/139631|DES 221 OWASP Top Threats & Mitigations]]\n\n//Valid login credentials and enrollment in the course itself are required to access Team Professor content. If you need login credentials, please contact support@securityinnovation.com for help.//"
        ]
      }
    ]
  }
}