{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "5b4ea6e5-1779-41bf-9bfd-c787f8c416ef"
        ],
        "Id_History": [
          "5b4ea6e5-1779-41bf-9bfd-c787f8c416ef,b92c64ae-9a07-42b0-8eb5-75fd76333e5d,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Perform a Control Flow Analysis"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Perform a Control Flow Analysis"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Web Applications\n\n==What to Do==\n\nControl flow analysis is the mechanism used to step through logical conditions in the code. The process works as follows:\n\n# Look at a function and determine each branch condition. These can include loops, if statements, and try/catch blocks.\n# Understand the conditions under which each block will be executed.\n# Move to the next function and repeat.\n\n==Why==\n\nUse control flow analysis to find vulnerabilities caused by logic errors.\n\n==When==\n\nPerform control flow analysis during the development stage of the application development life cycle.\n\n==How==\n\nControl flow analysis is the mechanism used to step through logical conditions in the code. The process works as follows:\n\n# Look at a function and determine each branch condition. These can include loops, if statements, and try/catch blocks.\n# Understand the conditions under which each block will be executed.\n# Move to the next function and repeat.\n\nAs you investigate the control flow keep the following questions in mind:\n\n# **Does the application rely on client side validation?** Managed or web app code is easy to modify on the client, the server should never trust client code. It is easy to modify the behavior of the client or just write a new client from scratch that doesn’t observe the same data validation rules. \n# **Are there secrets or critical IP embedded in the code?** Managed code is easy to decompile, in fact it is possible to recover code from the final executable that is very similar to the original code. Any sensitive IP or hard coded secrets can be stolen with ease. An obfuscator can make this type of theft more difficult but cannot completely prevent it. Another common problem is to use hidden form fields thinking this information will not be visible to the user.\n# **Is sensitive data being stored in predictable locations (such as temp files), or being sent in clear text over the network?** Sensitive data should be stored and transmitted in encrypted form, anything less invites theft. \n# **Is cryptography being used?** Look for poor random number generators. Look for poor management of keys. Flag hard coded key values, leaving these in the code will help to ensure your cryptography is broken. Ensure that key values are not passed from method to method by-value as this will leave many copies of the secret in memory to be discovered by an attacker. Look for failure to clear secrets from memory after use. Look for custom cryptographic routines. Some think that a less well known algorithm equals more security but this is not true. Cryptographic algorithms are mathematically proven, and as such the more eyes on them the better; obscurity will not protect your flawed implementation from a determined attacker. \n# **Are there undocumented public interfaces?** Look for public interfaces that have not been documented as well as the other interfaces in your application. Is the interface you are looking at a test interface or a backdoor administrative interface? Many times these shouldn’t be in the product at all, and they are almost never given the same level of design and test scrutiny as the rest of the product.\n# **Is the component giving dependencies too much trust?** Without explicit safeguards it is possible for an attacker to trick your code into loading a malicious library instead of trusted code.\n# **Is there proper and consistent error checking?** Ensure that there is consistent use of try/catch and return value checking. Keep an eye out for empty catch blocks. Also look for cases where impersonation or elevated privileges may not be lowered in the case an exception is thrown. This can occur either due to a logic bug - catch doesn’t contain the right code - or due to a subtle misuse of a finally block by an attacker. Exception filters run before the finally block so it may result in malicious code executing in the context of the privileged code rather than in the partially trusted context it should be running in.\n# **Do error messages give away too much information?** Error messages should be helpful to the average user without giving away information that an attacker could use against you. Ensure that the code doesn’t give away call stacks, lines of code, server file paths or anything else internal to the application. This information is not helpful to a user but can be very helpful to an attacker. \n# **Does your application expose sensitive information via user session?** If you are reviewing a web application and it reveals sensitive information via user session then pay particular attention to how the session is managed.\n# **Can write operations be performed with a GET request?** Check to see if it is possible to modify data or content with a GET request. This opens the door for an attacker to trick a legitimate user into performing illegitimate actions with their account.\n# **Is the code multithreaded?** Check for race conditions, especially in static methods and constructors.\n\n"
        ]
      }
    ]
  }
}