{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "5ba2a24b-b43c-4dee-becf-bb4332831429"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Coordinate Incident Response with AWS"
        ],
        "Category": [
          "System Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- Amazon Web Services (AWS)\r\n\r\n\r\n## What to Do ##\r\n\r\nAs part of your incident response plan, coordinate planned response actions with the AWS security team. Review the services agreement and support plan details for important details about the level of interaction you can expect.\r\n\r\n\r\n## Why ##\r\n\r\nIn the shared services security model, AWS is part of your incident response team (IRT). AWS has control of the bottom five layers in the cloud stack while you are responsible for the top six:\r\n\r\n- Applications\r\n- Data\r\n- Runtime\r\n- Middleware\r\n- Operating system\r\n- Virtual machine image (VMI)\r\n- Hypervisor\r\n- Servers\r\n- Storage\r\n- Networking\r\n- Facility\r\n\r\nIt is necessary to coordinate efforts among all team members in order to avoid confusion or timing errors as individual actions are undertaken.\r\n\r\nAWS needs to be aware of the source of your legitimate activity so that it is not confused with threat sources. AWS can also give advice about best practices during the incident. They may also be able to provide updated machine images with more recent patches applied, freeing up some of your team resources for other matters.\r\n\r\n\r\n## When ##\r\n\r\nAfter you have made an initial assessment, and confirmed that this is not a false-positive, communicate the incident to AWS support. Depending on your level of support, you will hear back in the time period specified in your agreement. This is an important consideration when selecting an AWS support package.\r\n\r\n- Support level - access type, Primary case handling:\r\n- Basic - online form (no technical support), Technical Customer Service Associate\r\n- Developer - email (local business hours), Cloud Support Associate\r\n- Business - phone, chat, email, live screen sharing (24/7), Cloud Support Engineer\r\n- Enterprise - phone, chat, email, live screen sharing, TAM (24/7), Senior Cloud Support Engineer\r\n\r\n\r\n## How ##\r\n\r\nUse the following steps to guide the coordination of your incident response with AWS.\r\n\r\n1. **Make an initial assessment.** Categorize the incident and determine if AWS support is required for resolution. In some cases you may have received notification from AWS, or noticed suspicious IAM or billing activity. Be sure to keep a record of all contact with AWS and other support you may have available. Begin to execute your organization's incident response plan (IRP).\r\n\r\n2. **Communicate the incident.** Open an AWS support case. Sign into the management console to file a ticket. If root is compromised then you will need to phone AWS support.\r\n\r\n3. **Coordinate response with AWS.** AWS support will respond within the terms of your support agreement. Also notify external agencies if required. As you execute your IRP, be sure to update the ticket. If you are using other messaging options for support, record the details in your project log book. Be sure to keep notes about any conversations.\r\n\r\n4. **Recover systems.** AWS engages service-specific SMEs as needed for the incident. Cooperate with AWS and work towards resolution. Identify steps to avoid recurrence of similar incidents. During recovery AWS does not have access to the private information inside your instances or other resources. They can guide your recovery of data, but cannot directly access the operating system or application. Since there is separation, AWS cannot provide historical information, including access logs. Deep incident investigation and mitigation is the account holder's responsibility.\r\n\r\n5. **Close the incident.** Compile and organize incident documentation. Provide a report of the outcome to AWS. It may be necessary to follow up if additional details are requested by AWS. Close the incident ticket.\r\n\r\n6. **Reverse fraudulent charges.** When an account is compromised, you may incur extensive credit card charges for EC2 instances and other services. Review the Billing & Cost Management Dashboard in your management console, and raise any issues with AWS billing by opening a billing support ticket. Be sure to retain records of the disputed charges so that you can follow up with billing until credit is issued to your card company.\r\n\r\n"
        ]
      }
    ]
  }
}