{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "5d296e90-a27c-424a-bfe1-5576490b50c2"
        ],
        "Id_History": [
          "5d296e90-a27c-424a-bfe1-5576490b50c2,dd606077-5850-4dff-8db8-f0e2fa58e5f8,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Protect Session Cookies"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Protect Session Cookies"
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* Scala and Play Framework 2.1.0+\r\n\r\n\r\n## What to Do ##\r\n\r\nProtect the confidentiality of session cookies.\r\n\r\n\r\n## Why ##\r\n\r\nSession cookies are used by an application to identify the session associated with a particular user. Protecting session cookies can help prevent an attacker from hijacking the session and using the application as a legitimate user.\r\n\r\n\r\n## When ##\r\n\r\nIf your application uses cookies to maintain a user's session state, then use this guideline to protect the cookie.\r\n\r\n\r\n## How ##\r\n\r\nTo secure session cookies:\r\n\r\n1. **Do not allow users to choose their own session identifiers.** Use the Scala cookie feature to automatically assign random IDs to its sessions. This minimizes the risk of an attacker hijacking another user's session by using the same session ID. To use sessions in Scala, invoke play.api.mvc.Cookie.\r\n\r\n2. **Invalidate the session identifier on login (as well as logout) to ensure session identifiers are not reused.** This is necessary to prevent session hijacking. After the session has been invalidated, make a call to generate a new session identifier.\r\n\r\n3. **Time-out sessions.** Set an expiration time for sessions. This helps minimize the threat of session hijacking by giving an attacker a smaller window of opportunity. Depending on your application, an appropriate timeout can be anywhere from 10 to 20 minutes.\r\nAllow users to terminate their sessions. Allowing users to invalidate their sessions reduces the risk of the session being hijacked. Use result.discardingCookies to accomplish this.\r\n\r\n4. **Ensure cookies are sent over encrypted channels.** Mark cookies sent over TLS as Secure. Use the  Enable Secure flag on the cookie, setting “application.session.secure=true” in the “application.conf” file. Do not send session cookies over unencrypted channels as session hijacking is made much easier."
        ]
      }
    ]
  }
}