{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "617b6f1f-017c-4cab-91ec-854fee4be42e"
        ],
        "Id_History": [
          "617b6f1f-017c-4cab-91ec-854fee4be42e,938aa01b-1006-4e37-815b-1e1d27c0ef79,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Strong Password Requirements Are Enforced"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Strong Password Requirements Are Enforced"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\n\nVerify that strong password requirements are enforced.\n\n==Why==\n\nRequiring strong passwords prevents weak passwords from being used. Using strong passwords makes the application more resilient to password guessing attacks.\n\n==How to Check==\n\nTo verify that strong password requirements are enforced:\n\n# **Identify application requirements.** Determine whether your application needs to have a customizable password complexity policy or if it's okay to hard-code password complexity requirements. Define secure defaults for password complexity options.\n# **Identify password changing code.** Review your application to find code that is responsible for changing user passwords.\n# **Verify that password length is validated.** Verify that password changing code checks the user-supplied password against defined minimum and maximum allowed password lengths.\n# **Verify that password complexity is validated.** Verify that password changing code checks the user-supplied password to make sure it includes lower-case characters, capital letters, numbers, and special characters to match application requirements.\n\n==How to Fix==\n\nTo enforce strong password requirements:\n\n# **Identify application requirements.** Determine whether your application needs to have a customizable password complexity policy or if it's okay to hard-code password complexity requirements. Define secure defaults for password complexity options.\n# **Identify password changing code.** Review your application to find code that is responsible for changing user passwords.\n# **(Optional) Let the user enter the password twice.** It is a common practice to allow the user to enter the password twice to make sure that the user enters the new password correctly. This is important because the password fields are typically masked, so the user cannot see his input, and changing the password to an unintended one may leave the user locked out of his account. If this is implemented in your application, the password changing code should validate the two entered passwords to make sure they match.\n# **Check password length.** Add code to the password changing function to check the password length for minimum and maximum limits defined by policy.\n# **Check the password for numbers.** Add code to the password changing function to check the password for numbers. \n# **Check the password for lower-case letters.** Add code to the password changing function to check the password for lower-case letters.\n# **Check the password for capital letters.** Add code to the password changing function to check the password for capital letters.\n# **(Optional) Check the password for symbols.** If your application requires it, add code to the password changing function to check the password for symbols. "
        ]
      }
    ]
  }
}