{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "693edecc-703d-4bf7-911e-12acce8391b1"
        ],
        "Id_History": [
          "693edecc-703d-4bf7-911e-12acce8391b1,78e56a65-478d-449e-af8a-1033f6e8fc21,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Centralize Authentication Controls"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Centralize Authentication Controls"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <p>Scala and Play Framework 2.1.0+</p>\r\n  <h1>What to Do</h1>\r\n  <p>Centralize authentication controls.</p>\r\n  <h1>Why</h1>\r\n  <p>Having a single set of centralized authentication controls helps ensure correct implementation, use, and administration of the controls.</p>\r\n  <h1>How</h1>\r\n  <p>To centralize authentication controls:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify application requirements.</strong>&nbsp;Consider the following aspects of authentication controls:</p>\r\n      <ul>\r\n        <li>Authentication should be required for all private pages.</li>\r\n        <li>All password fields should be masked.</li>\r\n        <li>Accounts should be locked after multiple failed authentication attempts.</li>\r\n        <li>Authentication should be implemented on the server-side.</li>\r\n        <li>Authentication controls should be centralized.</li>\r\n        <li>Authentication controls should fail securely.</li>\r\n        <li>Strong authentication credentials (passwords) should be enforced.</li>\r\n        <li>Account management functions should be protected.</li>\r\n        <li>User credential (password) changing functions should be protected.</li>\r\n        <li>Re-authentication should be required for sensitive operations.</li>\r\n        <li>Authentication credentials (passwords) should expire.</li>\r\n        <li>Authentication events should be logged.</li>\r\n        <li>Passwords should be hashed and salted.</li>\r\n        <li>Authentication credentials (connection strings) for external resources should be protected.</li>\r\n        <li>Authentication with external services.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Consider using authentication controls provided by the framework.</strong>&nbsp;Most frameworks offer authentication controls. Since there are many frameworks supported by Scala, we cannot examine them all in depth here. However, most frameworks should have authentication controls that are worth considering and may be sufficient for your application requirements. Even if authentication controls provided by the framework are used, it may be a good idea to write your own wrapper classes to centralize the authentication controls and to simplify using them.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define authentication control APIs.</strong>&nbsp;Make the exposed APIs simple for developers to use. Define authentication APIs to satisfy all application requirements. Include functionality to authenticate with external services.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Implement and document authentication controls.</strong>&nbsp;It may be a good idea to write your own wrapper classes for authentication even if using controls provided by the framework or a third-party library. Implement and document authentication APIs to satisfy all application requirements.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use authentication controls in the application.</strong>&nbsp;Developers should use centralized authentication controls whenever authentication is necessary.</p>\r\n    </li>\r\n  </ol>\r\n  <br />"
        ]
      }
    ]
  }
}