{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "6bf51773-1961-41de-b3dd-0cd430d54505"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Deploy an IDS"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nDeploy an IDS or IPS.\r\n\r\n## Why ##\r\n\r\nAn Intrusion Detection System (IDS) or an Intrusion Prevention System (IPS) may detect an attack in real-time. The difference between an IDS and an IPS is that an IPS not only detects an attack but also takes some action.\r\n\r\n## How ##\r\n\r\nWhile there is a clear distinction between IDS and IPS in theory, there is very little difference in practice. An IDS or IPS can have broad definitions, but what you are interested in here is a rack-mount network device with a web administration interface and compatibility with the centralized log server. Good technical support is a strong plus. Use the following steps to deploy an IDS or IPS:\r\n\r\n1. **Install an IDS or IPS.** Deploy and configure an IDS or IPS solution by following the vendor's instructions. Some solutions come almost completely pre-configured while some solutions are installed by the vendor. The administration interface should be easy to understand for someone who is technically proficient. It is recommended to review all the options to be familiar with all the available capabilities.\r\n\r\n2. **Configure the IDS or IPS to monitor all traffic.** Configure the IDS or IPS to monitor all traffic in the cardholder data environment. In practice, this means installing the IDS or IPS in front of or behind the router in the cardholder data environment. If there is more than one router, more than one IDS or IPS may be required.\r\n\r\n3. **Configure the IDS or IPS using vendor instructions.** Configure the IDS or IPS by following the vendor's instructions for maximum protection. Print the vendor's manual for the IDS or IPS and attach it to the security documentation.\r\n\r\n4. **Respond to IDS/IPS alerts.** Configure the IDS or IPS to integrate with the centralized log server. Configure the IDS/IPS or the log server to alert the responsible staff in the event of a suspected compromise. The web administration interface should have a clear option to specify an e-mail address where you can send alerts. If the device only supports sending alerts to one address, it may be necessary to set up an e-mail alias to forward the alert to multiple recipients. Some devices may offer more options than e-mail to send notifications. Please note that e-mail can be used to send SMS to cell phones.\r\n"
        ]
      }
    ]
  }
}