{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "6c6f2433-222d-4568-8de6-9cbdd198dbc0"
        ],
        "Id_History": [
          "6c6f2433-222d-4568-8de6-9cbdd198dbc0,a6122e3c-4317-49fe-8294-aec4899dfa4c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use of Hard-coded Password"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "Use of Hard-coded Password"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "=Description\n\nApplications that use authentication need a method for storing passwords. One of the simplest ways to store passwords is to hard-code them into the application. This approach is not secure, because anyone with access to the application code is able to recover these passwords. Once an attacker has recovered the passwords, they can use them to authenticate with the application. \n\n=Impact\n\nOnce the attacker has obtained the hard-coded password, they can use it to access the application. Usually, administrative passwords are the ones that are hard-coded. In that case, the attacker gains full access to the application. The attacker might be able to leverage this access to take full control of the application server. \n\n=Countermeasures\n\nTo prevent this vulnerability, provide a secure admin interface that allows changing passwords, and store passwords securely. \n\nProvide a secure administrative interface that allows changing passwords:\n* [[00000000-0000-0000-0000-000000066326|Provide a Secure Administrative Interface that Allows Changing Passwords]]\n\nStore passwords securely:\n* [[00000000-0000-0000-0000-0000006adfa3|Store Passwords Securely]]\n\n=Application Check\n\nTo check for adequate protection against this vulnerability, ensure that a secure admin interface that allows changing passwords is provided, and that passwords are stored securely.\n\nA secure administrative interface that allows changing passwords is provided:\n* [[00000000-0000-0000-0000-00000018ecb4|A Secure Administrative Interface that Allows Changing Passwords Is Provided]]\n\nPasswords are stored securely:\n* [[00000000-0000-0000-0000-00000077a50c|Passwords Are Stored Securely]]"
        ]
      }
    ]
  }
}