{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "6ccf4b69-a4c0-4c08-a2ea-86e704c3ffc2"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Display Simple Error Messages"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nShow simple error messages that don't contain too much information. Write detailed information to log files.\r\n\r\n## Why ##\r\n\r\nError messages should be simple. This is necessary to prevent attackers from gathering sensitive information from them. Simple error messages also may be more user-friendly. Detailed error information should be written to protected log files, where it cannot be accessed by attackers.\r\n\r\n## How ##\r\n\r\nTo display simple error messages:\r\n\r\n1. **Identify all exception handlers and other error handling code.** Review application code to find all code that handles errors. One way is to search for keywords such as `try`, `catch`, and `throw`.\r\n2. **Log detailed error information.** Add code to exception handlers that collects information about the application state and records it in log files. Make sure log files are not exposed to unprivileged users. Be careful not to log sensitive information, such as passwords and other secrets in log entries.\r\n3. **Show simple error messages.** Be careful not to disclose sensitive information in error messages. One thing to watch out for is disclosing information implicitly by displaying different messages for different scenarios. For example, displaying a message \"The password is incorrect\" when the password does not match an existing user and displaying \"The username is incorrect\" when the username is not valid - this is an example of volunteering too much information; using this information an attacker may infer what usernames exist on the system and focus on attacking existing accounts, thus making his attacks more efficient. Display as little information as possible to let the user know that an error has taken place and that the situation is under control. If some user action is required to recover from the error or to prevent the error from taking place again, that information may be included in the error message. Write error messages with these considerations in mind. Add code to exception handlers that displays the simple error messages.\r\n"
        ]
      }
    ]
  }
}