{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "76edc0da-9971-4cf6-8a99-b192117fc070"
        ],
        "Id_History": [
          "76edc0da-9971-4cf6-8a99-b192117fc070,ab508c7e-4442-4efb-9f4e-2640d82d35cd,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Password Renewal Is Enforced"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Password Renewal Is Enforced"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n\r\n==What to Check For==\r\n\r\nEnsure your application enforces a password expiration policy.\r\n\r\n==Why==\r\n\r\nForcing users to renew their passwords reduces the risk of valid credentials becoming exposed. While this technique can prevent attackers from obtaining the valid credentials through the use of a Brute Force Attack or a Dictionary Attack, it can also reduce the business risk associated with any instances of discovered or leaked valid credentials.\r\n\r\n==How to Check==\r\n\r\nUse the following steps to ensure your application has a password expiry policy: \r\n\r\n# **Locate all authentication code.** Identify all authentication procedures throughout your application.\r\n# **Ensure that your application enforces password renewal.** Ensure that your application addresses the need for password renewal throughout the different stages of your application's development lifecycle:\r\n## **Requirements:** Check if your application provides a password policy. Ensure that the password policy provides requirements regarding the lifetime of passwords. For example, require that a password will expire after 45 days. Consult the Strong Passwords are Enforced checklist for information regarding additional password requirements. \r\n## **Design:** Check if all password renewal routines are positioned properly throughout your application's authentication routines. For instance, if a user's password is expired, your application's authentication routine should force the user to renew their password upon a successful logon. \r\n## **Implementation:** Check if all password renewal routines implement your application's password policy. \r\n\r\n==How to Fix==\r\n\r\nUse the following steps to force users to change their passwords:\r\n\r\n# **Define a password change policy.** Establish a maximum password age for your application's users. For example, require that users must change passwords every 60 days and privileged users must change passwords every 30 days. PCI DSS requirements state that a user's password must be renewed at most every 90 days and that the new password cannot be the same as the previous four.\r\n# **Design a password change mechanism.** Track the password age and prompt the user to change their password when the password expires. \r\n# **Enforce the password change policy.** Embed the change of password mechanism into the authentication routine. \r\n# **(Optional) Check against previous hashed passwords to verify that passwords are not being repeated.** One common password policy is to prevent users from using the same passwords repeatedly. To implement this, store the hashes of the previously used passwords and check the hashes of the new passwords against the stored ones."
        ]
      }
    ]
  }
}