{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "81c248f1-c217-469c-8d19-835bf65f26d7"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use Strong Session IDs"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Ruby"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- Ruby\r\n\r\n\r\n## What to Do ##\r\n\r\nUse strong session IDs (identifiers) of sufficient length and entropy to prevent brute force attacks against sensitive data.\r\n\r\n\r\n## Why ##\r\n\r\nUsing cryptographically-strong session IDs prevents attackers from easily guessing session identifiers and taking over user sessions. If an attacker hijacks the session, they can perform the same functions as the logged-in user. This will lead to a compromise of the user account, or the entire application if the user is an administrator.\r\n\r\n\r\n## When ##\r\n\r\nUse strong session identifiers when your application keeps session state and handles sensitive data.\r\n\r\n\r\n## How ##\r\n\r\nRuby uses strong session IDs by default. Make sure that your application uses the default settings or higher. If not, rewrite the application session state handling code to do so. Strong session IDs and session cookies will automatically be created.\r\n\r\nRuby creates a session ID which is a 32 byte long MD5 hash value. The default session id consists of the hash value of a random string generated by `secure_random`.\r\n\r\n1. **Find where session ID is generated in the application.** Search *app/controllers/sessions_controller* for:\r\n\r\n\t\tdef create\r\n\t\t  # ...\r\n\t\t  session[:current_user_id] = @user.id\r\n\t\t  # ...\r\n\t\tend\r\n\r\n2. **Determine the length of strong session ID used.** Check *backend/app/model/session* for the session ID length value:\r\n\r\n\t\tSESSION_ID_LENGTH = 32\r\n\r\n3. **Determine the cryptographic algorithm in use.** Locate and identify the function that produces a random string. This example from *actionpack/lib/action_dispatch/middleware/session/abstract_store* produces 16 random hex characters:\r\n\r\n\t\tdef generate_sid\r\n\t\t  sid = SecureRandom.hex(16)\r\n\t\t  sid.encode!(Encoding::UTF_8)\r\n\t\t  sid\r\n\t\tend\r\n\r\n4. **Rewrite code for strong session ID when necessary.** Rewrite the application if necessary to include missing code, or modify existing values as described above.\r\n\r\n5. **Rewrite helper or plugin code for strong session IDs.** If other authentication and session activities are in use, check the methods and helper to ensure a strong session ID is in use. The program logic may be different than described above. Modify code as necessary for a strong session ID.\r\n\r\n\r\n"
        ]
      }
    ]
  }
}