{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "82012789-0142-4aed-b702-7b1002756c8b"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Ability to Recover AWS Accounts Is Maintained"
        ],
        "Category": [
          "System Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##What to Check For##\r\n\r\nVerify that the ability to recover AWS accounts is maintained.\r\n\r\n\r\n##Why##\r\n\r\nThe primary AWS account has root permissions to all resources and services. If the account credentials are not handled in accordance with your security management policy, every object, including users' Identity and Management accounts are jeopardized. Sensitive information would also be at risk. If you use the AWS account rather than an IAM account for daily duties, the security risk level increases. If the root credentials are safely locked up, the risk for lost or stolen account credentials is substantially reduced, if not eliminated.\r\n\r\nISO27001:2013 requires the protection, management, and restriction of privileged accounts (A.9.2.3 and A.9.2.4).\r\n\r\nYour security management plan and/or administration policy should include a procedure for recovering access and regaining control in the event of account compromise. If this guidance is not followed, your account may become inaccessible for an extended duration. Note that some billing details (not credit card numbers) are accessible to an intruder. Unauthorized purchases of AWS services can be billed to your credit card by anyone who has access to your AWS account.\r\n\r\n\r\n##When##\r\n\r\nRecord the steps for account recovery in an administrator procedure after your AWS account is first opened.\r\n\r\n\r\n##How to Check##\r\n\r\nTo verify that the ability to recover AWS is maintained:\r\n\r\n1. **Identify the personnel responsible for maintaining the AWS accounts.** Find out who is responsible for the security of the AWS accounts and interview them.\r\n\r\n2. **Verify that procedures for recovering AWS accounts are in place.** Based on the interviews determine whether adequate procedures for recovering compromised AWS accounts are in place. The specific thing to check is whether there are plans for if the AWS accounts are hacked, the attackers change authentication credentials, and start downloading data and deleting everything.\r\n\r\n\r\n##How to Fix##\r\n\r\nThe following preventative steps should be taken as part of your AWS security posture.\r\n\r\n1. **Record the AWS account login name, password, and account number.** Store this information in an encrypted password utility or other location approved by your site security plan. Also store the credentials in a physical safe.\r\n\r\n2. **Open and use an Identity and Management (IAM) for yourself as an administrator with privileges you require to access resources and create other accounts.**\r\n\r\n3. **Do not generate access keys for your AWS account**. More secure methods exist to create certificates and secret credentials you require. Attach restrictive policy to these.\r\n\r\n4. **Turn on Multi-Function Authentication (MFA) for the AWS account login.**\r\n\r\n5. **Use CloudTrail security to capture information about logins for AWS account owner, IAM users, and federated users.** It is recommended to send SNS when the root account is used.\r\n\r\n6. **Use the AWS Trusted Advisor service.** This provides three important security checks: specific ports unrestricted, IAM use, and MFA on root account.\r\n\r\n7. **Allow your IAM admin account access to Billing & Cost Management.** Use the feature to receive billing alerts. Enable ongoing billing reports of AWS charges to be sent to a specific S3 bucket. \r\n\r\n8. **Use a credit card dedicated to AWS purchases.**\r\n\r\n9. **Sterilize code and perform a security review to make sure access keys are protected.**\r\n\r\nIf your AWS account credentials are compromised, perform these steps to regain access:\r\n\r\n1. **Notify AWS billing and support by filling out a support request.** Choose the option to be contacted by your mobile number.\r\n\r\n2. **Notify AWS technical support if you have a support plan.** Use web response or mobile response. They will be able to guide you through resource recovery steps.\r\n\r\n3. **Delete all access keys and re-generate when the account is secured.**\r\n\r\n4. **Stop all EC2 instances including spot bids.** You may need to go to multiple regions to identify all instances.\r\n\r\n5. **Check all AWS services for suspicious changes and shut them down.**\r\n\r\n6. **Report any problems with MFA.** \r\n\r\n7. **Be sure to complete any additional steps recommended by billing and/or technical support.**\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}