{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "8334addc-e920-4007-a1bc-114ccb147eec"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Remove Accounts of Terminated Employees"
        ],
        "Category": [
          "System Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##Applies To##\r\n\r\n- Amazon Web Services (AWS)\r\n\r\n\r\n##What to Do##\r\n\r\nDelete the AWS user account of terminated employees.\r\n\r\n\r\n##Why##\r\n\r\nRemoving a terminated employee's accounts eliminates the possibility that the accounts could be used to access sensitive data or protected information. If the accounts are not deleted, they could be used by the employee or other attackers. If the passwords are hacked or broken, intruders would gain entry to company networks, increasing the chance of theft and malicious behavior.\r\n\r\nYour security management plan should specify the revocation of access for all terminated employees. \r\n\r\n\r\n##When##\r\n\r\nTo prevent unauthorized access, user accounts and credentials should be revoked as soon as possible after the employee's departure. Other authentication such as tokens or fobs that are used in combination with the account must also be secured.\r\n\r\n\r\n##How##\r\n\r\nIAM user accounts may be deleted with the AWS Management Console or the AWS Command Line Interface (CLI).\r\n\r\n1. **Delete User Account with Console.** Sign in to your management console, and open the IAM console. Users are accessed through the link in the navigation panel. Locate the user account and select it. Take care not select multiple users. Choose the action to delete the user, and then confirm the deletion. The following user information is deleted along with the account:\r\n - User removed from membership in IAM groups\r\n - Password\r\n - Access keys belonging to user\r\n - Inline policies embedded in user. **Note.** Policies applied through group permissions are not affected. **Note.** Managed policies attached to are not deleted, but they are detached.\r\n - Multi-Factor Authentication (MFA) device associated with user.\r\n\r\n2. **Delete User Account with AWS CLI.** Use the AWS CLI to delete a user with the following commands. \r\n - Delete keys and certifications so that the user cannot access your AWS account. Use `aws iam delete-access-key` and `aws iam delete-signing-certificate` commands.\r\n - Delete password: `aws iam delete-login-profile`.\r\n - Deactivate user's MFA device: `aws iam deactivate-mfa-device`\r\n - Detach policies attached to user. List policies with `aws iam list-attached-user-policies` and detach policies with `aws iam detach-user-policy`.\r\n - List groups the user was in: `aws iam list-groups-for-user`.\r\n - Remove user from groups: `aws iam remove-user-from-group`.\r\n - Delete the user: `aws iam delete-user`.\r\n"
        ]
      }
    ]
  }
}