{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "85d0d2c5-2c49-4886-873d-368d0d138afa"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Protect Authentication Keys"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##What to Check For##\r\n\r\nVerify that traffic is restricted using network ACLs.\r\n\r\n##Why##\r\n\r\nNetwork ACLs provide an additional layer of protection to your security architecture. Network ACL rules provide a flexible tool that denies (or allows) traffic based on IP protocol, service port, and source/destination IP address. Since a network ACL is not instance specific, it provides an additional layer of control to your cloud, and allows for separation of duties.\r\n\r\nWithout network ACLs protecting your Virtual Private Cloud (VPC), its resources, including database instances, are subjected to a barrage of unwanted traffic. The attack surface is greatly reduced by a network ACL, meaning less time spent on mitigation efforts.\r\n\r\n\r\n##When##\r\n\r\nAs your cloud network grows in size and use, it will require changes in how traffic is restricted with network ACLs during the lifecycle.\r\n\r\n1. **Design and Testing.** Network ACLs are designed as an additional layer of security in your network architecture, and are written to enhance the security group rules. Access control must allow for development and testing, and applicable rules may need to become more restrictive at deployment.\r\n\r\n2. **Deployment** Network ACLs which are part of the deployment should be carefully groomed and modified to reflect the need for enhanced security while allowing controlled access for your applications.\r\n\r\n3. **Periodic Security Checks.** When periodic security monitoring identifies suspicious inbound traffic, you will also modify network ACLs and rules. This will mitigate further attempts at compromise.\r\n\r\n\r\n##How to Check##\r\n\r\nTo verify that traffic is restricted using networks ACLs:\r\n\r\n1. **Open VPC console.** Go to the [Amazon VPC console](console.aws.amazon.com/vpc/ \"AWS Security Best Practices\"). In the navigation pane, select Security > Network ACLs.\r\n\r\n2. **Review Properties.** Select a Network ACL in the top panel. In the bottom panel inspect the Summary, Inbound Rules, Outbound Rules, Subnet Associations, and Tags for existing network ACLs. Carefully plan any changes. Each ACL should be examined to fully understand its effect on traffic.\r\n\r\n\r\n##How to Fix##\r\n\r\nUse the following steps as a guide to restricting traffic with a network ACL. You can apply separation of duties to ACLs management and security group management.restricting traffic means adding or mod rule.\r\n\r\n1. **Open VPC console.** Go to the [Amazon VPC console](console.aws.amazon.com/vpc/ \"AWS Security Best Practices\"). In the navigation pane, select Security > Network ACLs.\r\n\r\n2. **Review Properties.** Select a Network ACL in the top panel. In the bottom panel inspect the Summary, Inbound Rules, Outbound Rules, Subnet Associations, and Tags for existing network ACLs. Carefully plan any changes. Each ACL should be examined to fully understand its effect on traffic.\r\n\r\n3. **Add Network ACL and Rule.** Create a new ACL or select an existing name. In the bottom panel you can edit the Inbound Rules by selecting a rule. Note that the Rule # determines the order of evaluation, lower numbers are evaluated first. If adding a rule use an appropriate number so that this new rule is handled before and/or after specific rules.\r\n\r\n4. **Restrict Traffic.** For example, you may need to allow SSH traffic to a cloud resource, but need to restrict that to an administrator's home network. In this case you would create a rule and assign a number higher than 100. The type would be SSH (22), and once selected, Protocol TCP (6) and Port Range 22 are filled in, with no editing possible. You must add the Source Range in a format such as 192.168.2.0/24. This would need to be supplied by the requesting administrator, and should be confirmed by authority. The default setting for Allow/Deny is Allow. Once saved, the rule is in effect for the VPC.\r\n\r\nFor additional examples and explanation of VPC console features, refer to the Network ACLs topic in the [Amazon Virtual Private Cloud User Guide](http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ \"Amazon VPC User Guide\").\r\n\r\nAll of the network ACL and rules functions can also be performed with a command line tool, such as:\r\n\r\n- AWS CLI\r\n- Amazon EC2 CLI\r\n- AWS Tools for Windows PowerShell. \r\n\r\nFor command details and use instructions, refer to the Accessing Amazon VPC topic in the [Amazon Virtual Private Cloud User Guide](http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ \"Amazon VPC User Guide\").\r\n\r\n\r\n##Additional Resources##\r\n\r\n- [Amazon Virtual Private Cloud User Guide](http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_ACLs.html \"Amazon VPC User Guide\")\r\n- [AWS Security Best Practices](http://aws.amazon.com/security/ \"AWS Security Best Practices\")\r\n\r\n\r\n"
        ]
      }
    ]
  }
}