{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "8e0be904-c17c-4fd4-a6c5-97d9dd545765"
        ],
        "Id_History": [
          "8e0be904-c17c-4fd4-a6c5-97d9dd545765,31e8239e-a700-4287-a2f5-505cddb1f7c9,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Install Patches"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Install Patches"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Any\r\n\r\n\r\n==What to Do==\r\n\r\nInstall the latest vendor-supplied security updates for all software and code libraries on the server at least once a month.\r\n\r\n\r\n==Why==\r\n\r\nInstalling vendor-supplied security patches fixes known security vulnerabilities.\r\n\r\n\r\n==When==\r\n\r\nThe latest vendor-supplied security patches should be installed within a month of being released.\r\n\r\n\r\n==How==\r\n\r\nPerform the following actions to install the latest security updates:\r\n\r\n# **Identify all software installed on the server(s).** Create  a spreadsheet of all software installed on each server. Record version information for each piece of software. If each server is different in purpose and configuration, it might be easiest to have a separate spreadsheet for each server. If there are multiple similar servers, it might be more effective to have a unified configuration standard and to maintain information about multiple servers in one spreadsheet. The important thing is to track all software installed on each server and to make sure that it is regularly updated. \r\n# **Identify all shared code libraries on the server.** Create a spreadsheet of all code libraries installed on each server, including ones that are used by your application. Record version information for each library. If these libraries contain vulnerabilities, the applications using them will also be vulnerable. So, it is important to update libraries when updating the server, and to track the libraries in a manner similar to tracking installed applications. This can be tedious, especially on UNIX-type systems, but it is necessary. Fortunately, on UNIX-type systems the process can usually be at least partially automated using scripts. \r\n# **Identify sources of updates, and whether updates are manual or automated.** For all the software and the libraries listed in your spreadsheets, record the distribution channel for security updates, and indicate whether the update is manual or automated.  The distribution source will frequently be a web site from which patches can be downloaded. Some systems have automatic update features that can be used. Automated update systems are acceptable so long as they are reliable and provide information that allows you to verify that systems have been updated. Most common enterprise Linux distributions contain acceptable automatic update systems. Windows systems also can perform automated updates, but usually only update some system components. Most production systems will contain some components that need to be updated manually. \r\n# **Schedule regular updates.** In your information security policy, add a requirement that critical new patches be installed at least once a month.  Specify a date or time period when updates should be installed. \r\n# **Install new security patches at least once a month.** Usually applying vendor-supplied patches means going to the vendor's web site, downloading the latest patches, and installing them, which is often a matter of running a packaged executable on the target host. The procedures for applying security updates vary by vendor, as vendors package their updates in different ways, such as compressed archives or source code patches. Please refer to your vendor's documentation or technical support for detailed instructions on installing their security updates. Note that a given update may include manual and automated portions. When the manual portion of the system update is performed, the results of the automated update should be verified to make sure that all the latest available patches have been installed by the automated update system.\r\n# **Track update and version information.** In the software and library spreadsheets, record information about the results of the updates and the latest installed versions.\r\n# **(Highly recommended) Keep track of recently disclosed vulnerabilities.** Monitor web sites that list recent exploits, vulnerabilities, and security updates. Some community web sites can provide the bulk of that information for common software products, but for software with small user bases, that information will usually come from the vendors. This type of information is very time-sensitive, so it needs to be checked at least once every three days. This can be a tedious and time-consuming process for someone that's not used to doing it already. This procedure must be carried out by someone who understands what they're looking at. If it is done right, this type of information can be very effective at preventing compromises. Conversely, the absence of such a process can lead to devastating results. \r\n\r\n\r\n==Additional Resources==\r\n\r\n* For information about recently released exploits and disclosed vulnerabilities, see http://packetstormsecurity.com\r\n* For information about recently released exploits, see http://exploit-db.com\r\n\r\n"
        ]
      }
    ]
  }
}