{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "8f9abcf2-db84-4e46-9be6-9d2b166315ad"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Protect Authentication Credentials in Transit"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Do==\r\n\r\nDo not send credentials via unencrypted connections. Use TLS when transmitting credentials.\r\n\r\n\r\n==Why==\r\n\r\nUsing TLS prevents the credentials from being sniffed or tampered with as they are transmitted over the network. TLS only provides assurance against tampering if valid certificates are used.\r\n\r\n\r\n==How==\r\n\r\nTo use TLS to protect authentication credentials in transit:\r\n\r\n# **Purchase a valid TLS certificate.** You may purchase a valid TLS key from VeriSign, Thawte, or your web hosting provider. Follow the vendor's instructions for purchasing the TLS certificate. The certificate is usually a .cer file. Make sure the certificate matches all domains used by the application.\r\n# **Identify authentication code.** Find the code that sends authentication credentials to the server for verification. Make a spreadsheet about all the code that sends authentication credentials over the network.\r\n# **Use TLS to protect authentication credentials in transit.** Modify all code that sends authentication credentials over the network to send these credentials only through sockets protected using TLS. Use valid certificates when opening TLS protected sockets."
        ]
      }
    ]
  }
}