{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "929510fc-e85d-4134-9c10-0899cfd472a6"
        ],
        "Library_Id": [
          "de693015-55c9-4328-bbc8-42db82ae8b7a"
        ],
        "Title": [
          "Administrative Controls"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          ""
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "Most software needs to be managed from a centralized and easy to use administrative panel. Whether this is done through a web interface or local piece of software, these tools are often the heart of an application’s management and are invaluable to functionality. This type of interface should be secured to prevent a security breach, as these controls may give attackers full reign over every part of the system. View this room to learn how administrative controls are properly secured and which functions should be included to provide proper management of an application.\n\n==Protect Administrative Controls==\n\nApplication administration requires higher privileges than the main application interface. Separating the two interfaces decreases the risk that a normal user will be able to escalate privileges to that of an administrator.\n\n* [[c4baaf97-8f95-41d7-817d-c1989e4ec0ae|Any]]\n\n==Allow Managing Cryptographic Keys==\n\nThe customer should have the ability to manage cryptographic keys to be able to change the keys as necessary. Being able to change the keys allows replacing the keys if any are compromised.\n\n* [[acb75dc8-06cd-4ba4-9ec7-dfe93eab567d|Any]]\n\n==Allow Changing Passwords==\n\nAny application that uses authentication should provide functionality to change passwords when necessary.  This is required to prevent account credentials from being compromised. If passwords are hard-coded or permanently stored in a database or file, they cannot be changed easily by the customer or another user.\n\n* [[00000000-0000-0000-0000-000000066326|Any]]\n\n[[bcbbe5c7-95c3-468d-9371-6eb42f9b93e6|Back to the Programming Best Practices Area]]"
        ]
      }
    ]
  }
}