{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "98305944-1914-48fa-84e8-13386901a023"
        ],
        "Library_Id": [
          "de693015-55c9-4328-bbc8-42db82ae8b7a"
        ],
        "Title": [
          "PCI DSS"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          ""
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "The Payment Card Industry Data Security Standard (PCI DSS) was created by a consortium of payment card companies and is overseen by the Payment Card Industry Security Standards Council. The latest PCI DSS contains twelve requirements that help companies better protect cardholder data. Review each requirement below to understand how the PCI DSS creates a comprehensive standard for protecting cardholders from credit card fraud.\n\n  * [[https://teammentor.net/teammentor#load:8df54fb2-431a-493f-b252-428e4db56881|PCI DSS Requirement 1]] - Public-facing web applications should be protected by a web application firewall, as they may prevent an attacker from successfully exploiting a vulnerability in a public-facing web application. Verify that the information security policy requires the firewall configuration to be reviewed at least every six months and ensure that the results of each scheduled review are included in the network documentation.\n  * [[https://teammentor.net/teammentor#load:39e8db79-5d68-4421-b989-2b2a2e960dec|PCI DSS Requirement 2]] - Network devices should not be using the manufacturer's default usernames and passwords for administration. The default usernames and passwords for network devices are publicly available. An attacker may be able to use the default authentication credentials to change the configurations of the network devices to an insecure state.\n  * [[https://teammentor.net/teammentor#load:215e12bf-7596-44f4-af6d-17f2fdcfeb8a|PCI DSS Requirement 3]] - Stored cardholder data should be protected using secure encryption methods, and guidelines should be in place to verify secure encryption procedures are followed. PCI DSS also dictates that information such as card PINs and verification codes should never be stored after a transaction is processed.\n  * [[https://teammentor.net/teammentor#load:ad75d6d9-5e0c-4211-b808-c341c504c367|PCI DSS Requirement 4]] - Any communication involving cardholder data sent over a public network should be securely encrypted. This includes verifying that connections are safe using trusted certificates and HTTPS, properly securing access points, and using an industry standard encryption protocol. \n  * [[https://teammentor.net/teamMentor#load:56621485-a63f-482a-86da-a756f82a3542|PCI DSS Requirement 5]] - Deploy and configure an anti-virus solution on all computer systems that are commonly affected by malware, as a properly configured anti-virus solution may stop large scale automated attacks. Anti-virus software should also be kept up to date. Anti-virus definitions and the anti-virus engine have to be updated frequently to be effective because malware threats evolve rapidly.\n  * [[https://teammentor.net/teamMentor#load:367ea3c3-da95-4373-b31d-3dace4023938|PCI DSS Requirement 6]] - Internal systems should follow security best practices while in development and after being deployed. Developers should be familiar with secure programming techniques, and should keep development and production environments separate. The information security policy in place should require best practices such as installing security patches and preventing production data from being used in testing. \n  * [[https://teammentor.net/teamMentor#load:c4fcada4-332c-4597-ac8d-942d891151a2|PCI DSS Requirement 7]] - An access control system should be implemented and it should cover all system components, enforce the data control policy and individual privileges, and have a default \"deny all\" setting. Access control privileges should be assigned based on job function. This should allow employees to perform their duties but prevent them from waging insider attacks.\n  * [[https://teammentor.net/teamMentor#load:1f8277e8-e79f-4031-936e-53e429cc11bf|PCI DSS Requirement 8]] - Each user with computer access should be assigned a unique identifier and systems should follow account and session best practices. This includes an in depth password policy, authentication for any secure resource, deactivation of accounts no longer in use, and session timeouts. Users should be educated on practices for best managing their accounts and credentials.\n  * [[https://teammentor.net/teamMentor#load:cc13accd-e316-4107-b3e0-9ec411ab5675|PCI DSS Requirement 9]] - Physical security standards should be in place to ensure that information storage media containing sensitive information cannot be easily accessed and physically stolen. Both digital media and paper hard copies should be covered by physical security policies, and be inventoried to keep track of the location and amount of items.\n  * [[https://teammentor.net/teamMentor#load:9788a357-788a-447b-99ba-5263a564933c|PCI DSS Requirement 10]] - Logging is a core principle of network security; within any company that processes payment information all user access to cardholder data should be logged. Best practices should also be followed, including logging access to logs, securing log files, and properly recording event times across servers. A centralized log server is recommended as it can significantly reduce the costs and complexity of satisfying the PCI DSS requirements and managing logs.\n  * [[https://teammentor.net/teamMentor#load:23e88124-b753-441f-a904-03882432e608|PCI DSS Requirement 11]] - Vulnerabilities and exploits are always evolving, and the nature of computer security requires regular tests of both hardware and software. Penetration tests and vulnerability scans should be run regularly, and the results should be documented to prove that they took place and to show what vulnerabilities may have already been found and fixed. A wireless analyzer should be deployed to detect unauthorized wireless devices on the network. Detection of such devices clearly indicates the presence of an attack.\n  * [[https://teammentor.net/teamMentor#load:5746c970-0f83-4915-a877-f65c759def8b|PCI DSS Requirement 12]] - A policy should be in place that defines information security responsibilities for both employees and contractors, and should be explicitly defined so that people can understand what is expected of them. The Information security policy should be PCI DSS compliant, meeting such requirements as being published to all relevant staff, addressing all PCI DSS requirements, requiring an annual risk assessment, and being regularly maintained. This policy should not only cover precautions, but also a well thought-out incident response plan for being able to respond to attacks in a timely and coordinated manner.\n\n[[1c4d0f72-c62f-40f4-9db5-d90da0846a0a|Back to the Standards Area]]"
        ]
      }
    ]
  }
}