{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "983726cb-b3a5-4e23-af5f-04d64e95a59f"
        ],
        "Id_History": [
          "983726cb-b3a5-4e23-af5f-04d64e95a59f,054d6170-5969-4c8a-b198-a7d1d2de43f2,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Perform Access Control Checks for All Access"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Perform Access Control Checks for Any Filesystem Access"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Do==\n\nPerform access control checks for all sensitive operations. Sensitive operations include any access to system resources, such as files, and any access to application data. Define the different types of users and create specific roles for them. When authorizing access to a resource, build the security checks on a per-role basis rather than on a per-user basis.\n\n==Why==\n\nApplication roles allow multiple users to play the same role, and provide a clear way to manage the least privileges necessary for the execution of a given task. This provides a more robust and flexible way of managing the application's users.\n\n==How==\n\nTo apply this concept, the security checks within an application should be executed against a user's role rather than against the actual user. Use the following steps when designing the role-based security:\n\n# **Understand the different types of users.** List the different types of users expected for the application. Define how they will use the application, which resources they will need to access, and any additional rules that will impact how access will vary. Create a matrix mapping roles to resources by describing what action the role can take with each system asset. Use this matrix to identify the different types of users according to the functionality they need.\n# **Establish the roles.** Define in code how each role can perform each operation. Add access control checks whenever a sensitive operation is performed.\n# **Manage the users.** Assign the users into their respective user roles. The application should apply the security policy according to the user roles instead of the actual user.\n# **Consider using additional context when making security decisions.** Simple examples include time of day and day of week. For instance, a given user may have no need to login to a system outside of the standard work hours, or even on the weekend. If that user attempts to login or perform some action in the middle of the weekend, it should not be allowed. Another example could be the user's physical location. If a user is expected to always use the system from their office in Chicago, but suddenly is connected in Eastern Europe, access should not be allowed.\n"
        ]
      }
    ]
  }
}