{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "99297f49-528b-4a25-bc35-3b82ef14404a"
        ],
        "Id_History": [
          "99297f49-528b-4a25-bc35-3b82ef14404a,34a67dff-f505-4a91-b82b-1d74492c130b,"
        ],
        "Library_Id": [
          "c037d0d2-0617-44f3-b846-21dc3d02c4f8"
        ],
        "Title": [
          "Harden the Server"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Harden the Server"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n* Any\r\n\r\n==What to Do==\r\nHarden your server(s). Reduce attack surface by removing unused software and disabling unnecessary features. Configure all the security-relevant settings to an acceptable standard. Prepare hardening guides for all servers. Limit user account privileges to the minimum necessary for job functions. Configure access control lists to limit access to the minimum necessary for job functions. Configure logging facilities to support centralized log monitoring.\r\n\r\n==Why==\r\nHarden your server(s) to reduce the potential for successful attacks and to limit exposure in the event of a successful attack.\r\n\r\n==How==\r\nTo harden your server(s):\r\n\r\n# ** Reduce the attack surface by removing unused software and disabling unnecessary features.** Create a spreadsheet of all the software and code libraries installed on each server. Determine whether each software package or library is necessary for the server to function properly. Remove those that are not necessary. For each software package that remains, examine all features that can be disabled, and disable the features that are not necessary for the server to work.\r\n# ** Prepare hardening guides for all servers.** Look up some hardening guides on the Internet to use as a foundation, or write your own guides from scratch. Document all the configuration settings required to set up each server, with an accent on security-sensitive features.\r\n# ** Configure all security-relevant settings to an acceptable standard.** Configure the settings on each server according to the defined configuration guides.\r\n# ** Disable unused accounts, and limit user account privileges to the minimum necessary for job functions.** Disable all unused user accounts. Reduce privileges of each user account to the minimum necessary for that account to be used for its intended purpose. Do this at the operating system level and for each application that manages user accounts.\r\n# ** Limit access to the minimum necessary for job functions.** Configure all access control lists to provide minimum access for the server to function properly. Do this at the operating system level and for each application that implements access controls.\r\n# **Set up centralized logging.** Make sure to configure all the logging options that can facilitate sending logs to a centralized server. If possible, install software that will send logs to a centralized log server. Review all the logging options available by applications and the operating system and configure them as appropriate for your environment.\r\n\r\n==Additional Resources==\r\n* For a centralized log monitoring solution, see http://www.ossec.net/\r\n"
        ]
      }
    ]
  }
}