{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "99e25582-fc50-4721-9a07-050ca26e3e66"
        ],
        "Id_History": [
          "99e25582-fc50-4721-9a07-050ca26e3e66,43f74735-5e85-4e26-a226-04c488cdcc9a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "The Application Is Partitioned into Public And Private Domains"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Application Is Partitioned into Public And Private Domains"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <p>Scala with Play Framework 2.1.0+<br /></p>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure that your application clearly defines the boundaries between its public and restricted (protected) resources.</p>\r\n  <h1>Why</h1>\r\n  <p>Defining a boundary between public and restricted content helps establish the check points that will allow access to the restricted content.</p>\r\n  <h1>How to Check</h1>\r\n  <span>To ensure your application is partitioned into public and restricted domains:</span>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Enumerate all web accessible resources. </strong>Identify the public resources and the <span>restricted</span> resources. Common <span>restricted</span> resources include but are not limited to:</p>\r\n      <ul>\r\n        <li>Resources that require authentication</li>\r\n        <li>Critical application resources</li>\r\n        <li>Sensitive/confidential data</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that restricted resources have the appropriate access controls.&nbsp;</strong>Determine if all <span>restricted</span> resources have the appropriate access controls assigned to them.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Check if there is separation on disk between public and restricted resources.&nbsp;</strong>Examine the local filesystem structure. Check if a restricted resource is located inside a public directory and vice versa.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify the local system permissions for all resources.&nbsp;</strong>For each resource, check that the local system permissions are set accordingly. If the resource is public, verify that anonymous users can access it. If the resource is restricted, verify that only authorized users can access it.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>To define the boundary between public and restricted content:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Determine roles.&nbsp;</strong>Define the various types of users and their rights. Build a security policy for the restricted content and base the user groups' privileges around it.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Define the boundary.&nbsp;</strong>Structure the content according to access and logical orders. Try to use a modular approach when establishing the boundary.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Separate on disk.&nbsp;</strong>Once the boundaries have been established, reflect these boundaries onto the local file system. Separate the restricted content from the public content on disk.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Set proper permissions.&nbsp;</strong>Set proper permissions to the restricted content. Dedicate a special directory for the restricted content and require valid access before accessing content within this directory. These permissions can be enforced at the application, server and operating system levels, depending on the environment in use.</p>\r\n    </li>\r\n  </ol>\r\n  <br />"
        ]
      }
    ]
  }
}