{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "9bdec757-76ad-4924-a18b-91ab7ec1e526"
        ],
        "Id_History": [
          "9bdec757-76ad-4924-a18b-91ab7ec1e526,7b32a0a8-b0e7-4daa-8a8c-c716db266e61,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Names of Uploaded Files Are Scrambled"
        ],
        "Category": [
          "Other"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Names of Uploaded Files Are Scrambled"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* ASP.NET\n\n==What to Check For==\n\nVerify that names and extensions of uploaded files are scrambled.\n\n==Why==\n\nScramble names and extensions of uploaded files to make it more difficult for attackers to upload and execute malicious code. Even if an attacker is able to upload a malicious script, changing its file extension should prevent it from being executed. Changing the name of the file should also make it more difficult for the attacker to create an HTTP request to access the malicious script.\n\n==How to Check==\n\nTo verify that names and extensions of uploaded files are scrambled:\n\n# **Find all code used to upload files.** Search your application for code that is used to upload files. Make a spreadsheet that enumerates all this code.\n# **Review code that is responsible for file uploads.** Examine code that is responsible for file uploads to make sure that it uses some technique to scramble file names and extensions.\n# **Test file uploads.** Make sure that authentication is required for uploading files by issuing HTTP upload requests directly to the script that is responsible for uploading files. Once it's clear that authentication is required for uploading, test the upload functionality using different user roles provided by the application. Check to make sure that the names and extensions of the uploaded files are scrambled.\n\n==How to Fix==\n\nTo scramble names and extensions of uploaded files:\n\n# **Find all code used to upload files.** Search your application for code that is used to upload files. Make a spreadsheet that enumerates all this code.\n# **Add code to maintain an uploaded file lookup table.** If the original file names need to be preserved, they should be stored in a lookup table, either in a database or in an XML file.\n# **Add code to access uploaded files indirectly.** For accessing the uploaded files, use a script to read the specified file and return its contents. This can be used to show uploaded images in the browser or for any other purpose where users need to access the uploaded files. Using a script to return the contents (rather than the web server processing the uploaded files as a result of direct requests) ensures that the uploaded files will not be executed as code.\n# **Change code to scramble file names.** Web servers execute application files as code based on file extensions. If a file has an extension that is defined as code in the server's configuration, it will be executed. Scrambling the file extensions, or even removing them completely, prevents execution. Scrambling the file names also makes it more difficult for the attacker to find the uploaded file(s) and thus makes it harder to create HTTP requests that access those files directly.\n\n"
        ]
      }
    ]
  }
}