{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "9cacd9c7-9d91-4448-ad63-dad44ae7b18e"
        ],
        "Id_History": [
          "9cacd9c7-9d91-4448-ad63-dad44ae7b18e,26455265-1813-43e5-88f8-6813b03c283f,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "The Length of XML Data Is Validated"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Length of XML Data Is Validated"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Java\n\n==What to Check For==\n\nMake sure that the length of XML data is validated before XML data is passed to the parser.\n\n==Why==\n\nValidate the length of XML data to prevent multiple types of XML denial-of-service attacks. Most types of XML denial-of-service attacks can either be prevented or mitigated by limiting the size of XML data that is passed to the parser.\n\n==How to Check==\n\nTo make sure that the length of XML data is validated before XML data is passed to the parser:\n\n# **Find all code that parses XML data.** Determine what XML parser your application uses. Search application code for all references to the XML parser. Make a spreadsheet about all the code that passes XML data to the parser.\n# **Make sure that the length of XML data is validated.** Examine the code that sends XML data to the parser. Make sure that the length of the XML data is checked to be less than the maximum reasonable amount before it is sent to the parser.\n\n==How to Fix==\n\nTo validate the length of XML data:\n\n# **Find all code that parses XML data.** Determine what XML parser your application uses. Search application code for all references to the XML parser. Make a spreadsheet about all the code that passes XML data to the parser.\n# **Determine valid lengths of XML data.** For each piece of code that passes XML data to the parser, determine what the maximum reasonable length of the XML data is. Record this information in the spreadsheet.\n# **Validate the length of XML data before parsing.** For each piece of code that passes XML data to the parser, add code that makes sure that the XML data does not exceed the length specified in the previous step of this guideline. If the XML data exceeds the maximum reasonable length, it should not be passed to the parser and an error condition should be triggered.\n"
        ]
      }
    ]
  }
}