{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "9da6b256-cc35-48a3-bb0d-8604b644abee"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Database Access Is Protected"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\r\n\r\nMake sure that users are not allowed to execute custom database queries.\r\n\r\n==Why==\r\n\r\nPrevent users from executing custom queries to prevent this feature from being abused to bypass access controls or use the database system in an unintended and malicious manner.\r\n\r\n==How to Check==\r\n\r\nTo verify that users are not allowed to execute custom database queries:\r\n\r\n# **Find code that executes database queries.** Make a spreadsheet of all the code that executes database queries.\r\n# **Identify code that allows users to execute custom queries.** Custom queries are those where the syntax of the query can be manipulated by the user, instead of just letting the user to change query parameters. Review all code that executes database queries to find features that allow users to execute custom queries. \r\n\r\n==How to Fix==\r\n\r\nTo prevent application's users from executing custom queries:\r\n\r\n# **Find code that executes database queries.** Make a spreadsheet of all the code that executes database queries.\r\n# **Identify code that allows users to execute custom queries.** Review all code that executes database queries to find features that allow users to execute custom queries. Custom queries are those where the syntax of the query can be manipulated by the user, instead of just letting the user to change query parameters.\r\n# **Remove code that allows users to execute custom queries.** If any code or features that allow users to manipulate database query syntax are present, remove them.\r\n"
        ]
      }
    ]
  }
}