{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "9eb67938-eff6-4eea-8bf3-ba630fba7943"
        ],
        "Id_History": [
          "9eb67938-eff6-4eea-8bf3-ba630fba7943,196f6848-3dd5-4ebd-8081-0132123fe32d,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Password Reset Tokens Are Sent over a Side Channel"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Password Reset Tokens Are Sent over a Side Channel"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET 4.0\r\n\r\n==What to Check For==\r\n\r\nVerify that password reset tokens are sent over a side channel.\r\n\r\n==Why==\r\n\r\nSend password reset tokens over a side channel to prevent an attacker from retrieving these tokens from the application and using them to take over user accounts.\r\n\r\n==How to Check==\r\n\r\nTo verify that password reset tokens are sent over a side channel:\r\n\r\n# **Trigger the password reset functionality.** Usually there is a link to the password reset function on the authentication page, called something like \"Did you forget your password?\".\r\n# **Verify that password reset tokens are sent over a side channel.** Go through the password reset process. Pay attention to the manner in which the password reset token arrives. The password recovery token should arrive through some other method than the application itself.\r\n\r\n==How to Fix==\r\n\r\nTo send password reset tokens over a side channel:\r\n\r\n# **Choose a side channel to use for password reset tokens.** Some common methods to send password recovery tokens are email and SMS.\r\n# **Associate contact information with user accounts.** Depending on the chosen side-channel, associate each user’s contact information with their user account. For example, if email is chosen as the side-channel, then associate email addresses with user accounts. One way to associate email addresses with user accounts is to store email addresses of the users in the same database as the usernames and password hashes.\r\n# **Verify user identity before sending password reset tokens.** To verify user identity, use a mechanism such as user-chosen questions with user-defined answers, or contact the user.\r\n# **Send password reset tokens over the side channel.** Add code that sends password recovery tokens using the chosen side-channel after verifying user identity.\r\n"
        ]
      }
    ]
  }
}