{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "a412fbe6-87cb-4830-a909-7d568df4a228"
        ],
        "Id_History": [
          "a412fbe6-87cb-4830-a909-7d568df4a228,bdc0bf10-2b8d-4922-bb4d-96b10dfcbece,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Send Authentication Credentials over Encrypted Tunnels"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Send Authentication Credentials over Encrypted Tunnels"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* C++\r\n\r\n==What to Do==\r\n\r\nSend authentication credentials over encrypted communication tunnels. Use TLS to send authentication credentials over the network, even the local network.\r\n\r\n==Why==\r\n\r\nUsing encrypted communication tunnels prevents the credentials from being sniffed or tampered with as they are transmitted over the network. TLS libraries are available for most mature development platforms and are ideal for protecting the authentication credentials in transit.\r\n\r\n==When==\r\n\r\nUse this guideline when your application sends authentication credentials over the network.\r\n\r\n==How==\r\n\r\nTo protect authentication credentials in transit:\r\n\r\n# **Identify authentication security requirements.** Make sure that your application actually does send authentication credentials over the network. For example, if the application authenticates against a local credential store, then there is no need for network tunnels. If credentials are sent over the network, then they need to be protected in transit and for most scenarios TLS will be suitable. When using TLS, some thought will have to be given to what certificates to use. It is highly recommended to use valid certificates, however it is possible to encrypt network traffic with self-signed certificates.\r\n# **Identify available communication security APIs.** Determine what libraries and APIs that implement TLS are available for your development platform. Because there are many different platforms and development environments that use C++, there are a lot of options. The platform-provided APIs should be the first choice. If these are not available, OpenSSL is a good alternative. \r\n# **Identify the network authentication mechanism.** Find the code that sends authentication credentials (usually hashes or keys) over the network.\r\n# **Encrypt authentication credentials in transit.** Use the chosen TLS APIs to encrypt the hashes or keys as they are transmitted over the network. Modify all the code that sends the credentials over the network to always use TLS for the task. When doing so, it is recommended to use valid certificates and check them with a certificate authority to help prevent man-in-the-middle attacks.\r\n"
        ]
      }
    ]
  }
}