{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "a5e2d592-1c01-499a-a109-7fe928cd0270"
        ],
        "Id_History": [
          "a5e2d592-1c01-499a-a109-7fe928cd0270,172019bd-2e47-49a0-8852-3e15eef3a23c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Centralize Input Validation"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Centralize Input Validation"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n* Server-side\r\n\r\n==What to Do==\r\n\r\nAll web applications need to validate their input, and this should be performed in a single centralized place, to ensure consistency.\r\n\r\n==Why==\r\n\r\nInconsistent application of input validation does not adequately prevent attacks.  Also, centralization ensures that as data formats change, validation standards change with them in a consistent manner.  Centralization will also reduce development effort and help with future maintenance.\r\n\r\n==When==\r\n\r\nAll systems should centralize their input validation.\r\n\r\n==How==\r\n\r\nGetting input validation correct is tricky; there's a reason that it's the number one security problem for web applications. However, when approached systematically, it's not too hard of a problem to solve. Follow these steps:\r\n\r\n# **Determine all inputs.** Identify all the inputs to your system, and what format they have.\r\n# **Determine all trusted data stores.** Identify all the places you pull data from that you can rely on to preserve data validity, and those whos output you need to validate.\r\n# **Determine all crossover points.** Find all the points where input might contaminate other data, and ensure that validation is performed before those points. \r\n# **Determine all outputs.** Find all the outputs from your system, and ensure that context-appropriate encoding is performed at those points.\r\n# **Centralize your validation.** Centralize all your validation code into a single module, and ensure that it's always used appropriately.\r\n# **Centralize your encoding.** Centralize all your encoding code into a single module, ensure it handles all your contexts, and that it's always used appropriately.\r\n# **Ensure all paths preserve validation.** Ensure that every path through the system keeps data in a valid form; watch out for round trips through the client or client-side validation.\r\n\r\nOne of the biggest dangers of implementing input validation is inconsistent validation; an attack may be caught on one data path, but not on another. An attacker will try all of them, however. The way to solve this problem is to have a single point of responsibility for input validation. Where this is depends on the design. If every piece of input is an object, then it may be appropriate to have the object constructs and setters perform the validation for that object's input. In a less strictly OO system, a single module with methods for each different input format may be more appropriate.\r\n\r\nWhich ever method is chosen, the input validation routine for a specific data type should be as strict as possible. For example, when validating a US zip code, allow either 5 or 9 numbers, and nothing else. If you're dealing with international postal codes, either validate them seperately with a looser format that also allows letters, or build a more complex validator that understands the postal codes of each nation, if you need to ensure a higher level of integrity."
        ]
      }
    ]
  }
}