{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "ab46d378-6ea6-4eb4-94d3-54307094c132"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Attack Vectors for Cloud Applications Have Been Identified"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nVerify that attack vectors for cloud applications have been identified.\r\n\r\n## Why ##\r\n\r\nAs part of the AWS shared security model, you must address security functions in order to manage, monitor, alert, audit and respond to incidents. To effectively carry out these responsibilities you must identify attack vectors in a security framework document.\r\n\r\nIn the cloud your responsibility is to securely manage running OS instances and applications, and protect data stores. As part of your security posture, maintain on-going awareness of info-sec, vulnerabilities, and threats.\r\n\r\n## When ##\r\n\r\nWhen running an application in the cloud, you are required to secure the application. A variety of infrastructure safeguards are provided by AWS. You must always provide additional protection, especially when your application works with sensitive information.\r\n\r\n## How to Check ##\r\n\r\nTo verify that attack vectors for cloud applications have been identified:\r\n\r\n1. **Identify responsible personnel.** Find and interview personnel responsible for threat modeling for cloud applications about attack vectors.\r\n\r\n2. **Examine documented attack vectors.** Examine documentation about the identified attack vectors and assess its quality.\r\n\r\n## How to Fix ##\r\n\r\nThe following activity provides a suggested method for exposing application security flaws so that you can achieve a secure posture. The products include a security frame with categories, vulnerabilities, threats and attack vectors. Security controls and incident response will benefit from this framework.\r\n\r\n1. **Define a security framework.** Select a security frame so that you can organize the application's vulnerabilities and threats. \r\n\r\n2. **Decide classification categories.** Common categories, such as input and data validation, sensitive data, and cryptography, can be reviewed for appropriate use with your web application.\r\n\r\n3. **Examine vulnerabilities.** In your security frame add vulnerabilities to each category. For example, the cryptography category has vulnerability to failure to secure keys, as well as insecure distribution of keys. For more information on common vulnerabilities, see \r\n\r\n4. **Use a threat model.**  Apply a threat risk modeling tool or method to survey the web application, decompose it, and identify vulnerabilities and threats. This will minimize the use of resources, and provide an efficient method to be used for identifying attack vectors.\r\n\r\n5. **Identify attack vectors.** Use the results of threat modeling to identify specific attack vectors for the application. Attack vectors may be associated with multiple threats. Once identified and integrated with your security frame, you can examine the controls and incidence response items which apply.\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}