{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "b0a8079f-fda0-46d9-bc3b-20ac08334e75"
        ],
        "Id_History": [
          "b0a8079f-fda0-46d9-bc3b-20ac08334e75,167ad56c-5ae0-44e3-8bab-b9c02bb105cc,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Path Traversal"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Vulnerability"
        ],
        "DirectLink": [
          "Path Traversal"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "=Description\n\nSome applications allow the user to choose what files to access. Some of these applications don't validate the selected file path sufficiently. This path traversal vulnerability allows an attacker to access files outside of the locations authorized by the application. Path traversal vulnerabilities typically affect web applications.  \n\n=Impact\n\nUsing path traversal, an attacker is able to access files outside of the scope allowed by the application. The attacker might then access sensitive operating system files, and application configuration files that include connection strings, application source code, and other sensitive data. The attacker will usually attempt to leverage information gathered using path traversal to take full control of the application or the application server. \n\n\n=Countermeasures=\nTo prevent this problem, canonicalize all file paths and name input, validate all input, and perform access control checks for all filesystem access.\n\n* [[35904d64-4c45-4798-81a0-d0f6c4d3ce96|Canonicalize All Input Used to Identify Resources]]\n\n* [[11a15f3a-7fe8-4e4c-be5e-309ab7227b3d|Validate All Input]]\n\n* [[a03f6c47-68e9-4c90-baeb-cae5b1e24fc4|Perform Access Control Checks for Any Filesystem Access]]\n\n* [[ae56baa8-dbdd-48e0-a570-8014adcef370|Use Reference Maps to Access Objects]]\n\n==Application Check=\nTo check for adequate protection against this vulnerability, ensure that all file path and name input is canonicalized, all input is validated, and access control checks are performed for all filesystem access.\n\n* [[ae56baa8-dbdd-48e0-a570-8014adcef370|All Input Used to Identify Resources Is Canonicalized]]\n\n* [[8d8c24b0-096b-43f4-9391-9b293313a0e8|All Input Is Validated]]\n\n* [[70a45962-ca20-4795-bd0c-032178332ece|Access Control Checks Are Performed for All Filesystem Access]]\n\n* [[b86589e0-1cba-4b09-8746-84d6db219e24|Reference Maps Are Used to Access Objects]]"
        ]
      }
    ]
  }
}