{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "b426664b-e894-4aae-89ec-578348b096f9"
        ],
        "Id_History": [
          "b426664b-e894-4aae-89ec-578348b096f9,eeb31a4d-5d7b-47cb-ba2a-e9a665b3fd81,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Verify User Identity when Resetting Passwords"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Verify User Identity when Resetting Passwords"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Do==\r\n\r\nVerify the user's identity before resetting a forgotten password.\r\n\r\n==Why==\r\n\r\nThe user's identity should be verified before resetting a forgotten password to ensure that an attacker is not pretending to be the user to gain access.\r\n\r\n==How==\r\n\r\nTo verify the user's identity before resetting a forgotten password:\r\n\r\n# **Choose one or more mechanisms to verify user identity.** Some common methods include asking user-chosen questions that have user-provided answers, and sending a code via e-mail or SMS.\r\n# **Associate identity verification information with user accounts.** When creating a user account, collect the information necessary to verify user identity and store it together with the rest of the account information. Provide a mechanism for the user to update this information as necessary.\r\n# **Identify code that resets a forgotten password.** Find the code in the application that is responsible for resetting passwords when users forget them.\r\n# **Add user identity verification to the password reset code.** In the code that resets forgotten passwords, add code that implements the identity verification mechanism. Make sure the code verifies user identity before it sends the password reset token. The password reset token should be sent over a side channel.\r\n\r\n==Additional Resources==\r\n\r\n* For more information about password reset security, see https://www.owasp.org/index.php/Forgot_Password_Cheat_Sheet\r\n"
        ]
      }
    ]
  }
}