{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "b86589e0-1cba-4b09-8746-84d6db219e24"
        ],
        "Id_History": [
          "b86589e0-1cba-4b09-8746-84d6db219e24,9293f18e-dcf0-477f-a505-9d75faaecc3b,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Reference Maps Are Used to Access Objects"
        ],
        "Category": [
          "File I/O"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Reference Maps Are Used to Access Objects"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* C++\r\n\r\n==What to Check For==\r\n\r\nVerify that reference maps are used to access objects.\r\n\r\n==Why==\r\n\r\nUse reference maps to prevent path manipulation vulnerabilities. If the application uses its own identifiers for objects when exposing them to the user, instead of filesystem paths, an attacker will not be able to manipulate the paths of the objects. While path manipulation refers almost exclusively to filesystem objects, the same technique of using aliases rather than operating system assigned names also works for other types of system resources, such as sockets.\r\n\r\n==How to Check==\r\n\r\nTo verify that reference maps are used to access objects:\r\n\r\n# **Identify objects that are being referenced.** Find all code that references system objects, especially files. Make a spreadsheet to track this code.\r\n# **Verify that reference maps are being used to access objects.** Examine the code that uses system objects to make sure that their system names are never exposed to the users. Make sure that every object name exposed to the user is an alias assigned by the application via a reference map.\r\n\r\n==How to Fix==\r\n\r\nTo use reference maps to access objects:\r\n\r\n# **Identify objects that are being referenced.** Find all code that exposes the operating system names of objects handled by the application, especially files. Make a spreadsheet to track this code.\r\n# **Define object reference maps.** Object reference maps are arrays or hashes of objects that are being referenced. The application exposes the index of the array or the key of the hash that matches the required resource, rather than exposing the object itself. This approach ensures that only objects in the array may be accessed. For this approach to work, reference maps should only include objects for which access is authorized. It is possible to use per-user or per-session object mappings. Per-user mappings define objects that may be accessed by each user. Per-session mappings define objects that may be accessed by each user for the current session. Per-session references may offer additional security or flexibility, but require more work. Mappings should be generated dynamically and that means that code has to be written that defines objects that may be accessed by each user.\r\n# **Use reference maps instead of direct object references.** Update all the code that references objects to use the reference maps.\r\n"
        ]
      }
    ]
  }
}