{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "b928e4bf-8dc9-4e64-bbec-ad642f375ab4"
        ],
        "Id_History": [
          "b928e4bf-8dc9-4e64-bbec-ad642f375ab4,d54791c7-8fda-49b5-a6e8-8a3fa573e02c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "How to Test for Network Credential Sniffing Bugs in Scala"
        ],
        "Category": [
          "Testing"
        ],
        "Phase": [
          "Test"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "How to Test for Network Credential Sniffing Bugs in Scala"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <p>Scala and Play Framework 2.1.0+<br /></p>\n  <h1>Summary</h1>\n  <p>Network credential sniffing attacks are network eavesdropping attacks where the attacker’s goal is to capture authentication packets in order to reveal data that might be used in an authentication scheme, such as username and password. Applications that don’t encrypt client credentials before transmitting them or&nbsp;don't secure the connection through which authentication occurs are vulnerable to this attack.</p>\n  <p>Follow these steps to test for network credential sniffing bugs in Scala:</p>\n  <ul>\n    <li>Step 1: Understand attack scenarios</li>\n    <li>Step 2: Analyze causes and countermeasures</li>\n    <li>Step 3: Execute test cases</li>\n  </ul>\n  <h1>Step 1: Understand Attack Scenarios</h1>\n  <p>A network credential sniffing attack starts when an attacker selects a victim client that authenticates with a Scala web application over the network via username and password. Next, the attacker eavesdrops on the network connection in order to monitor, or sniff, the authentication packets exchanged by the client and the application during login.&nbsp;The type of network eavesdropping attack depends on the attacker’s access to the target network as well as the type of target network (hub-based, switch-based, etc.). Network eavesdropping attacks include but are not limited to:</p>\n  <ul>\n    <li>Hub-based network attacks such as promiscuous mode sniffing.</li>\n    <li>Switch-based network attacks such as ARP poisoning or DHCP spoofing.</li>\n    <li>WLAN attacks, including attacks that require breaking a wireless key. <br /></li>\n    <li>Sniffing packets from the Internet, such as an attack on a BGP router.</li>\n  </ul>\n  <p>Note that a credential-sniffing attack is an extension of a network eavesdropping attack. Thus, the attack scenario described here as well as the test cases in the testing section will not go into detail about a network eavesdropping attack. <em></em></p>\n  <p>While eavesdropping on&nbsp;the client connection, the attacker uses a network monitoring tool to capture and read the authentication packets. If the application doesn’t properly encrypt the connection, the attacker retrieves the client’s credentials in clear text or in weak encryption that can be broken later.</p>\n  <p>In detail:</p>\n  <ol>\n    <li>The attacker selects a target client.</li>\n    <li>The attacker executes a network eavesdropping attack on the connection between the client and the Scala application.</li>\n    <li>The attacker uses a packet-monitoring tool to capture authentication packets.</li>\n    <li>If the application doesn't properly encrypt the connection, the attacker retrieves the client credentials in clear text or&nbsp;in weak encryption that can be broken later.</li>\n  </ol>\n  <h1>Step 2: Analyze Causes and Countermeasures</h1>\n  <p>Next, it is necessary to analyze what makes credential sniffing attacks possible and how to protect against them.&nbsp;&nbsp;</p>\n  <h2>\n    <em>Authentication Schemes</em>\n  </h2>\n  <p>There are different authentication schemes available to Scala web applications.</p>The common authentication schemes available are:<ul><li>Basic</li><li>Digest</li><li>Web forms</li><li>Authentication using a secure channel, such as SSL/TLS or IPSec</li></ul><p>Basic and digest authentication are prone to network credential sniffing, as these are weak authentication schemes:</p><ul><li>Basic authentication sends the password as a base-64 encoded value which can be easily decoded by attackers.&nbsp;&nbsp;Most Scala web applications won’t use this authentication scheme for remote clients; however, applications might choose to use basic authentication for local network users.</li><li>Digest authentication is more secure since it uses an MD5 hash with a nonce (number used once) to encrypt the password before sending it over the wire. Nonetheless, digest authentication is only secure if properly configured. It can fall victim to man-in-the-middle (MitM) attacks where an attacker intercepting authentication packages can tell the client to use Basic authentication or legacy digest authentication.&nbsp;&nbsp;&nbsp;&nbsp;</li></ul><p>Web applications can also implement authentication using common HTML web forms. Here developers must add the necessary code to the application to ask for the client’s username and password and send the request to the application once the form is submitted.&nbsp;The username and password will travel in clear text unless the application encrypts the password before sending it to the server, or the authentication packet is sent over a secure connection such as SSL/TLS.</p><p>Hence, to properly protect against network credential sniffing attacks, applications must perform authentication through a secure channel.&nbsp;This means that before any authentication packets are exchanged between the client and the server, the client and server must establish an encrypted channel based on public key encryption and digital certificates, like those used in SSL/TLS or HTTPS.</p><h2><em>Configuring Scala Authentication</em></h2><p>To avoid network credential sniffing attacks, Scala web applications must be configured to use HTTPS with SSL/TLS certificates, which&nbsp;depends on the web server used to host the application.</p><p>For instance, if a Scala application runs in an Apache Tomcat server, the&nbsp;<i>httpd.conf</i>&nbsp;file must be edited to support SSL.</p><p>Meanwhile, to set up Scala with Play, modify the appropriate configuration files.</p><h2><em>Protection at the Network Layer</em></h2><p>Network credential sniffing attacks are possible because attackers are able to eavesdrop on&nbsp;the connection between the target client and Scala applications.&nbsp;To mitigate the risk of eavesdropping attacks, network administrators can deploy security defenses at the network layer.&nbsp;For example, properly deploy and configure IPSec to prevent an attacker from eavesdropping on a connection.</p><p>To defend against promiscuous mode sniffing, administrators can execute tools that check for network interfaces running in promiscuous modes. Or, they can run a client application like Xarp to protect against ARP poisoning attacks in switched networks. <br /></p><h1>Step 3: Execute Test Cases</h1><p>Execute the following test cases to check if your application is vulnerable to network credential sniffing bugs.</p><h2><em>Test for Network Credential Sniffing</em></h2><p>To test for network credential sniffing in Scala applications.</p><ol><li>Select a target client.</li><li>Execute an eavesdropping attack between a client and Scala application. <br /></li><li>Use a network monitoring tool to check if credentials are transmitted in clear text.</li></ol><p>Expected results:&nbsp;The application is vulnerable if credentials are sent in clear text or&nbsp;via weak encryption.</p><h2><em>Test for Secure Transport Layer</em></h2><p>An additional test that is relevant to network credential sniffing testing is to check if authentication occurs over a secure transport layer such as SSL/TLS or HTTPS.&nbsp;In most cases, web browsers display a padlock (or any other comparable visual indicator) in the browser’s window if the connection is secure. However, there are cases where the lock doesn’t show, so the tester must monitor authentication packets to check if they are really going over HTTPs.</p><p>As proposed by OWASP, proper testing for a secure transport layer can be done by using an HTTP proxy tool to examine the URL of authentication requests [i]. To test for secure transport layer:</p><ol><li>Download and execute a HTTP proxy tool, such as OWASP’s WebScarab or Burp Proxy.</li><li>Open a web browser.</li><li>Set web browser’s connection options to use HTTP proxy.</li><li>Navigate to a&nbsp;Scala application login/authentication page.</li><li>In the HTTP proxy, turn intercept option ON.</li><li>In the web browser, enter username and password and make a request.</li><li>In the HTTP proxy, check if the authentication request’s URL is transmitted in plain text.</li></ol><p>Expected results: The application is vulnerable if the request URL is made over plain HTTP and not HTTPS.&nbsp;If the application uses plain HTTP, the authentication request’s URL will begin with&nbsp;<i>http</i><strong>:</strong></p><pre>POST <strong>http://www.example.com/login</strong> HTTP/1.1<br />Host: www.example.com<br />User-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; it; rv:1.8.1.14) Gecko/20080404<br />Accept: text/xml,application/xml,application/xhtml+xml,text/html<br />Accept-Language: it-it,it;q=0.8,en-us;q=0.5,en;q=0.3<br />Accept-Encoding: gzip,deflate<br />Accept-Charset: ISO-8859-1,utf-8;q=0.7,*;q=0.7<br />Keep-Alive: 300<br />Connection: keep-alive<br />Cookie: language=English; <br />Content-Type: application/x-www-form-urlencoded<br />Content-length: 27<br />&nbsp;<br />username=test&password=test</pre><p /><p>The application is secure if the request URL is over HTTPS.&nbsp;&nbsp;If the application uses HTTPS, the authentication request’s URL will begin with <i>https&nbsp;</i>and it will contain the network port used by HTTPS/SSL (<i>443</i>&nbsp;by default):</p><pre>POST <strong>https://www.example.com:443</strong>/login HTTP/1.1<br />Host: www.example.com<br />User-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; it; rv:1.8.1.14) Gecko/20080404<br />Accept: text/xml,application/xml,application/xhtml+xml,text/html<br />Accept-Language: it-it,it;q=0.8,en-us;q=0.5,en;q=0.3<br />Accept-Encoding: gzip,deflate<br />Accept-Charset: ISO-8859-1,utf-8;q=0.7,*;q=0.7<br />Keep-Alive: 300<br />Connection: keep-alive<br />Referer: https://www.example.com/login.jsp<br />Cookie: language=English; <br />Content-Type: application/x-www-form-urlencoded<br />Content-length: 27<br /><br />username=test&password=test<br /><br /></pre><div><hr /><div><p>[i]&nbsp;&nbsp;<b>Testing for Credentials Transport</b>. OWASP-AT-001.&nbsp;<a href=\"http://www.owasp.org/index.php/Testing_for_credentials_transport\">http://www.owasp.org/index.php/Testing_for_credentials_transport</a></p></div></div>"
        ]
      }
    ]
  }
}