{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "ba5a7df0-f96f-4f39-9429-fbd566d7fd6b"
        ],
        "Id_History": [
          "ba5a7df0-f96f-4f39-9429-fbd566d7fd6b,1576f6bb-cbac-491e-9b9b-ddc880c81662,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "WS-Routing Is Not Used"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "WS-Routing Is Not Used"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* ASP.NET 4.0\r\n\r\n==What to Check For==\r\n\r\nVerify that WS-Routing is not used.\r\n\r\n==Why==\r\n\r\nDon't use WS-Routing, because WS-Routing is vulnerable to routing detour attacks. The WS-Routing protocol doesn't have sufficient security features, so it should be avoided. \r\n\r\n==How to Check==\r\n\r\nTo check whether WS-Routing is used, ask developers whether the application actually uses WS-Routing, and review application code to find code that uses WS-Routing.  Search for keywords like \"WS-Routing\" and \"r:path\" to help find code that uses WS-Routing. \r\n\r\nIf WS-Routing is used, the code that uses it should be either removed or changed to use WS-Addressing instead.\r\n\r\n==How to Fix==\r\n\r\nTo avoid using WS-Routing:\r\n\r\n# **Find code that uses WS-Routing.** Ask developers whether the application actually uses WS-Routing. Review application code to find code that uses WS-Routing.\r\n# **Determine whether SOAP message routing functionality is needed.** Most real-life applications that use Web Services can be implemented without using SOAP message routing. Review application requirements to determine whether SOAP message routing is necessary.\r\n# **Remove or replace code that uses WS-Routing.** If SOAP message routing is not necessary, then remove the code that uses it. If SOAP message routing is necessary, rewrite code that uses WS-Routing to use WS-Addressing instead.\r\n"
        ]
      }
    ]
  }
}