{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "bae35739-4d3a-49d0-a5e8-735ff3629cd3"
        ],
        "Id_History": [
          "bae35739-4d3a-49d0-a5e8-735ff3629cd3,70787cc9-bd4a-4ac4-af50-867166c71cef,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Access Control Permissions Are Checked"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Access Control Permissions Are Checked"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n\r\n==What to Check For==\r\n\r\nVerify that access control permissions are checked whenever performing direct object references.\r\n\r\n==Why==\r\n\r\nUsing direct object references may expose sensitive data to attackers. Direct object references often expose sensitive data, such as files, database entries, or personal information. Direct object reference attacks are very simple to execute and have been used in high profile, low-skill attacks. Checking access control permissions whenever referencing objects helps prevent direct object reference vulnerabilities.\r\n\r\n==How to Check==\r\n\r\nTo verify that access control permissions are checked whenever referencing objects directly:\r\n\r\n# **Identify pages that use direct object references.** Make a list of all pages in the application. Go through the list and identify all pages that use direct object references by examining each page.\r\n# **Identify code that references objects.** For each page that uses direct object references, identify the code that references objects.\r\n# **Verify that access controls are checked.** Examine code that performs direct object references to make sure that it performs appropriate access control checks.\r\n\r\n==How to Fix==\r\n\r\nTo check access control permissions whenever performing direct object references:\r\n\r\n# **Identify pages that use direct object references.** Make a list of all pages in the application. Go through the list and identify all pages that use indirect object references by examining each page.\r\n# **Identify code that references objects.** For each page that uses indirect object references, identify the code that references objects.\r\n# **Check access controls.** Add code that performs access control checks to code that performs object references.\r\n"
        ]
      }
    ]
  }
}