{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "bed9c718-bac4-4808-8e27-6af33227a6f5"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Session IDs Are Protected"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nVerify that session IDs are protected.\r\n\r\n## Why ##\r\n\r\nProtecting session IDs helps protect user sessions from being hijacked.\r\n\r\n## How to Check ##\r\n\r\nTo verify that session IDs are protected:\r\n\r\n1. **Login to the web site.** Authenticate as a user to the web application.\r\n\r\n2. **Examine the session cookie.** Examine the cookies stored by the browser. Find the session cookie. Verify that it has the \"secure\" and \"HTTPOnly\" flags set.\r\n\r\n3. **Verify that session IDs are not disclosed.** Examine logs, error messages, and hyperlinks to make sure that session IDs are not disclosed in them.\r\n\r\n\r\n## How to Fix ##\r\n\r\nTo protect session IDs:\r\n\r\n1. **Store session IDs in cookies.** This is done automatically by virutally every web application platform. Make sure not to store the session IDs in any other user-accessible parameters.\r\n\r\n2. **Enable TLS.** TLS has to be enabled to protect session cookies from eavesdropping attacks. Please, refer to the documentation for your web platform for information about enabling and configuring TLS on your web server.\r\n\r\n3. **Set the \"Secure\" flag on session cookies.** Configure the platform to set the \"Secure\" flag on session cookies or do it programmatically whenever session cookies are created.\r\n\r\n4. **Set the \"HTTPOnly\" flag on session cookies.** Configure the platform to the set the \"HTTPOnly\" flag on session cookies or do it programmatically whenever session cookies are created.\r\n\r\n5. **Do not disclose session IDs.** Make sure that session IDs are not disclosed in URLs, logs, or error messages. Do not allow URL rewriting of session cookies."
        ]
      }
    ]
  }
}