{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "c0ae3ee0-9c0c-4302-a423-2b0440369048"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Perform Security Testing for Cloud Deployments"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- Amazon Web Services (AWS)\r\n\r\n\r\n## What to Do ##\r\n\r\nFollow a security assessment plan (SAP) to initiate, execute, and communicate the results of security testing for cloud deployment. Identify security architecture, instances and applications that will be tested for security function. Select methods, systems and tools and systems that will be used to perform the testing. Coordinate with the cloud service provider (CSP) to authorize testing. \r\n\r\n\r\n## Why ##\r\n\r\nSecurity testing for cloud deployments ensures the security posture is maintained at a safe level. Testing is required since the CSP provides protection from threats at lower levels, while the account holder must use additional measures to safeguard their applications and stores.\r\n\r\nWhen periodic security testing is performed, new findings are beneficial to the organization. Testing may reveal that controls in place are not 100% effective against newly discovered vulnerabilities in the deployment.\r\n\r\nSecurity testing also enables sharing of security best practices between the CSP, organization, and third party assessor organization (3PAO). This can help prevent future security issues.\r\n\r\nWhen systems are updated and/or re-configured, affected sub-components, processes, and custom software must be tested to ensure security controls are effective.\r\n\r\n\r\n## When ##\r\n\r\nNew vulnerabilities are being discovered continually by malicious individuals and researchers. Your security assessment plan should include details about the period and frequency for testing of controls.\r\n\r\n\r\n## How ##\r\n\r\nSecurity testing is part of a security assessment plan, which can be broken down into these steps:\r\n\r\n1. **Scope the security testing.** Name the system that that is slated for testing and include the regions for components that will be tested. Describe the system and list IP addresses which will be affected. This can be obtained from the cloud service provider (CSP). IP addresses can be listed by network ranges and CIDR blocks. Insert URLs and the associated login IDs that will be used for testing. Also record the function of the resource under test. Also include databases with the same information. List roles, functions, and restrictions that will be tested.\r\n\r\n2. **State the testing assumptions.** These are default assumptions that are edited for each engagement. The CSP will provide resources such as documentation and administrators with system and infrastructure knowledge. If necessary, the CSP will provide credentials to authenticate to protective devices. The CSP should provide network access to vulnerability management services so that testing authority can see results. Upgrades and patches will not be done during testing.\r\n\r\n3. **Prepare testing methods.** Authorities, such as FedRAMP, can provide documented test methods and descriptions for testing security controls. Your security engineer can edit the tests as necessary to accommodate business rules.\r\n\r\n4. **Prepare test plan.** List the members of the test team and the role each member will play. Include basic contact information. Also list the CSP points of contact, when available, phone, etc. Describe any test tools to be used, including version, developer, and function. Include manual methods you may use, such as manual SQL injection. Include a simplified schedule for the overall plan and test milestones.\r\n\r\n5. **Disclose rules of engagement.** Rules of engagement (ROE) describes the notifications and disclosures between the account owner, 3PAO, and CSP. The ROE lists roles, test methods, functions to perform, and contact information if not supplied already.\r\n\r\n6. **Conduct security testing.** Security testing is initiated according to the schedule. All terms and conditions agreed to must be followed. This will minimize the risk exposure of tested systems. The following tests are typical for cloud deployments:\r\n\r\n - Port scans and network queries\r\n - Network sniffing, traffic monitoring, traffic analysis \r\n - Login attempt with account names with weak or guessed passwords\r\n - SQL injection and input parameter testing\r\n - Use of exploit code\r\n - Password cracking\r\n - Spoofing network traffic\r\n - Altering system configuration\r\n - Adding user accounts.\r\n\r\n7. **Compile and communicate security test results.** When testing has ended, the results are given to representative of the CSP, 3PAO, and organization's security engineer. Reports are sent out the prescribed number of days after testing has ended.\r\n"
        ]
      }
    ]
  }
}