{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "c5688313-0255-461c-a978-423596d182db"
        ],
        "Id_History": [
          "c5688313-0255-461c-a978-423596d182db,ca6613a5-f6c5-48f4-a89f-ca0bebeeb0a1,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "The Application Does Not Rely on Client-Side Validation"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "The Application Does Not Rely on Client-Side Validation"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies To</h1>\n  <p>Applications written using Scala and Play Framework 2.1.0+</p>\n  <h1>What to Check For</h1>\n  <p>Ensure that all input validation is performed on the server. Client-side validation should only be used for performance and usability reasons.</p>\n  <h1>Why</h1>\n  <p>Client-side validation is executed by the client and can be easily bypassed. Client side validation is a major design problem when it appears in web applications. It places trust in the browser, an entity that should never be trusted.</p>\n  <h1>How to Check</h1>\n  <p>Use the following steps to establish a validation strategy:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify all sources of input.&nbsp;</strong>An application can take input via various ways such as a web interface, database, file system or other software running on the server. During design, identify all potential sources of input to your application. Scour the source code to discover sources of input that may have been missed in the design. The most common sources are:</p>\n      <ul>\n        <li>URL based parameters</li>\n        <li>Form based parameters</li>\n        <li>Hidden fields</li>\n        <li>Cookies</li>\n        <li>HTTP headers (Host, accept types, www authentication, cache settings, encodings, etc)</li>\n        <li>Local filesystem</li>\n        <li>Database</li>\n        <li>Other services running on the system</li>\n        <li>JavaScript variables</li>\n        <li>File upload and attributes (filename, size, data, etc)</li>\n        <li>DNS results or host names</li>\n        <li>External component call return values (AJAX, etc)</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Identify validation routines.&nbsp;</strong>Each input source should have a server-side validation routine associated with it. Ideally the validation will occur as soon as the input reaches your application. Shared validation routines are better than creating many throughout the code base and may be located in a single component.</p>\n      <p>Validation may be identified by any of the following:</p>\n      <ul>\n        <li>Custom Scala Validator class</li>\n        <li>Regular expression use (<em>scala.util.matching.regex</em>)</li>\n        <li>Method names that contain&nbsp;<em>validate</em>&nbsp;or&nbsp;<em>validator</em></li>\n        <li>Client-side validation is often linked to events:<ul><li>onSubmit</li><li>onChange</li><li>onFocus</li><li>onBlur</li><li>onKeyDown/Press/Up</li></ul></li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Ensure validators run on the server.&nbsp;</strong>Validation routines should run on the server. Server-side validation guarantees that malformed input will be caught and discarded regardless of the state that the client is in. As an optional feature, validation can also be implemented client side in order to improve application performance and user experience.<br /><br />Server-side validation is done within the application code. Ideally, validation occurs immediately after canonicalization, and canonicalization should be done&nbsp;as soon as the input reaches your application. In web applications, look for application-supplied validators, such as a Custom Validator, to validate and constrain input after it is received from an input source, such as a Form&nbsp;parameter. Check for the use of regular expressions and&nbsp;<em>scala.util.matching.regex</em>, or the use of a validator that checks numeric ranges.</p>\n    </li>\n  </ol>\n  <h1>How to Fix</h1>\n  <p>Client-side validation should only be used to improve user experience,&nbsp;<b>never for security purposes</b>. Client-side validation can improve application performance by catching malformed input on the client<strike></strike>, thus saving a roundtrip to the server. However, client-side validation can be easily bypassed, and places trust in the browser, an entity that should never be trusted.<strike></strike>&nbsp;Always use server-side validation to protect your application from malicious attacks.</p>\n  <p>Use the following steps when developing validation for client-side input:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Never trust the browser.</strong>&nbsp;Because the browser is running on the user's machine, it can be fully controlled by the user. Therefore, any client-side validation code can be controlled and bypassed by an attacker.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Use JavaScript only to enhance your pages, but never for security.</strong>&nbsp;JavaScript is useful for enhancing your application's presentation. However, it has no mechanism to protect the integrity of its code. Do not rely on JavaScript to enforce security decisions.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Place a server-side validator for all input.&nbsp;</strong>Execute validation on the server side. Use the following steps to properly set the validation routines:</p>\n      <ul>\n        <li>\n          <p>\n            <strong>Identify input.</strong>&nbsp;Determine the data that is to be passed from the client to your application. Input can take the following forms on the client-side:&nbsp;<br /></p>\n          <ul>\n            <li>URL-based parameters</li>\n            <li>Form-based parameters</li>\n            <li>Hidden fields</li>\n            <li>Cookies</li>\n          </ul>\n        </li>\n        <li>\n          <p>\n            <strong>Understand the input.</strong>&nbsp;Understand the use and constraints associated with each input. Be clear how each input is used. Define the format and type of each input. Build a server-side validator for each format and type of expected input.</p>\n        </li>\n        <li>\n          <p>\n            <strong>Create a set of validators.</strong>&nbsp;Build a validator for each type of input. Place the set of validators on the server-side of your application. If there are validators on the client-side, make sure the same validators are implemented on the server-side as well. <br /></p>\n        </li>\n      </ul>\n      <p>Once developed, it is important to place the validation routines at your application's trust boundary. Because your application's trust boundary extends only to your application's process space, do not consider <font color=\"#ff0000\"></font>the user's browser to be within your application's trust boundary.</p>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}