{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "c6a1afb6-9b1f-417f-aa1d-270dc9e5dd62"
        ],
        "Id_History": [
          "c6a1afb6-9b1f-417f-aa1d-270dc9e5dd62,b192703a-7b79-41db-8b94-30bb798da608,"
        ],
        "Library_Id": [
          "7d2d0571-e542-45cd-9335-d7a0556c2bea"
        ],
        "Title": [
          "Ensure That Users Do Not Bypass Checks"
        ],
        "Category": [
          "Other"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Ensure That Users Do Not Bypass Checks"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n\r\n==What to Do==\r\n\r\nDo not pass sensitive data in query strings or Form fields. Consider using encrypted session identifiers and store the sensitive data in the session state store on the server.\r\n\r\n==Why==\r\n\r\nIf you pass sensitive data, such as session identifiers, using parameters such as query strings, a malicious client can easily bypass your server side checks with simple parameter manipulation.\r\n\r\n==When==\r\n\r\nWhen your application validates input parameters using query strings. \r\n\r\n==How==\r\n\r\nMake sure that users do not bypass your checks by manipulating parameters. URL parameters can be manipulated by end users through the browser address text box. For example, the URL {{{ http://www.<YourSite>/<YourApp>/sessionId=10 }}} has a value of 10 that can be changed to some random number to receive different output. Make sure that you check this in server-side code, not in client-side JavaScript, which can be disabled in the browser.\r\n\r\nPassing sensitive data, such as session identifiers, using parameters such as query strings is not recommended because there is no easy way to prevent the manipulation of data in query strings or form fields. Instead, consider using encrypted session identifiers and store the sensitive data in the session state store on the server.  "
        ]
      }
    ]
  }
}