{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "cb206b88-472f-4bed-b7ee-0a48dfca5309"
        ],
        "Library_Id": [
          "de693015-55c9-4328-bbc8-42db82ae8b7a"
        ],
        "Title": [
          "Concurrency"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          ""
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "Computers are never likely to be devoted to one application at a time, and often hundreds or even thousands of processes may be running at a given point. Concurrency involves ensuring that your application runs in a way that prevents other applications from interfering with its processes and that it gracefully shares resources. This includes proper management of temporary files and caches, while limiting the use of code that may stop the proper execution pipeline. View this room to better understand the techniques and code that can prevent your applications from interfering with other running processes.\r\n\r\n==Use Locks with Mutexes==\r\n\r\nUse locks with mutexes to take advantage of automatic unlocking for preventing deadlocks.\r\n\r\n* [[41b5df05-32be-44df-93b6-f3cb4117f676|C++]]\r\n\r\n==Use Semaphores Correctly==\r\n\r\nIf a semaphore becomes unbalanced it could either block system execution (too many acquires) or it could allow too many threads to access a resource (too many releases). Other reference counting mechanisms could cause other unexpected results such as memory leaks or release of interfaces before your code is done using them.\r\n\r\n* [[09603b85-0c14-493e-b611-c10b60e5c6a9|C++]]\r\n\r\n==Create Temporary Files Carefully==\r\n\r\nPlacing temporary files in locations where other programs and users may access them may result in multiple vulnerabilities, depending on exactly what the temporary files are used for.\r\n\r\n* [[f1d46ddd-8464-4ce0-9fae-22493ddbbe9e|C++]]\r\n\r\n[[bcbbe5c7-95c3-468d-9371-6eb42f9b93e6|Back to the Programming Best Practices Area]]"
        ]
      }
    ]
  }
}