{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "cb29dad2-e5bd-413c-9de9-c9f01fafcc9f"
        ],
        "Id_History": [
          "cb29dad2-e5bd-413c-9de9-c9f01fafcc9f,dc90747c-a1f4-45a3-994a-a03fc1ea179f,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "User Identity Is Verified when Resetting Passwords"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "User Identity Is Verified when Resetting Passwords"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* ASP.NET 4.0\n\n==What to Check For==\n\nMake sure that user identity is verified before resetting a forgotten password.\n\n==Why==\n\nThe user's identity should be verified before resetting a forgotten password to ensure that an attacker is not pretending to be the user to gain access.\n\n==How to Check==\n\nTo make sure that user identity is verified before resetting a forgotten password:\n\n# **Trigger password reset functionality.** Usually there is a link to the password reset function on the authentication page, called something like \"Did you forget your password?\".\n# **Make sure that user identity is verified before the password reset token is sent over a side-channel.** Go through the password reset process. Pay attention to the manner in which user identity is verified before the password reset token is sent. Make sure the information, token, and side channel that are used to verify user identity are not easily available to attackers. For example, it is not acceptable to ask people to verify their identities using information that can be looked up on social networks.\n\n==How to Fix==\n\nTo verify the user's identity before sending a password reset token over a side-channel:\n\n# **Choose one or more mechanisms to verify user identity.** Some common methods include asking user-chosen questions that have user-provided answers, and sending a code via e-mail or SMS.\n# **Associate identity verification information with user accounts.** When creating a user account, collect the information necessary to verify user identity and store it together with the rest of the account information. Provide a mechanism for the user to update this information as necessary.\n# **Identify code that resets a forgotten password.** Find the code in the application that is responsible for changing user passwords when users forget them.\n# **Add user identity verification to the password reset code.** In the code that resets forgotten passwords, add code that implements the identity verification mechanism. Make sure that the code verifies user identity before it sends the password reset token. The password reset token should be sent over a side channel.\n\n==Additional Resources==\n\n* For more information about password reset security, see https://www.owasp.org/index.php/Forgot_Password_Cheat_Sheet\n"
        ]
      }
    ]
  }
}