{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "cbb1376a-4950-4fbe-88f9-ac5fc1f8dd65"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Only Allow Trusted Hosts to Connect"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nUse white-lists to restrict network connections to trusted hosts only.\r\n\r\n## Why ##\r\n\r\nPreventing malicious systems from connecting prevents these malicious systems from carrying out attacks.\r\n\r\n## How ##\r\n\r\nTo use white-lists to restrict network connections to trusted hosts only:\r\n\r\n1. **Determine what is being protected.** Make a spreadsheet about each network-listening part of the application that might be susceptible to malicious network connections.\r\n\r\n2. **Identify trusted hosts.** For each identified network-listening part of the application that might be exposed, determine a limited white-list of hosts that are authorized to connect to it, if possible. Add the white-list of authorized hosts to the spreadsheet or state that this part of the application has to be exposed and why.\r\n\r\n3. **Identify mechanisms available for restricting network connections.** Find out what kind of firewall or other similar functionality is present that allows resricting access. For example, Unix-type systems have hosts.allow and hosts.deny files that allow restricting access to some services. There might be functionality that blocks untrusted connections in your application code or this might be performed by a firewall or some kind of a filtering network device. \r\n\r\n4. **Consider implementing connection validation.** If there are no practical mechanisms for restricting network connections already in place, consider implementing this control within your application. Instead of just validating by IPs, use certificates to validate hosts before allowing connections.\r\n\r\n5. **Restrict network connections using white-lists.** Use whatever mechanism for restricting network connections that is available to restrict access to network-listening resources to restrict access to allow only the trusted hosts as documented in the spreadsheet."
        ]
      }
    ]
  }
}