{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "cce01ba5-5d8a-49ad-851c-625122507180"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "ACLs of S3 Objects Are Configured"
        ],
        "Category": [
          "System Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nVerify that ACLs of S3 objects are configured.\r\n\r\n## Why ##\r\n\r\nWhen the ACL for an S3 object is properly configured, AWS accounts or groups you specify become grantees with permissions on the object. Amazon S3 verifies that object requests are permissible for these requesters. If the ACL is misconfigured, these requests will fail.\r\n\r\n## When ##\r\n\r\nWhen Amazon S3 creates a bucket or object at your request, a default ACL is also created for the account owner, who now owns the resource. The default ACL grants the account owner full control. This is shown in the sample bucket ACL. To allow other AWS accounts and groups access to this resource, the ACLs must be further configured. \r\n\r\nNote that ACLs are ***not used*** with your AWS Identity and Access Management (IAM) users. You cannot grant permissions with an ACL to your IAM users. For that purpose, use the IAM console to set permissions for the users. \r\n\r\n\r\n## How to Check ##\r\n\r\nTo verify that ACLs of S3 objects are configured:\r\n\r\n1. **Identify S3 objects.** Make a spreadsheet about all the S3 objects.\r\n\r\n2. **Examine ACLs of S3 objects.** Examine the ACLs for each S3 object and make sure that they are set to the least amount of privileges necessary to meet the application requirements.\r\n\r\n## How to Fix ##\r\n\r\nTo configure Amazon S3 ACLs with the simplest method, use the AWS Management Console. AWS SDK (for Java and .NET) and API methods and operations are introduced here for information purpose.\r\n\r\n### Use AWS Management Console ###\r\n\r\n1. **Login to Management Console.** Sign in to the AWS S3 Management Console. \r\n\r\n2. **Add Permissions.** Select the target bucket or object in the left pane. Access the properties and view permissions already set. Add more permissions to this ACL, and use a pre-defined group for the grantee, or type in an AWS canonical user name. Check the box to use appropriate permissions for the application. A checked box means the permission is in effect. Note that the labels on the console screen relate to actual ACL permission names as follows:\r\n - List (READ) \r\n - Upload/Delete (WRITE)\r\n - View Permissions (READ_ACP)\r\n - Edit Permissions (WRITE_ACP).\r\n\r\n3. **Change Permissions.** To change permissions, scroll through the rows of permissions that have been established for the application. Select or de-select each permission as required, and apply the changes.\r\n\r\n### Use AWS SDK for Java ###\r\n\r\nWith AWS SDK for Java, you can create a resource and grant permissions programmatically. These functions are provided in code:\r\n\r\n - AccessControlList is added to a request.\r\n - Grantee and permissions are stated.\r\n - PutObject request specifies permissions to accounts and/or predefined groups (such as AllUsers).\r\n\r\n\r\n### Use AWS SDK for .NET ###\r\n\r\nThe AWS SDK for .NET can be used to change permissions on an existing resource with C#.\r\n\r\n - Call the AmazonS3Client.PutACL method.\r\n - Create an instance of S3AccessControlList class with a list of ACL grants.\r\n - Add new grants.\r\n - Send a PutACL request.\r\n\r\n\r\n### Use REST AP I###\r\n\r\nREST API support for configuring ACLs is available with the operations listed below. \r\n\r\n- GET Bucket acl\r\n- PUT Bucket acl\r\n- GET Object acl\r\n- PUT Object acl\r\n- PUT Object\r\n- PUT Bucket\r\n- PUT Object Copy\r\n- Initiate Multipart Upload\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}