{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "d3227451-5b97-4a07-b5dc-39297610d9b7"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Unused SQL Database Access Accounts Are Removed"
        ],
        "Category": [
          "System Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Check For ##\r\n\r\nVerify that unused SQL database access accounts are removed.\r\n\r\n## Why ##\r\n\r\nEach SQL access account increases the attack surface of your application. Unused accounts can be exploited by an attacker as a means of entry. Remove unused and unnecessary DB accounts and users to simplify security management. \r\n\r\nUnused accounts are susceptible to brute force attacks, and the DB can be compromised. The AWS security model defines customer responsibilities for database access *within* your cloud service.\r\n\r\n\r\n## When ##\r\n\r\nAlways enumerate SQL DB accounts and their use for design and deployment, so that their status can be audited at intervals specified in your security management plan.\r\n\r\nRemove unused SQL accounts at these milestones:\r\n\r\n1. **DB Created.** During installation of the DB instance, demo or sample database access accounts may be included. If not necessary, the accounts should be deleted. \r\n\r\n2. **DB Deployed.** Test accounts should be removed before deployment of the application.\r\n\r\n3. **Periodic Security Checks.** Remove unused SQL accounts when found during periodic security audits specified in your security management plan.\r\n\r\nExercise caution when removing SQL access accounts. If an account is currently using resources, or has an open session, the delete operation may produce an error. Be sure to confirm the use and status of any SQL account before removal. Do not remove system accounts.\r\n\r\n\r\n## How to Check ##\r\n\r\nTo verify that unused SQL database access accounts are removed:\r\n\r\n1. **Identify SQL database access accounts.** Make a spreadsheet about all the databases and accounts that can access them.\r\n\r\n2. **Examine each SQL database access account.** Review the spreadsheet about SQL accounts and make sure that all of them are being used. Unused accounts should be removed.\r\n\r\n\r\n## How to Fix ##\r\n\r\nTo remove unused SQL database access accounts, follow the instructions under the specific AWS database used.\r\n\r\n\r\n### MySQL 5.6 ###\r\n\r\n1. **Login with Privileges.** Open a terminal or command shell and log in as a database superuser. Enter the following command, and type in your password.\r\n\r\n        mysql -u <superuser_name> -p\r\n\r\n2. **Verify Account Exists.** Review the user listing, and confirm the database access account to be removed.\r\n\r\n        mysql> select host, user from mysql.user\r\n\r\n3. **Drop User.** Issue the command to drop the target user account. The syntax for *user* is `'user_name'@'localhost'`.\r\n\r\n        mysql> drop user <user_name>\r\n\r\n4. **Account Removed.** The account and privileges are removed after issuing the command. If there is an open user session, the account is dropped when the session is closed. Any future attempt to login with the account will fail. Note that databases and other objects created by the account are not deleted. Security errors may result if attempts are made to open these objects in *definer security context*. Refer to the MySQL Reference Manual for more information on reassigning object permissions.\r\n\r\n\r\n### Oracle 12c ###\r\n\r\n1. **Login with Privileges.** Open the command line tool SQL*Plus, and log in with an account that has the DROP USER system privilege. Enter the following commands.\r\n\r\n        sqlplus /nolog\r\n\r\n        connect / as sysdba\r\n\r\n2. **Verify Account Exists.** Review a user listing, and confirm the database access account to be removed. Note in the example that user names are case-sensitive.\r\n\r\n        SELECT * FROM ALL_USERS;\r\n\r\n        USERNAME\r\n        ********\r\n        TEST01\r\n        Test01\r\n        Test02\r\n        Test03\r\n\r\n3. **Drop User.** Issue the command to drop the target user account.\r\n\r\n        DROP  USER  <user_name>  CASCADE;\r\n\r\n4. **Account Removed.** The user account and associated schema are removed from the data dictionary. All schema objects in the user schema are also removed. Do not drop the SYS or SYSTEM user. This will corrupt the database.\r\n\r\n\r\n### Microsoft SQL Server 2008 R2 and 2012 ###\r\n\r\n1. **Login with Privileges.** Login to a management computer as a user with membership in Account Operators, Domain Admins, Enterprise Admins, or equivalent group. Open **SQL Server Management Studio**.\r\n\r\n2. **Verify Account Exists.** Review the database user list, and confirm the database access account to be removed.\r\n - Expand folders in the left pane until you see the folder for **Users** (SQL Server > Databases > Your_DB > Security > Users).\r\n - Select the **Users** folder to view the list of database users in the right pane.\r\n - Scroll the list of users until the DB user to be removed is found.\r\n\r\n3. **Delete User.** Right-click the user object and choose **Delete**.\r\n\r\n\t**Note**: If a schema is owned by this user, there will be an error message: **The database principal owns a schema in the database, and cannot be dropped (Microsoft SQL Server, Error: 15138)**.\r\n\r\n\tLook in the left pane and locate the **Schema** folder (SQL Server > Databases > Your_DB > Security > Schema). Scroll through the list and identify any schema owned by the database user you are trying to delete. When found, right-click on the schema name and change the owner to another user (Properties -> General -> Schema Owner).\r\n\r\n4. **Account Removed.** The database user is removed. If present, schema ownership was re-assigned.\r\n\r\n\t**Note**: The steps above remove the database user, but do not address management of a Windows or SQL Server login, if one has been mapped to this user. Refer to the Microsoft SQL Server Product Documentation for more information on login accounts.\r\n\r\n\r\n### PostgreSQL 9.4.1 ###\r\n\r\n1. **Login with Privileges.** Open a terminal or command shell and log in as a database superuser. The default superuser in the example is *postgres*. Enter the following command, and type in your password.\r\n\r\n        $ psql -U <superuser_name> <db_name>\r\n\r\n2. **Verify Account Exists.** Review the user listing, and confirm the database access account to be removed.\r\n\r\n        db_name=# select * from pg_shadow;\r\n\r\n3. **Drop User.** Issue the command to drop the target user account. In the example, on the second line, `DROP USER` is confirmation that the command has succeeded.\r\n\r\n        db_name=# DROP USER <user_name>;\r\n        DROP USER\r\n\r\n4. **Account Removed.** The account is removed after issuing the command. If there is an open user session, the account is dropped when the session is closed. Any future attempt to login with the account will fail. Note that databases and other objects created by the account are not deleted. If **ERROR: role \"user_name\" cannot be dropped because some objects depend on it** appears, the objects should be reassigned or dropped. Refer to the PostgreSQL Documentation for more information on dropping or reassigning objects.\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}