{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "d49a3b9e-bfd0-4f6f-a5b5-62bf0b49fb06"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encrypt Access to Cloud Resources"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##Applies To##\r\n\r\n- Amazon Web Services (AWS)\r\n\r\n\r\n##What to Do##\r\n\r\nUse Transport Layer Security (TLS) protocol or Virtual Private Network (VPN) instead of unencrypted connections for any application that uses AWS. TLS is good for most web service applications. VPN is only used for internal applications, while TLS is usually appropriate for cloud applications as well as internal applications.\r\n\r\n\r\n##Why##\r\n\r\nProtect web service connections using TLS to prevent man-in-the-middle attacks. In the AWS shared security model you are responsible for redirection to third party merchants, especially with regard to compliance with PCI-DSS.\r\n\r\nImplemented properly, TLS used with web applications secures HTTP communication over TLS, or HTTPS between the client and cloud services. The result is protection for online accounts, authentication credentials, and cookies.\r\n\r\n\r\n##When##\r\n\r\nEncrypted connections with TLS or VPN must always be used with web applications in order to protect sensitive information as it is transmitted over the network and is susceptible to theft and abuse.\r\n\r\n\r\n##How##\r\n\r\nTo use TLS to protect network connections follow these general steps:\r\n\r\n1. **Get valid certificates.** Purchase valid certificates for the application.\r\n\r\n2. **Use valid certificates.** Configure the server in the cloud to accept TLS connections. Do not permit unencrypted connections to the server. \r\n\r\n3. **Define communication security requirements.** Define which network communications need to be encrypted. All transmissions that include sensitive data, including authentication credentials and session tokens must be encrypted. In some cases, it might be practical to encrypt all network connections.\r\n\r\n4. **Identify communications performed by the application.** Review the application design to confirm all network communications performed by the application comply with security requirements.\r\n\r\n5. **Find all code that connects to the cloud.** Identify code that needs to send encrypted data over the network.\r\n\r\n6. **Add code that uses TLS.** There are multiple methods for using TLS, depending on application requirements. Use the method  that is most appropriate for your application.\r\n\r\n\r\n##Additional Resources##\r\n\r\n- [Amazon Web Services: Risk and Compliance](http://aws.amazon.com/compliance/aws-whitepapers/ \"Amazon Web Services: Risk and Compliance\")\r\n- [AWS Security Best Practices](http://aws.amazon.com/security/ \"AWS Security Best Practices\")\r\n- [On the Effective Prevention of TLS Man-In-The-Middle Attacks in Web Applications](https://www.usenix.org/system/files/conference/usenixsecurity14/sec14-paper-karapanos.pdf \"Prevention of TLS Man-In-The-Middle Attacks in Web Applications\")\r\n- [Payment Card Industry (PCI) Data Security Standard (DSS) - Requirements and Security Assessment Procedures](http://link.to \"PCI DSS Requirements and Security Assessment Procedures\")\r\n"
        ]
      }
    ]
  }
}