{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "d4d55f1d-9e76-4f8d-85a5-eabae93213c8"
        ],
        "Id_History": [
          "d4d55f1d-9e76-4f8d-85a5-eabae93213c8,70923510-51f8-4951-a8d9-536142355b06,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Rely on Client-Side Validation"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Rely on Client-Side Validation"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <p>Applications written using Scala and Play Framework 2.1.0+</p>\r\n  <h1>What to Do</h1>\r\n  <p>Do not rely on client-side validation for security purposes. Validate all input on the server side for length, range and type.</p>\r\n  <h1>Why</h1>\r\n  <p>\r\n    <font color=\"#ff0000\">\r\n      <font color=\"#000000\">Client-side validation should be used only to improve user experience,&nbsp;<b>never for security purposes</b>. Client-side validation can improve application performance by catching malformed input on the client, thus saving a round trip to the server. However, this type of validation can be easily bypassed, and places trust in the browser, an entity that should never be trusted. Always use server-side validation to protect your application from malicious attacks.</font>&nbsp;<br /></font>\r\n  </p>\r\n  <h1>When</h1>\r\n  <p>If your application accepts input from the client, always validate the input on the server for length, range, and type.&nbsp;</p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps when designing validation for client-side input:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Never trust the browser.</strong>&nbsp;Because the browser is running on the user's machine, it can be fully controlled by the user. Therefore, any client-side validation code can be controlled and bypassed by an attacker.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use JavaScript only to enhance your pages, but never for security.</strong>&nbsp;JavaScript is useful for enhancing your application's presentation. However, it has no mechanism to protect the integrity of its code. Do not rely on JavaScript to enforce security decisions.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Place a server-side validator for all input.&nbsp;</strong>Execute validation on the server side. Use the following steps to properly set the validation routines:</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Identify input.</strong>&nbsp;Determine the data that is to be passed from the client to your application. Input can take the following forms on the client-side:<br /></p>\r\n          <ul>\r\n            <li>URL-based parameters</li>\r\n            <li>Form-based parameters</li>\r\n            <li>Hidden fields</li>\r\n            <li>Cookies</li>\r\n          </ul>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Understand the input.</strong>&nbsp;Understand the use and constraints associated with each input. Be clear how each input is used. Define the format and type of each input.&nbsp;</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Create a set of validators.</strong>&nbsp;Build a validator for each type of input. Place the set of validators on the server-side of your application. If there are validators on the client-side, make sure the same validators are implemented on the server-side as well. <br /></p>\r\n        </li>\r\n      </ul>\r\n      <p>Once developed<font color=\"#ff0000\"></font>, it is important to place the validation routines at your application's trust boundary. Because your application's trust boundary extends only to your application's process space, do not consider the user's browser to be within your application's trust boundary.</p>\r\n    </li>\r\n  </ol>\r\n  <br />"
        ]
      }
    ]
  }
}