{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "d7baa268-7684-4f8f-a4e7-96d9a158e47c"
        ],
        "Id_History": [
          "d7baa268-7684-4f8f-a4e7-96d9a158e47c,b457e7ef-582c-492b-b630-4abc216eef6d,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "Canonicalize All File Path and Name Input"
        ],
        "Category": [
          "Canonicalization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Canonicalize All File Path and Name Input"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Java\r\n\r\n==What to Do==\r\n\r\nAvoid allowing the user to specify file names and/or paths. If such functionality is necessary, canonicalize all file paths and names obtained as input before making security decisions using getCanonicalPath().\r\n\r\n==Why==\r\n\r\nWhen input validation is applied to file paths and names, it only works properly when file paths and names are canonicalized. If file names and paths are not canonicalized before validation, a number of vulnerabilities may be introduced as a result. The possible vulnerabilities range from reading arbitrary files to uploading web shells. \r\n\r\n==How==\r\n\r\nTo canonicalize all file path and name input:\r\n\r\n# **Identify all file path and name input.** Examine the application and find all cases where the user may specify file names or paths.\r\n# **Find code that handles file path and name input.** Review application code and find all functions that handle user supplied file names or paths.\r\n# **Avoid file path and name input if possible.** If possible, remove or replace the code that allows users to enter file names or paths.\r\n# **Canonicalize file path and name input.** Examine each function that handles user supplied file names or paths. Re-write these functions as necessary to use getCanonicalPath() to canonicalize file names and paths.\r\n# **Validate file path and name input.** Examine each function that handles user supplied file names or paths. Re-write these functions as necessary to use positive validation on canonicalized file names and paths. Ensure that the validation routines validate that the user has sufficient rights to access the requested resource.\r\n\r\n==Additional Resources==\r\n\r\n* For more information about canonicalizing file paths in Java, see https://www.securecoding.cert.org/confluence/display/java/IDS02-J.+Canonicalize+path+names+before+validating+them\r\n"
        ]
      }
    ]
  }
}