{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "db068229-3634-4996-af23-4b04337e9653"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Limit Session Lifetime"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Ruby"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- Ruby\r\n\r\n\r\n## What to Do ##\r\n\r\nSet an absolute limit on sessions lifetime by including the `:expire_after` parameter in the *session_store* file.\r\n\r\n\r\n## Why ##\r\n\r\nEven when using TLS there is still a risk of session hijacking and replay attacks. There are other out-of-band ways to steal session tokens. The shorter the session limit, or session expiry, the less time an attacker has to capture a session cookie and use it to access your application.\r\n\r\nSession default behavior is to expire when the user closes the browser window or logs out. If the user does not log out, and leaves the browser window open, the session can be compromised by an attacker who keeps the session alive. Setting an absolute limit for the session is part of defense-in-depth, and helps to mitigate the amount of damage the attacker can perform.\r\n\r\n\r\n## When ##\r\n\r\nAll applications should consider the length of their sessions carefully. An application which handles any sensitive information should make session length as short as possible.\r\n\r\n\r\n## How ##\r\n\r\nTo set a default expiry time to limit session lifetime, follow these steps:\r\n\r\n1. **Find session code.** Find all instances in the application code where sessions are created. Check authentication and re-authentication activities for session hooks. Verify that standard configuration is in use.\r\n\r\n2. **Include `expire_after` in session configuration.** Edit *config/initializers/session_store.rb* to include a base session lifetime setting:\r\n\r\n\t\tYourApp::Application.config.session_store :cookie_store,\r\n\t\t  :expire_after => 30.minutes\r\n\r\n\r\n3. **Include `expire_after` in controllers.** If you need to set different expiration time in different controllers or actions, use the following code in action or some `before_filter`:\r\n\r\n\t\trequest.session_options = request.session_options.dup\r\n\t\trequest.session_options[:expire_after] = 15.minutes\r\n\t\trequest.session_options.freeze\r\n\r\n\r\n"
        ]
      }
    ]
  }
}