{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "e19e6c8e-f5e4-4607-8c71-34102dc2e760"
        ],
        "Id_History": [
          "e19e6c8e-f5e4-4607-8c71-34102dc2e760,83957fb1-2d65-48c0-9ec2-fd3b4511727c,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encryption Keys Are Protected"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Encryption Keys Are Protected"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Check For==\n\nVerify that encryption keys are protected.\n\n==Why==\n\nProtect the encryption keys to prevent attackers from being able to decrypt your encrypted data.\n\n==How to Check==\n\nTo verify that encryption keys are protected:\n\n# **Identify key management requirements.** Determine the key management requirements for your application. These might be defined by the application design and/or by compliance requirements.\n# **Identify the mechanism that is used to protect the encryption keys.** Find code that is responsible for key management in your application.\n# **Verify that encryption keys are protected.** Review code that is responsible for key management to make sure that it matches the requirements defined for the application.\n\n==How to Fix==\n\nTo protect the encryption keys:\n\n# **Use platform-provided key management if possible.** One of the major advantages of using platform-provided key management is that the key management issue is handled by the operating system. For example, if you are using the .NET framework, you can use DPAPI to handle key management. The key that DPAPI uses is derived from the password associated with the process account that calls the DPAPI functions. You can use DPAPI to pass the burden of key management to the operating system.\n# ** Cycle your keys periodically.** Generally, a static secret is more likely to be discovered over time. Design the application in a manner that facilitates regular changes of encryption keys and the corresponding re-encryption of all the sensitive data.\n"
        ]
      }
    ]
  }
}