{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "e3bab662-c94d-49fe-b1c0-d79c2fc397ba"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Excessive Sensitive Data in the Cloud Is Scrambled"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "AWS"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "##What to Check For##\r\n\r\nVerify that excessive sensitive data stored in the cloud is truncated and/or scrambled.\r\n\r\n##Why##\r\n\r\nStored sensitive data might be compromised if some other part of the application is compromised, so it is best to store as little sensitive data as possible. If a portion of sensitive data is sufficient to satisfy application requirements, then only a portion of the sensitive data should be used. For example, it is often sufficient to store the last four digits of the Social Security Number to verify user identity, so in such cases only the last four digits should be stored.\r\n\r\n\r\n##When##\r\n\r\nWhen working with sensitive account information such as a PAN or Social Security Number (SSN), you must programmatically scramble excessive data.\r\n\r\n\r\n##How to Check##\r\n\r\nTo verify that excessive sensitive data stored in the cloud is truncated and/or scrambled:\r\n\r\n1. **Identify all sensitive data.** Review the application for sensitive data that will be used by the application. For example:\r\n     - incoming transaction data\r\n     - all logs, such as transactions, history, debugging, and error\r\n     - history files\r\n     - trace files\r\n     - database schemas\r\n     - database contents.\r\n\r\n2. **Identify excessive sensitive data.** Determine from the list of sensitive data which types of data can be truncated while still being able to fulfill application requirements.\r\n\r\n3. **Analyze hashing requirement.** Determine whether hashing a portion of the sensitive data is appropriate. Hashing should only be used if data is going to be used for validation, but never recovered from the store.\r\n\r\n4. **Verify that excessive sensitive data is truncated and/or hashed.** Examine the data stores containing each type of sensitive data handled by the application. Pay particular attention to sensitive data that has been identified as excessive. Verify that such data is truncated to the minimum required by the application. If the application does not need to retrieve this data, verify that it is being stored as cryptographically strong hashes.\r\n\r\n\r\n##How to Fix##\r\n\r\n1. **Identify all sensitive data.** Review the application for sensitive data that will be used by the application. For example:\r\n     - incoming transaction data\r\n     - all logs, such as transactions, history, debugging, and error\r\n     - history files\r\n     - trace files\r\n     - database schemas\r\n     - database contents.\r\n\r\n2. **Identify excessive sensitive data.** Determine from the list of sensitive data which types of data can be truncated while still being able to fulfill application requirements.\r\n\r\n3. **Analyze hashing requirement.** Determine whether hashing a portion of the sensitive data is appropriate. Hashing should only be used if data is going to be used for validation, but never recovered from the store.\r\n\r\n4. **Add code to truncate.** Add code to truncate any excessive sensitive.\r\n\r\n5. **Hash stored sensitive data.** If sensitive data is only used for validation, add code to hash the partial stored sensitive data stored.\r\n\r\n\r\n##Additional Resources##\r\n\r\n- [Payment Card Industry (PCI) Data Security Standard (DSS) - Requirements and Security Assessment Procedures](https://www.pcisecuritystandards.org/security_standards/index.php \"PCI DSS Requirements and Security Assessment Procedures\")\r\n- [ISO/IEC 27001:2013 - Information technology - Security techniques - Information security management systems - Requirements](http://www.iso.org/iso/catalogue_detail?csnumber=54534 \"ISO/IEC 27001:2013 - Information Management Security Systems Requirements\")\r\n\r\n\r\n"
        ]
      }
    ]
  }
}