{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "e72235ce-c86f-481a-a8b0-d2d8ad59bb75"
        ],
        "Id_History": [
          "e72235ce-c86f-481a-a8b0-d2d8ad59bb75,40030b5a-8818-4395-8e07-9ce2e0cf1870,"
        ],
        "Library_Id": [
          "f215ceee-9a08-41d9-b2c1-bbcc058a8f32"
        ],
        "Title": [
          "Use the AccountManager Class to Invoke a Cloud-based Service"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Android"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use the AccountManager Class to Invoke a Cloud-based Service"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\n\n* Google Android applications authenticating to cloud-based services that support OAuth 2.\n\n==What to Do==\n\nInvoke the //AccountManager// class to retrieve an authentication token for access to a cloud-based service. Do not store user credentials such as accounts and passwords within your application.\n\n==Why==\n\nThe //AccountManager// class eliminates the need for users to enter credentials for your application when accessing a cloud-based service that supports OAuth2. By not requesting and storing user credentials, you limit the possibility of data disclosure should the device become lost, stolen, or compromised. This method also generates more user acceptance for the application since users require fewer accounts to be created and the credentials they do have such as passwords are not stored in multiple places.\n\n==When==\n\nWhen authenticating to a cloud-based service that supports OAuth 2.\n\n==How==\n\nLet’s use Google services as an example. To use OAuth 2 to access cloud services:\n\n# **Inform the user about accessing cloud services.** First, inform users that they are required to have an account for the cloud service (typically, having a Google account is not a problem on an Android device). Update the Android permissions in the manifest to include the following: //\"android.permission.GET_ACCOUNTS\"//, //\"android.permission.USE_CREDENTIALS\"//, //\"android.permission.INTERNET\"//. \n# **Ask the user to choose an account.** Next, ask users to select which account they want to interact with the service. Create a reference to the //AccountManager// class, and search for available Google accounts by calling //getAccountsByType(\"com.google\")//. This method returns an array of available Google accounts. If none are found, instruct users to create one. If multiple accounts are found, display them in a //ListView// and allow users to select which account should represent your application.\n# **Define a callback method.** Before using //getAuthToken()// to request a token for the account, you must define a callback, because this method is asynchronous. Create a class that implements //AccountManagerCallback <Bundle>//, and override the method //public void run(AccountManagerFuture arg0)//. In this method, insert logic for when the authentication fails and succeeds. If authentication fails, start an activity with an intent filter of //AccountManager.KEY_INTENT//. Doing so creates an interaction with the user to accept or deny use of the account. If authentication succeeds, use //bundle.getString(AccountManager.KEY_AUTHTOKEN)// to look at the returned bundle and capture the token.\n# **Request the OAuth 2 token.** Now, you are ready to request a token with a call to //getAuthToken()//. You need the account name the user selected, a string name for the activity scope for this account (which is displayed to users upon confirmation), a reference to the current activity, a reference to the callback class, and a reference to a handler for errors.\n# **Use the OAuth 2 token to authenticate.** With a token in hand, you can authenticate directly to the cloud service that supports OAuth 2. Note that each service login may be slightly different, but all should honor this token. In addition, for error handling, you can create a handler and manage error messages in the //handleMessage()// method.\n\nNote that expired tokens may require reauthentication. One method for avoiding this requirement is to call //invalidateAuthToken()// prior to invoking the //getAuthToken()// method.\n\n==Problem Example==\n\nAs the MyApp developer, you are using the Google App Engine cloud service to host an application. You want your Android application to interact with it, which requires that the app authenticate.\n\nYou try to invent your own authentication system. You create hashes for user passwords and account credentials, so you feel relatively safe. You use SHA-1:\n\n{{{\nMessageDigest digest;\ntry { \n  digest = MessageDigest.getInstance(\"SHA-1\");\n  digest.reset();\n  byte[] input;\n  input = digest.digest(password.getBytes(\"UTF-8\"));\n  return input;\n}\n}}}\n\nAlthough you are attempting to follow best practices, this approach presents several problems. First, you now have to think about password management, such as handling periodic changes and resets. You must also concern yourself with complexity requirements. Finally, SHA-1 is not as secure as other algorithms, and it is unlikely that most developers will understand the complexities of cryptography to select the right method.\n\nA far better approach is one that uses OAuth 2.\n\n==Solution Example==\n\nRecognizing that most users will have a Google account, you as the MyApp developer decide to use OAuth 2. You first update the Android manifest with the proper permissions:\n\n{{{\n<uses-permission android:name=\"android.permission.INTERNET\" />\n<uses-permission android:name=\"android.permission.GET_ACCOUNTS\"/>\n<uses-permission android:name=\"android.permission.USE_CREDENTIALS\" />\n}}}\n\nNext, you invoke the //AccountManager// in the activity’s //onCreate()// method, where the authentication is performed. You also search for all available Google accounts to have users select one:\n\n{{{\nprivate static AccountManager am;\nString token = new String(“”);\nfinal Activity ref = this;\n\npublic void onCreate(Bundle savedInstanceState) {\nam = AccountManager.get(this);\nAccount[] accounts = am.getAccountsByType(\"com.google\");\n}\n}}}\n\nYou display each account to users at the initial run in a //ListView//. After users select an account, this process will no longer be necessary, so you save the account in a SQLite database and create logic not to show the //ListView// again.\n\nWith user accounts now assigned to the application, you are ready to conduct the authentication. First, create the callback class that will handle receipt of the token:\n\n{{{\nprivate class GetAuthCallback implements AccountManagerCallback <Bundle> {\n@Override\npublic void run(AccountManagerFuture arg0) {\nBundle bundle;\ntry {\nBundle bundle = (Bundle) arg0.getResult();\nIntent launch = (Intent) bundle.get(AccountManager.KEY_INTENT);\nif (launch != null) {startActivityForResult(launch, 0);return; }\ntoken = bundle.getString(AccountManager.KEY_AUTHTOKEN); \n} catch (Exception e) {// Error handling}\n}\n};\n}}}\n\nThis class receives the callback from the asynchronous //getAuthToken()// method. If a user has already authenticated, the class stores the token in the global //String// field token. If the user must authenticate and accept the account, then an activity will be launched to confirm the user’s acceptance with the //AccountManager.KEY_INTENT// action filter.\n\nYou also create a simple handler for error messages. This handler logs errors to the Eclipse log facility:\n\n{{{\nHandler handler=new Handler()\n{\n@Override\npublic void handleMessage(Message msg)\n{\nLog.e(getClass().getSimpleName(), \"Error with auth\");\n}     \n};\n}}}\n\nYou are almost ready, but still need to handle the intent used in the //GetAuthCallback// method. Note that starting the activity for result with //AccountManager.KEY_INTENT// makes sense, as you need to know whether the user authenticated and accepted the account scope for this application. You do this in the //getActivityResult()// method:\n\n{{{\n@Override\nprotected void onActivityResult(int requestCode, int resultCode, Intent data) {\nif (resultCode == Activity.RESULT_OK) {\nam.getAuthToken (account, \"Manage your tasks\", null, this, new GetAuthCallback(), null);\n}\n}\n}}}\n\nNow, you are ready to request the token. Do so in a button’s //onClickListener.onClick(View v)// event, where you insert the following code:\n\n{{{\nam.getAuthToken(\naccount,                     //This is the account the user selected in the ListView\n\"Manage tasks\",            // Authentication scope\nnull,                        // Authenticator-specific options, \nref,                           // Activity reference\nnew GetAuthCallback(),          // Callback defined above\nhandler);    // Handler defined above\n}\n}}}\n\nThis code provides a token you can use to authenticate with App Engine. Follow the service’s authentication application programming interface from here. It often involves creating a cookie with the token, adding a secret code, and then attaching it to the URL."
        ]
      }
    ]
  }
}