{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "f40bd3e2-2f0c-4354-b46a-ea9b4f3831c7"
        ],
        "Id_History": [
          "f40bd3e2-2f0c-4354-b46a-ea9b4f3831c7,7038e07c-4c84-42b3-8589-6708e8b1b1af,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "All Output Data Is Encoded"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "All Output Data Is Encoded"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <p>Applications written using Scala and Play Framework 2.1.0+</p>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure that all echoed input is first encoded before reflecting on the output page.<font color=\"#ff0000\"><br /></font></p>\r\n  <font color=\"#ff0000\">\r\n  </font>\r\n  <h1>Why</h1>\r\n  <p>Encoding echoed input prevents injection attacks such as cross-site scripting.</p>\r\n  <h1>How to Check</h1>\r\n  <p>An application can take input via various&nbsp;sources, such as a web interface, database, file system or other software running on the server, and then use that same input in various outputs. Use the following steps to establish a validation strategy:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all sources of input.&nbsp;</strong>At design time identify all potential sources of input to your application. Once implemented, scour source code to discover sources of input that may have been missed in the design. Potential sources of input in a web application typically include:</p>\r\n      <ul>\r\n        <li>URL based parameters</li>\r\n        <li>Form based parameters</li>\r\n        <li>Hidden fields</li>\r\n        <li>Cookies</li>\r\n        <li>HTTP headers (Host, accept types, www authentication, cache settings, encodings, etc)</li>\r\n        <li>Local filesystem</li>\r\n        <li>Database</li>\r\n        <li>Other services running on the system</li>\r\n        <li>Javascript variables</li>\r\n        <li>File upload and attributes (filename, size, data, etc)</li>\r\n        <li>DNS results or host names</li>\r\n        <li>External component call return values (COM, AJAX, ActiveX)</li>\r\n      </ul>\r\n      <p>Once you&nbsp;have listed the sources of input your application&nbsp;can use, look for all entry points. Good starting points are method parameters and assignment statements. For example:</p>\r\n      <p>\r\n        <font face=\"Arial, Verdana\" size=\"2\">This method uses the&nbsp;<i>jobId</i>&nbsp;variable.</font>\r\n      </p>\r\n      <pre>def findJobDetail(jobId: String): Action[play.api.mvc.AnyContent] = Action { implicit request =&gt;\r\n    val job: Option[JobEntity] = Job.findJobDetail(new ObjectId(jobId))\r\n    job match {\r\n      case None =&gt; Results.Redirect(\"/errorPage\")\r\n      case Some(jobDetail: JobEntity) =&gt; Ok(views.html.jobDetail(jobDetail, request.session.get(\"userId\").getOrElse(\"\")))\r\n    }\r\n\r\n  }</pre>\r\n      <p>\r\n        <font face=\"Arial, Verdana\" size=\"2\">This assignment stores data from a&nbsp;</font>\r\n        <em>GET</em>\r\n        <font face=\"Arial, Verdana\" size=\"2\">&nbsp;request parameter named&nbsp;</font>\r\n        <font face=\"Arial, Verdana\">\r\n          <font size=\"2\">jobIds&nbsp;and stores it in the string&nbsp;</font>\r\n          <i style=\"font-size: small;\">jobId</i>\r\n          <font size=\"2\">. Ensure that this input is validated.</font>\r\n        </font>\r\n      </p>\r\n      <pre>String <span style=\"font-size: 10pt;\">jobId</span><span style=\"font-size: 10pt;\"> = request.params.get(\"<span style=\"font-size: 10pt;\">jobIds</span></span><span style=\"font-size: 10pt;\">\")</span></pre>\r\n      <p>\r\n        <font face=\"Arial, Verdana\" size=\"2\">This assignment uses the input that was gathered above to store more input from a database. Verify that&nbsp;<i>jobId</i>&nbsp;is validated before this use, and also ensure that&nbsp;</font>\r\n        <em>data</em>\r\n        <font face=\"Arial, Verdana\" size=\"2\">&nbsp;is validated as another source of input.</font>\r\n      </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Trace data from source to sink.&nbsp;</strong>Trace each source of input from the immediate source, through your application, to its final destination. The final sink may be in memory, on the hard drive, sent over the network or stored in a data store such as a database. Create a list of the input sources that are echoed back to the user through output - whether directly, through a file, in a URL or through a database or other intermediary source.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure input is properly encoded before being used as output</strong>. Ensure that you have encoded input from each of the input sources identified above before it is used as output. Select appropriate encoding based upon how the output is returned to the client. Verify the context in which the output is used and ensure it is properly encoded. A couple example contexts are shown below (URL, HTML entity):</p>\r\n      <ul>\r\n        <li>\r\n          <font face=\"Arial, Verdana\" size=\"2\">URL Encoding-&nbsp;<i>@helper.urlEncode(URL) ie&nbsp;&lt;a href=\"@helper.urlEncode(foo)\"&gt;my href is urlencoded&lt;/a&gt;</i></font>\r\n        </li>\r\n        <li>\r\n          <font face=\"Arial, Verdana\" size=\"2\">HTML Format Escaping-&nbsp;</font>\r\n          <i style=\"font-family: Arial, Verdana; font-size: small;\">&nbsp;HtmlFormat.escape(userparam)</i>\r\n        </li>\r\n        <li>HTML Entity Encoding&nbsp;</li>\r\n        <li>HTML Attribute Encoding</li>\r\n        <li>JavaScript Encoding</li>\r\n        <li>CSS Encoding</li>\r\n        <li>DOM Encoding</li>\r\n      </ul>\r\n      <p>Beware that certain locations may require a mixed encoding, such as initially performing URL encoding, then performing JavaScript encoding. This depends entirely on the output context wherein the data is used, and requires knowledge of the parsing mechanisms of browsers. Some example encodings are below.</p>\r\n      <p />\r\n      <font face=\"Arial, Verdana\" size=\"2\">User URL provided:</font>\r\n      <pre>http://server/form?x=<strong>\"&gt;&lt;SCRIPT&gt;alert('XSS');&lt;/SCRIPT&gt;</strong></pre>\r\n      <p>No encoding:</p>\r\n      <pre>&lt;form action=\"http://server/form?x=<strong>\"&gt;&lt;SCRIPT&gt;alert('XSS');&lt;/SCRIPT&gt;</strong>\"&gt;</pre>\r\n      <p>URL Encoding:</p>\r\n      <pre>&lt;form action=\"http://server/form%3Fx%3D<strong>%22%3E%3CSCRIPT%3Ealert%28%27XSS%27%29%3B%3C/SCRIPT%3E</strong>\"&gt;</pre>\r\n      <p>HTML Encoding:</p>\r\n      <pre>&lt;form action=\"http://server/form?x=<strong>\"&lt;&lt;SCRIPT&lt;alert('XSS');&lt;/SCRIPT&lt;</strong>\"&gt;</pre>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p>Use the following steps to ensure all echoed input is encoded:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all echoed input.&nbsp;</strong>Locate all places inside your application where user-supplied data will be returned to the client. Such data can be of a reflective or persistent nature:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Reflective</strong>: In a reflective setting, the input is immediately returned to the client. For example, search engines present the searched query when displaying the results.</li>\r\n        <li>\r\n          <strong>Persistent</strong>: In a persistent setting, the input is stored and returned to the client when retrieved from the database. For example, message boards store the users' posts inside a database and return them when a given topic is viewed.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Determine the&nbsp;type of encoding.&nbsp;</strong>After identifying all echoed input, determine how the input is returned to client. Data is said to be in an HTML context when that data is rendered as a part of an HTML document and is understood by the browser to be HTML. There are other contexts available to Web Applications, such as JavaScript context, CSS context, etc. Data is said to be in a JavaScript context when it is included in JavaScript code and is interpreted as JavaScript by the browser, and so on. Data has to be encoded differently for different contexts to prevent Cross-Site Scripting vulnerabilities. Differences in encoding arise from the fact that different contexts have different special symbols and keywords. Output encoding routines have to be designed with the understanding of the context of the output in mind.</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>URL encoding</strong>: URL encoding allows your application to maintain the original URL, yet display it to the user in a non-malicious way. Because HTTP headers allow a substitution schema, all characters/symbols are preserved by displaying their ASCII codes instead of the actual character/symbol. For example,&nbsp;<em>&lt;</em>&nbsp;is represented by&nbsp;<em>%3C</em>&nbsp;where&nbsp;<em>3C</em>&nbsp;is the ASCII value for&nbsp;<em>&lt;.</em></p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>HTML encoding</strong>: Use HTML encoding when the echoed input is returned as regular text or HTML content. Encode input by substituting certain characters with their respective HTML values:<br /></p>\r\n          <blockquote>\r\n            <table>\r\n              <tbody>\r\n                <tr>\r\n                  <td>Character</td>\r\n                  <td>HTML value</td>\r\n                </tr>\r\n                <tr>\r\n                  <td>&lt;</td>\r\n                  <td>&lt;</td>\r\n                </tr>\r\n                <tr>\r\n                  <td>&gt;</td>\r\n                  <td>&gt;</td>\r\n                </tr>\r\n                <tr>\r\n                  <td>&</td>\r\n                  <td>&</td>\r\n                </tr>\r\n                <tr>\r\n                  <td>\"</td>\r\n                  <td>\"</td>\r\n                </tr>\r\n                <tr>\r\n                  <td>'</td>\r\n                  <td>'</td>\r\n                </tr>\r\n              </tbody>\r\n            </table>\r\n          </blockquote>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>HTML attribute encoding</strong>: Use HTML attribute encoding to encode dynamic data that is output in an attribute of an HTML tag, except&nbsp;URL, CSS, and JavaScript event handler attributes.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>JavaScript encoding</strong>: Use JavaScript encoding to encode dynamic data that is output into the JavaScript context, including certain event handlers in HTML tags.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>CSS encoding</strong>: Use CSS encoding to encode dynamic data that is output into the CSS context.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>DOM Encoding</strong>: Use DOM encoding to encode dynamic data that is used in situations where the DOM is involved. These instances are more complicated and often involve multiple output contexts, which necessitates chaining in many circumstances.</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Apply the encoding.&nbsp;</strong>After you identify the echoed input and determine the appropriate encoding method, apply the encoding before the input is returned to the client. There are different encoding libraries available. Different libraries have different capabilities and weaknesses. Please, refer to the vendor's documentation for each potential encoding library.</p>\r\n    </li>\r\n  </ol>\r\n  <p />"
        ]
      }
    ]
  }
}