{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "f9d523ec-7328-4be5-93c6-00e671ecd068"
        ],
        "Id_History": [
          "f9d523ec-7328-4be5-93c6-00e671ecd068,8376d58f-5144-49bc-b779-9e572511e546,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Cache Sensitive Data"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Cache Sensitive Data"
        ],
        "Tag": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\nScala and Play Framework 2.1.0+\r\n\r\n\r\n## What to Do ##\r\n\r\nExercise caution when manipulating sensitive data, and do not cache the data on the client.\r\n\r\nNote: Applications employ caching to speed up performance and save round-trips to the server. This is especially useful in AJAX applications, which maintain a cached state on the client that mirrors that of the server. Developers traditionally try to cache as much data as possible. In these cases, there should be a distinction between the non-sensitive, i.e. cacheable data, and the sensitive data. The latter should be maintained in memory on the server only.\r\n\r\n\r\n## Why ##\r\n\r\nSensitive data that is cached on the client can cause significant problems:\r\n\r\n- Loss of synchronization with the server. The server's data might change and become inconsistent with the cached data. This is not a security risk but could cause issues with the application's performance.\r\n\r\n- The cache may reside on the client following the application's lifespan. Once the application is closed, the cache may be readable by an attacker, leaking sensitive information. This is especially serious in cases where the client is a non-trusted environment, such as a shared computer. Attackers may look up the \"Temporary Internet Files\" or corresponding browser cache and uncover useful fragments of information pertaining to the last logged on user.\r\n\r\n\r\n## When ##\r\n\r\nNever cache sensitive data on the client.\r\n\r\n\r\n## How ##\r\n\r\nJavascript variables and hidden input fields must not be used to store sensitive data, which may be rendered invalid. The only thing that may be stored on the client side across browser requests should be the Session ID. Session IDs are most often stored in an HTTP cookie, though other solutions exist.\r\n\r\nAutocomplete should be disabled for input fields that are used for sensitive information to prevent users' browsers from caching the information. To disable autocomplete, set the \"autocomplete\" attribute to \"off\". \r\n\r\nWeb pages containing sensitive data should be marked as such, using appropriate meta tags, to prevent caching. When generating/serving the web page, add the appropriate HTTP headers. This will serve as a guideline to proxies and browsers alike that the data must not be cached. A possibly negative impact of this is the invalidation of the browser \"back\" button.\r\n\r\nYour Global.scala class should look something like below:\r\n\r\n    import play.api._\r\n    import play.api.mvc._\r\n    import play.api.http.HeaderNames._\r\n\r\n    /**\r\n     * Global application settings.\r\n     */\r\n    object Global extends GlobalSettings {\r\n\r\n      /**\r\n       * Global action composition.\r\n       */\r\n      override def doFilter(action: EssentialAction): EssentialAction = EssentialAction { request =>\r\n        action.apply(request).map(_.withHeaders(\r\n          PRAGMA -> \"no-cache\"\r\n          Cache-Control -> \"no-cache\"\r\n          Expires -> \"-1\"\r\n        ))\r\n      }\r\n    }\r\n\r\n"
        ]
      }
    ]
  }
}