{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "fbb4cdda-8c2e-4099-8e57-e4a9c491775f"
        ],
        "Id_History": [
          "fbb4cdda-8c2e-4099-8e57-e4a9c491775f,fd4963c7-755f-456e-9bcf-e1756f5db8e9,"
        ],
        "Library_Id": [
          "d9c2b53f-5b05-4152-be72-e79d72854707"
        ],
        "Title": [
          "Re-authentication Is Enforced When Executing Critical Functionality"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Scala Play"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Re-authentication Is Enforced When Executing Critical Functionality"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <p>Scala and Play Framework 2.1.0+<br /></p>\r\n  <h1>What to Check For</h1>\r\n  <p>Ensure your application forces the user to re-authenticate when executing security-critical functionality including, but not limited to change of password, account modifications and critical transactions</p>\r\n  <h1>Why</h1>\r\n  <p>Forcing the user to re-authenticate verifies the user's decision to execute the given functionality and preserves the application's integrity in the event that a user's account has been compromised via session hijacking.</p>\r\n  <h1>How to Check</h1>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all critical functionality within your application.&nbsp;</strong>Locate all critical functionality within your application's code base. Common places to look include:</p>\r\n      <ul>\r\n        <li>Creating new accounts</li>\r\n        <li>Changing passwords for existing users</li>\r\n        <li>User transactions that are sensitive in nature</li>\r\n        <li>Changing your application's global configuration</li>\r\n        <li>Any operation affecting your application's overall wellness such as start-up and shutdown</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure that your application has adopted a&nbsp;re-authentication mechanism.&nbsp;</strong>Ensure that your application's design and requirements ask for re-authentication mechanisms. Common re-authentication mechanisms include:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Current password:</strong>&nbsp;The user uses their current password to confirm the identity. This technique ensures that the given user is aware of the action to be performed and holds responsibility for executing it.</li>\r\n        <li>\r\n          <strong>CAPTCHA:</strong>&nbsp;CAPTCHA is a mechanism where alpha-numeric codes are embedded into displayed pictures. Forcing the user to confirm the embedded code ensures that the application is interacting with a human. If your application uses CAPTCHA, ensure that your version of CAPTCHA is up-to-date with its security updates.</li>\r\n        <li>\r\n          <strong>2nd Factor:</strong>&nbsp;If your application supports a second factor of authentication such as a token, this could play a role in the re-authentication scheme.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that re-authentication is enforced.&nbsp;</strong>Ensure that the re-authentication procedures are positioned properly throughout your application's critical functionality. Verify that re-authentication is performed immediately upon entering a critical component. Example:</p>\r\n      <blockquote>\r\n        <pre>public boolean changePassword(String user, char[] oldPass, char[] newPass)<br />{<br />      // The application forces re-authentication<br />      if(!validateUser(user, oldPass))<br />      {<br />            return false;<br />      }<br />      // Logic to critical functionality<br /> }  </pre>\r\n      </blockquote>\r\n    </li>\r\n  </ol>\r\n  <h1>How to Fix</h1>\r\n  <p />\r\n  <p>Follow these steps when forcing re-authentication:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify critical functionality.</strong>&nbsp;Evaluate your application's design and requirements and determine what parts and resources of your application are very important to your organization's business model or your application's security architecture. This could include activities such as financial transactions or resetting user passwords.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Adopt re-authentication mechanism.</strong>&nbsp;Establish a mechanism that requires the user to verify their authenticity:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Current password.</strong>&nbsp;The user uses their current password to confirm the identity. This technique ensures that the given user is aware of the action to be performed and holds responsibility for executing it.</li>\r\n        <li>\r\n          <strong>CAPTCHA.</strong>&nbsp;CAPTCHA are mechanisms designed to ensure that a human, not an automated script, is using the system. Using a CAPTCHA should be seen as a way of augmenting a password in this kind of situation, not a way of replacing it. Many CAPTCHA systems embed distorted letters or numbers into displayed images which the user must enter. There are a number of problems with many CAPTCHA systems, so they should not be relied on too heavily. First, many graphical CAPTCHAs can be trivially broken by optical character recognition systems, and ensuring that a CAPTCHA is sufficiently strong to be useful without having too high of a failure rate for real users is difficult. If CAPTCHAs are reused, the attacker can simply record the session IDs of CAPTCHAs with known values and replay them. CAPTCHAs can also be broken by using a man-in-the-middle technique where the image is saved and forwarded to another site controlled by the attacker. An unsuspecting user of that site solves the CAPTCHA and the attacker forwards the answer to the victim site. CAPTCHAs also create accessibility problems for users, as blind and sometimes even color-blind individuals can find them impossible. If you choose to implement a CAPTCHA, be aware of the trade-offs involved and ensure that the system you use is appropriately protected against the attacks you expect to see.</li>\r\n        <li>\r\n          <strong>2nd Factor.</strong>&nbsp;If your application supports a second factor of authentication such as a token, this could play a role in the re-authentication scheme.<br /><br /></li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Enforce the re-authentication mechanism.</strong>&nbsp;Once the critical functionality is identified and the re-authentication mechanism is established, enforce the re-authentication mechanism before all security-critical actions.</li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following code allows a user to change their credentials. Unfortunately, the code enters the new credentials into the credentials repository without verifying that it is the actual user changing the credentials.</p>\r\n  <pre>\r\n    <pre>def changePassword(user:String user, oldPass: String, newPass:String){ implicit request =&gt;?</pre>{<br />       // The application fails to re-authenticate the user<br />       // Verify that new password meets password requirements<br />       // Update the credential store with the new password<br />}</pre>\r\n  <h1>Solution Example</h1>\r\n  <p>The following code allows a user to change their credentials. Before entering the new credentials into the credentials repository, the code verifies that it is the actual user doing the credentials change.</p>\r\n  <pre>def changePassword(user:String user, oldPass: String, newPass:String){ implicit request =&gt;?<br />{<br />      // The application forces re-authentication<br />      if(!validateUser(user, oldPass))<br />      {<br />            return false;<br />      }<br />      // Verify that new password meets password requirements<br />      // Update the credential store with the new password<br />}</pre>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>To read more about authentication best practices, see:&nbsp;<a href=\"http://www.owasp.org/index.php/Guide_to_Authentication\">Guide to Authentication</a>&nbsp;available from OWASP.</li>\r\n    <li>For more information on CAPTCHA, see:&nbsp;<a href=\"http://en.wikipedia.org/wiki/Captcha\">CAPTCHA</a>&nbsp;in Wikipedia and the&nbsp;<a href=\"http://www.captcha.net/\">official site</a>&nbsp;for CAPTCHA.</li>\r\n    <li>To learn more about the challenges of implementing CAPTCHA and the approaches to resolve them, see:&nbsp;<a href=\"http://www.pcmag.com/article2/0,4149,1306805,00.asp\">CAPTCHA-ing the Spammer</a>.</li>\r\n  </ul>\r\n  <p />"
        ]
      }
    ]
  }
}