{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "fc6d0605-1534-47d8-a8ce-92de545edc2f"
        ],
        "Id_History": [
          "fc6d0605-1534-47d8-a8ce-92de545edc2f,b84d6bce-e49d-4e17-9d81-895cd875d4bd,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Positive Input Validation Is Used"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Positive Input Validation Is Used"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Web Applications\r\n* Server-side\r\n\r\n==What to Check For==\r\n\r\nVerify that white-list/positive input validation is used to filter all user input.\r\n\r\n==Why==\r\n\r\nProperly implemented input validation is effective at preventing SQL Injection and Cross-Site Scripting vulnerabilities.\r\n\r\n==How to Check==\r\n\r\nTo verify that all user input is filtered using white-list input validation:\r\n\r\n# **Identify all entry points for user input.** Make a list of all possible sources of user input in your application, such as form fields, POST/GET parameters, cookies, etc. \r\n# **Identify all types on input accepted by the application.** For each source of user input on the list, define valid characters, length, format, and range (for numerical values).\r\n# **Identify the input validation subsystem.** Verify that validators exist for each type of user input accepted by the application. Make sure that each validator verifies the characters, length, format, and range (for numerical values) of the respective type of input.\r\n\r\n==How to Fix==\r\n\r\nTo validate all user input using white-list input validation:\r\n\r\n# **Identify all entry points for user input.** Make a list of all possible sources of user input in your application, such as form fields, POST/GET parameters, cookies, etc.\r\n# **Identify all types on input accepted by the application.** For each source of user input on the list, define valid characters, length, format, and range (for numerical values).\r\n# **Define an input validation subsystem.** Define a set of validator functions that should be used to validate each type of input handled by the application. Input should be validated on the server.\r\n# **Validate length.** Add code to check that the length of the user input is valid.\r\n# **Validate characters.** Restrict the acceptable range of characters in text input by using regular expressions.\r\n# **Validate format.** If the input type has a specific pattern, such as a date or a phone number, add code to use regular expressions to make sure user input matches the input type specified by the application. Use regular expressions to enforce strong password requirements.\r\n# **Validate range.** Restrict the acceptable range of numerical input by comparing the input to the maximum and minimum acceptable values.\r\n# **(Optional) Reject and respond to known bad input.** This step does not add much actual security, but it is included here to let you know that such an option exists. The input validation subsystem may check for known attack strings and respond to these likely attacks by doing things like logging detailed user information, alerting the administrator, blocking the user's IP address for some time, and displaying an error message to the attacker informing that you are onto him and reminding him of the consequences.\r\n# **(Optional) Encode input.** If the input is going to be displayed back through the web application, consider adding code to encode it to prevent Cross-Site Scripting attacks.\r\n"
        ]
      }
    ]
  }
}