{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "fc982309-5729-48a8-bbc3-804a331573e5"
        ],
        "Id_History": [
          "fc982309-5729-48a8-bbc3-804a331573e5,16e4e5e5-7e39-48e0-97eb-fcebc8b34355,"
        ],
        "Library_Id": [
          "e7d92b5b-e1d8-4039-b019-8b02594ea93a"
        ],
        "Title": [
          "Origin: Header in WebSocket Handshakes is Checked to Prevent Steath Attacks"
        ],
        "Category": [
          "WebSockets"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "HTML5"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Origin: Header in WebSocket Handshakes is Checked to Prevent Steath Attacks"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\nHTML5\r\n\r\n==What to Check For==\r\nDescribe what to check for in 1 to 3 sentences. Make clear to the reader what action they need to take in order to be in compliance.\\\\\r\n\r\n==Why==\r\nBy checking the origin, you can restrict access to the WebSocket server, allowing requests only from the same origin or specified domains to prevent potentially malicious connections.\r\n\r\n==How To Check==\r\nInsert discrete, numbered instructions for each step required to check this item.  Each step should be actionable.  Include all necessary information to successfully go through each step.\\\\\r\n\r\n==How To Fix==\r\nTo check for origin:\r\n\r\n# **Configure the WebSocket server to check the Sec-WebSocket-Origin header value (for older WebSocket clients) or Origin header value (for newer clients)**. Add code to the configuration file in accordance with your server language. For example, for PHP-WebSocket, which is an open source PHP implementation of a WebSocket server library, use the following method call to set origin checking: $server->setCheckOrigin(true);. This reads the value of Sec-WebSocket-Origin or origin.\r\n# **Specify the allowed origins from which the server will accept connections**. For example, to accept connections only from an HTML5 application residing on the same server, configure it to accept connections from the “same origin” only. If the WebSocket server and the application both reside on web.example.com, configure the WebSocket server to accept only from Origin= web.example.com.\r\n# **Iterate through the request headers to find the Origin or Sec-WebSocket-Origin header**. If the value is null or does not match the set of allowed origins, close the connection stream with a 401 response.\r\n\r\n{{{\r\n$example_origins = array('example.com',’web.example.com’);\r\n\r\nforeach ($example_origins as $origin) {\r\n    $server->setAllowedOrigin($origin);\r\n    $origin_ips[] = gethostbyname($origin);\r\n}\r\nif (!in_array($_SERVER[\"REMOTE_ADDR\"], $origin_ips)) {\r\n\r\n// send 401 response\r\n}\r\nelse {\r\n// begin tunnel\r\n}\r\n}}}\r\n\r\n\r\n==Related Items in TeamMentor==\r\nIf applicable, provide links in the form of a bullet list:\r\n*Provide a link to the Guideline that this Checklist Item applies to.\r\n*Provide links to related Checklist Item articles.\r\n*Provide links to other related TM Content.\\\\\r\n\\\\\r\n\r\n==Additional Resources==\r\nIf applicable, provide **trusted** links in the form of a bullet list:\r\n*Provide trusted trusted links to outside additional resources.\r\n*Specify relevant references.\\\\\r\n\\\\"
        ]
      }
    ]
  }
}