{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "fdb460e6-5d18-4e35-a093-4b260155d79e"
        ],
        "Id_History": [
          "fdb460e6-5d18-4e35-a093-4b260155d79e,02752a1a-23c3-4090-9401-5c1de8bf999a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Include Unique Tokens in HTTP Requests"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Include Unique Tokens in HTTP Requests"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==What to Do==\n\nWhen performing sensitive operations, include unique tokens in HTTP requests to prevent cross-site request forgery (CSRF).\n\n==Why==\n\nCSRF may occur when an attacker can form a URL which performs an action on behalf of an authenticated user. Forming such URLs becomes much more difficult if unique tokens are included in HTTP requests. Including difficult-to-predict tokens in HTTP requests is an effective defense against CSRF attacks.\n\n==How==\n\nTo include unique tokens in HTTP requests:\n\n# **Identify sensitive operations.** Review application design and code to identify all operations that require authorization.\n# **Identify code that performs sensitive operations.** Identify all pages that are involved in performing sensitive operations. This includes both the pages that link to sensitive operations and the code that actually carries out the sensitive operations.\n# **Choose a method for generating unique tokens.** There are different ways to generate unique tokens. One approach is to use the uniqid function combined with a hash based on current time.\n# **Add the unique token to the session.** On each page that links to sensitive operations, add code that generates unique tokens and stores them in session variables.\n# **Add unique tokens to HTTP requests.** On each page that links to sensitive operations, add code that sends the generated unique tokens in HTTP requests. One of the simplest ways to do this is to include the tokens in hidden fields in forms.\n# **Add token validation code.** On each page that carries out sensitive operations, add code that compares the tokens sent in HTTP requests to the tokens stored in session variables. This ensures that the tokens are generated by the server as a part of normal application workflow and therefore the requested action is being performed by a legitimate user.\n"
        ]
      }
    ]
  }
}