{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "fde8dc81-a0fa-4c99-8261-d585442ddb12"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Java Web Application Security"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          ""
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "Java web applications are most commonly affected by SQL Injection, Command Injection, Cross-Site Scripting and Cross-Site Request Forgery vulnerabilities. The following best practices help prevent these vulnerability types and a few other, less common classes of vulnerabilities.\n\n  * [[b531d29c-86f7-4812-90ce-5f3f0f780aba|Validate Input from All Sources]] - Input that is not validated can lead to cross-site scripting, SQL injection, directory traversals, and other vulnerabilities that could allow an attacker to gain unauthorized access to sensitive data.\n  * [[d2809cce-1af2-4896-a45c-b4b56deae282|Use Parameterized APIs for Data Access]] - Parameterized Queries mitigate the number one risk for database-facing Web applications: SQL injection.\n  * [[bcfcbcbb-4bd6-4011-9e24-efa70d4a3724|Parameterize Dynamic SQL in Stored Procedures]] - Using dynamic SQL in stored procedures to build queries that include user input may result in SQL injection vulnerabilities, unless user input is explicitly parameterized inside the stored procedures themselves. \n  * [[f83b953a-9b0c-406a-b274-9b2962d9c4e7|Encode All Output Data]] - Proper encoding of echoed input prevents injection attacks such as cross-site scripting.\n  * [[61b8ebc8-3ba5-4e75-aea8-94d6d3b3177e|Include Unique Tokens in HTTP Requests]] - Cross-Site Request Forgery (CSRF) may be possible when an attacker can form a URL, which performs an action on the behalf of an authenticated user. Forming such URLs becomes much more difficult, if unique tokens are included in HTTP requests. \n  * [[d7baa268-7684-4f8f-a4e7-96d9a158e47c|Canonicalize All File Path and Name Input]] - When input validation is applied to file paths and names, it only works properly when file paths and names are canonicalized. If file names and paths are not canonicalized before validation, a number of vulnerabilities may be introduced as a result. The possible vulnerabilities range from reading arbitrary files to uploading web shells.\n  * [[00000000-0000-0000-0000-00000088035f|Avoid Using External Commands]] - Applications often use external commands to carry out some functionality. This helps programmers save time by having to write less code. Calling external commands is dangerous, as it creates the risk of introducing command injection vulnerabilities in your application. Command injection vulnerabilities allow attackers to execute external commands other than the ones intended by the application. Most APIs used to execute external commands do not inherently provide protection against command injection. As a result, the likelihood of introducing such vulnerabilities when calling external commands is high. It is recommended to avoid using external commands.\n  * [[00000000-0000-0000-0000-000000179eb6|Use Parameterized APIs to Execute External Commands]] - Command injection vulnerabilities typically occur when user data is used to spawn external processes. Usually, the developers don't want the users to be able to choose which external commands are executed. The most effective way to enforce which external process is executed is to use parameterized APIs to call it. \n  * [[1eb615f4-c256-485e-be57-d35ab9b7b63f|Store Uploaded Files Outside of Web Root]] - Storing uploaded files in a location that is not web accessible prevents shell upload vulnerabilities. Even if an attacker manages to upload a malicious script, they won't be able to execute it if the malicious script is stored in a location that is not accessible from the web.\n  * [[00000000-0000-0000-0000-0000006adfa3|Store Passwords Securely]] - Storing hashes instead of plain-text passwords assures that an attacker cannot easily recover the passwords if he gains access to the password files. Adding salt to hashed files makes hashes much harder to break with dictionary attacks. Hashing should be applied multiple times to make hashing take longer and thus increase the computational resources required to attack the hashes. Iterative hashing applies a hashing function multiple times to a password and a salt, drastically increasing the time required to perform dictionary attacks.\n  * [[84fd606b-e2f2-4c48-9c6e-6b5e780c6163|Force Reauthentication When Executing Critical Functionality]] - Forcing the user to re-authenticate verifies the user's decision to execute the given functionality and preserves the application's integrity in the event that a user's account has been compromised via session hijacking.\n  * [[127d98e8-d628-40b7-8522-d903f4bf7927|Perform Role-based Security Checks]] - Application roles allow multiple users to play the same role and provides a clear way to manage the least privileges necessary for the execution of a given task. It provides a more robust and flexible way of managing the application's users.\n  * [[92f27c14-6962-4366-875f-101e6ab68230|Check Object References for Null Before Using Them]] - Check function parameters for null before using them to prevent your application from crashing if it tries to use that parameter as an object.\n  * [[42276b64-f51d-4b89-8c33-0ffd9b098890|Use Session Management Offered by the Framework]] - The framework works on a lower level than the application and is therefore better suited to provide session management. Most mature web application frameworks offer secure session management functionality.\n\n=Computer Based Training Links=\n\nUse the following courses for more information about Java Web Application security.\n\n==Creating Secure J2EE Code==\n\nThis course introduces and explains the precautionary measures you can use to avoid Web software security vulnerabilities, such as data leakage attacks, client/server protocol manipulation, injection attacks, and exploiting authentication.  At the end of this course, you will have learned about time-tested defensive coding principles and how to use them to increase the security of your application, and prevent common security vulnerabilities.\n\n[[https://teamprofessor.absorbtraining.com/ninja/#/courses/course/127619|COD 313 Creating Secure J2EE Code]]\n\n==Creating Secure Code - JRE Foundations==\n\nIn this course, you will learn to recognize and remediate common Java Web software security vulnerabilities.  This course has three modules, which introduce you to these vulnerabilities and help you to identify and remediate them.\n\n[[https://teamprofessor.absorbtraining.com/ninja/#/courses/course/127615|COD 211 Creating Secure Code - JRE Foundations]]\n\n//Valid login credentials and enrollment in the course itself are required to access Team Professor content. If you need login credentials, please contact support@securityinnovation.com for help.//\n\n[[b9c18634-7d10-4edf-b7ef-20d72f7c1650|Back to the Programming Best Practices Area]]"
        ]
      }
    ]
  }
}