{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1961926737",
      "Content_Hash": "2068673493"
    },
    "Metadata": [
      {
        "Id": [
          "004526a6-5b2f-4094-94fa-a80d818c0a41"
        ],
        "Id_History": [
          "004526a6-5b2f-4094-94fa-a80d818c0a41,9ef94b27-4f58-43d8-8811-5846f9798b6f,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Canonicalize All Input Used to Identify Resources"
        ],
        "Category": [
          "Canonicalization"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Canonicalize All Input Used to Identify Resources"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>C++</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Canonicalize all input used to identify resources, such as filenames, paths, named pipes, etc.</p>\r\n  <h1>Why</h1>\r\n  <p>There are often many ways to address the same resource by name. An attacker may try to bypass validation routines to perform unauthorized access by supplying obfuscated input. Canonicalization defeats obfuscation and helps validate data access attempts.</p>\r\n  <h1>When</h1>\r\n  <p>Canonicalize all input used to identify resources before using it for access.</p>\r\n  <h1>How</h1>\r\n  <p>Canonicalization means reducing to the simplest form. There are often many ways to access the same resources by name. One example is addressing files - the same file on a Windows system may be addressed as file, C:\\file, C:\\\\file, ..\\file, ..\\..\\..\\file, etc. Canonicalization is particularly important for systems that use unicode, because there are many different unicode strings that have the same meaning to the OS.</p>\r\n  <p>Perform the following actions to canonicalize all input used to identify resources:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all functions used to access resources, such as files or folders, by name.</strong> On UNIX-type systems, named pipes and devices are other resources that may be accessed by name. Add code that canonicalizes and validates this input. It is recommended to create a separate class or library for data validation routines and include functions for canonicalizing input in it. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use realpath() on POSIX systems.</strong> The POSIX C++ standard includes a realpath() function, which is suitable for canonicalization.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Use canonicalize_file_name() on glibc systems.</strong> Glibc includes a canonicalize_file_name() function, which works a lot like realpath(), but automatically allocated a new buffer for its output. Free the memory allocated by canonicalize_file_name() after canonicalization, because that is not done automatically.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Don't rely on canonicalization in Windows.</strong> Canonicalization in Windows is done by the GetFullPathName() function, however this function is very limited and provides a very low degree of assurance. Use ACLs on Windows to implement filesystem security and avoid making decisions based on file or folder names.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Avoid time-of-check-to-time-of-use vulnerabilities.</strong> Most Unix systems implement versions of common filesystem calls that use file handles instead of file names, such as openat, statat, accessat, etc. Use these functions instead of the ones that use filenames to avoid TOCTOU vulnerabilities.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about canonicalization, please see <a href=\"https://www.securecoding.cert.org/confluence/display/cplusplus/FIO02-CPP.+Canonicalize+path+names+originating+from+untrusted+sources\">https://www.securecoding.cert.org/confluence/display/cplusplus/FIO02-CPP.+Canonicalize+path+names+originating+from+untrusted+sources</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}