{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "79561953",
      "Content_Hash": "776232349"
    },
    "Metadata": [
      {
        "Id": [
          "00b37bcb-5a47-41ca-9e84-a9e8edb15272"
        ],
        "Id_History": [
          "00b37bcb-5a47-41ca-9e84-a9e8edb15272,75c875f6-5e21-4fbd-8df6-60e9f8f255d1,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use SSL Between the Web Browser And Web Server When Pages Need to Be Encrypted"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use SSL Between the Web Browser And Web Server When Pages Need to Be Encrypted"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Use SSL as an encrypted communication channel to protect data sent between servers and web browsers. SSL can be used to help protect communication by encrypting traffic such as account information, billing data, etc.&nbsp;&nbsp; </p>\r\n  <h1>Why</h1>\r\n  <p>If sensitive data is sent between client and server unprotected it may be stolen or modified.&nbsp; SSL can be used to help protect communication between client and server by encrypting network traffic.&nbsp; Encryption will protect against eavesdropping (theft) but an attacker may still blindly modify the data for malicious purposes.&nbsp; Use integrity checking (HMAC) to ensure the data has not been modified.</p>\r\n  <h1>When</h1>\r\n  <p>Use&nbsp;SSL for communication between web browser and web server, when page content&nbsp;needs to be encrypted on the network and the&nbsp;identity&nbsp;of the server needs to be guaranteed. </p>\r\n  <p>\r\n    <strong>Note</strong>: SSL does carry a significant performance penalty in terms of latency that is introduced due to encryption/decryption of pages, so it is important to optimize the number of pages that use SSL. Please see \"Guideline: Performance:Use SSL Only for Pages That Require It\" for more information.</p>\r\n  <h1>How</h1>\r\n  <p>Use SSL to create a secure encrypted communication channel between browser clients and Web server.</p>\r\n  <p>To use SSL:</p>\r\n  <p>&nbsp;&nbsp; 1. Install a server certificate on the Web server.<br />&nbsp;&nbsp; 2. Install the root certificate authority (CA) certificate from the same authority into the local computer's Trusted Root Certification Authorities certificate store.<br />&nbsp;&nbsp; 3. Use IIS to configure the server to force the use of encryption while accessing Web pages.<br />&nbsp;&nbsp; 4. Design pages with SSL in mind to minimize performance overhead. Optimize pages that use SSL by including less text and simple graphics and partition&nbsp;the site and ensure that only those pages than contain sensitive data use SSL.&nbsp;</p>\r\n  <h1>Problem Example</h1>\r\n  <p>An ASP.NET application allows users to login and maintain their contacts in an online database that is accesible via a web browser. The login&nbsp;credentials are sent in plain text, which allows someone on the network to modify&nbsp;the&nbsp;data sent between&nbsp;a browser and a server or view the contents. The lack of integrity and privacy means that the identity of the user and the identity of the web&nbsp;entity serving out the pages can not be verified.&nbsp;&nbsp;&nbsp;</p>\r\n  <h1>Solution Example</h1>\r\n  <p>An ASP.NET application allows users to login and maintain their contacts in an online database that is accesible via a web browser. When the application is deployed, an SSL certificate is installed on the Web Server. The server is then setup to force users to use encryption while visiting pages containing sensitive information.</p>\r\n  <h1>Additional Resources&nbsp;</h1>\r\n  <ul>\r\n    <li>How To: Use SSL to Secure Communication with SQL Server&nbsp;<a href=\"http://msdn.microsoft.com/library/default.asp?url=/library/en-us/dnnetsec/html/SecNetHT19.asp\">http://msdn.microsoft.com/library/default.asp?url=/library/en-us/dnnetsec/html/SecNetHT19.asp</a><li>Using Secure Sockets Layer <a href=\"http://msdn2.microsoft.com/en-us/library/ds8bxk2a.aspx\">http://msdn2.microsoft.com/en-us/library/ds8bxk2a.aspx</a><li>Internet Protocol Version 6 <a href=\"http://msdn2.microsoft.com/en-us/library/3x7ak53z(VS.80).aspx\">http://msdn2.microsoft.com/en-us/library/3x7ak53z(VS.80).aspx</a><li>How To: Use SSL between the browser and sdf <a href=\"http://channel9.msdn.com/wiki/default.aspx/GuidanceLibrary.WebServerandBrowserSSLHowTo\">http://channel9.msdn.com/wiki/default.aspx/GuidanceLibrary.WebServerandBrowserSSLHowTo</a>&#43; <p /></li></li></li></li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/8afce3ed-b29f-4a25-ab8c-0d070383c7ad\">Use SSL Between Untrusted Server Applications</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}