{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1351732340",
      "Content_Hash": "-1378789644"
    },
    "Metadata": [
      {
        "Id": [
          "01344ada-5aef-4a4d-aad2-baf294de8090"
        ],
        "Id_History": [
          "01344ada-5aef-4a4d-aad2-baf294de8090,4ed440c1-92ee-4454-8254-1fb3a9d107dd,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Log Important Business Operations"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Log Important Business Operations"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Log important business operations.</p>\n  <h1>Why</h1>\n  <p>Important business operations should be logged to help identify attacks in progress and to investigate attacks that have already occured.</p>\n  <h1>How</h1>\n  <p>Use the following steps to add code to log important business operations:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>List important business operations.</strong> Make a list of business operations carried out by the application, such as placing orders, manipulating inventory, etc. Identify which of these operations are the most important.</p>\n      <li>\n        <p>\n          <strong>Identify code that performs important business operations.</strong> Use the list of important business operations to find code that matches each one. Make a list of functions in this code.</p>\n        <li>\n          <p>\n            <strong>Add logging functionality.</strong> Create a separate class or library to handle auditing and logging. Take time to design this library or class carefuly. Consider functionality to send logs to a remote log server. One of the most common protocols for interfacing with a remote log server is syslog (RFC 5424). Create and document an API for logging events with an adequate amount of information.</p>\n          <li>\n            <p>\n              <strong>Add code that logs important business operations.</strong> Use the list of functions that carry out important business operations and add code to each function to use the logging API to make records when important business operations take place. Log both successful and failed events. Record success and failure indications.</p>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>Related Items</h1>\n  <ul>\n    <li>\n      <a href=\"/article/7af4efea-59f5-468a-b5a1-c423cd29744a\">Centralize Logging</a>\n    </li>\n  </ul>"
        ]
      }
    ]
  }
}