{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-976535523",
      "Content_Hash": "1469345724"
    },
    "Metadata": [
      {
        "Id": [
          "0c6693ed-e3c2-4640-a795-c7c9c2a63cbc"
        ],
        "Id_History": [
          "0c6693ed-e3c2-4640-a795-c7c9c2a63cbc,fdf4a0d8-3a8b-4e04-8cb7-db0a674c7280,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Define a Security Policy"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Define a Security Policy"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Define a security policy for your application while applying the Principle of Least Privilege. The security policy should specify which Code Access Security privileges should be granted to your application. Restrict the permission set to only allow the minimum set of necessary actions.</p>\r\n  <h1>Why</h1>\r\n  <p>Defining a security policy is a defense in-depth mechanism for restricting your application from performing tasks that the operating system would otherwise allow. This is especially important in cases where your application becomes compromised by an attacker.</p>\r\n  <h1>When</h1>\r\n  <p>ASP.NET web services and applications run in the full trust mode by default. Rarely will an application need the entire set of permissions. This guideline is applicable whenever an application does not require the entire set of permissions that are grantable in ASP.NET.</p>\r\n  <h1>How</h1>\r\n  <p>This guideline covers Code Access Security, which uses the defined policy to restrict the actions an application can perform regardless of the user context. It is also important to reduce the privilege level of the user context for the application. </p>\r\n  <p>To define a Code Access Security policy for your application, follow these ordered steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the permissions your application needs.</strong> Identify the precise set of code access security permissions that your application requires. You can do this by manually reviewing your code, or by using the Permissions Calculator (permcalc.exe). </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Choose an appropriate trust level.</strong> Use the following steps when choosing the appropriate trust level for your application:</p>\r\n      <ol>\r\n        <li>Evaluate whether the permissions required for your application match those provided by any of the standard trust levels. To see the permissions each trust level provides, examine each trust level policy file in the %windir%\\Microsoft.NET\\Framework\\{version}\\CONFIG directory, beginning with the High trust policy file web_hightrust.config. </li>\r\n        <li>If your application requires fewer code access security permissions than those provided by the High trust level, move on to consider Medium trust. Repeat the process, moving from Medium to Low to Minimal, and keep evaluating the partial trust levels until you reach an exact match to your application's requirements or until your application's required permissions slightly exceed a partial trust level. </li>\r\n        <li>If your application needs more permissions than are granted by one level but requires fewer that are provided by the next level, consider creating a custom trust policy.</li>\r\n      </ol>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Configure your ASP.NET application.</strong> You can configure your ASP.NET application to use a standard level either in your application's Web.config file or in the machine-level Web.config file. Machine level configuration affects all the ASP.NET Web Applications and Web services hosted on that server. Application-level configuration affects only a specific application. </p>\r\n      <pre>&lt;system.web&gt;<br />  ...<br />  &lt;trust level=\"Medium\" originUrl=\"\" /&gt;<br />  ...<br />&lt;/system.web&gt;</pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Optionally create a custom trust level.</strong> You may require a custom trust level if none of the predefined trust levels provide the exact set of permissions that your application needs to run. For example, you may find that your application needs more permissions than Medium trust provides but fewer permissions than High trust provides. Follow these steps when creating a custom policy:</p>\r\n      <ol>\r\n        <li>\r\n          <p>Copy the trust level policy file that most closely matches your application's permission requirements to create a new custom policy file.</p>\r\n        </li>\r\n        <li>\r\n          <p>Locate this file in the standard policy file directory, which is %Windir%\\Microsoft.NET\\Framework\\{Version}\\CONFIG. Add the required additional permissions to the custom policy file and configure your application to run using the custom policy. Example:</p>\r\n          <pre>&lt;configuration&gt;<br />   &lt;mscorlib&gt;<br />      &lt;security&gt;<br />         &lt;policy&gt;<br />            &lt;PolicyLevel version=\"1\"&gt;<br />               &lt;SecurityClasses&gt;<br />                  ...<br />                  &lt;SecurityClass Name=\"DnsPermission\" Description=\"...\"/&gt;<br />                  ...<br />               &lt;/SecurityClasses&gt;<br />               &lt;NamedPermissionSets&gt;<br />                  ...<br />                  &lt;PermissionSet<br />                        class=\"NamedPermissionSet\"<br />                        version=\"1\"<br />                        Name=\"ASP.Net\"&gt;<br />                     &lt;IPermission<br />                           class=\"AspNetHostingPermission\"<br />                           version=\"1\"<br />                           Level=\"High\"<br />                     /&gt;<br />                     &lt;IPermission<br />                           class=\"ConfigurationPermission\"<br />                           version=\"1\"<br />                           Unrestricted=\"true\"<br />                     /&gt;<br />                     ...<br />                  &lt;/PermissionSet&gt;<br />                  ...<br />               &lt;/NamedPermissionSets&gt;<br />               &lt;CodeGroup<br />                     class=\"FirstMatchCodeGroup\"<br />                     version=\"1\"<br />                     PermissionSetName=\"Nothing\"&gt;<br />                  &lt;IMembershipCondition<br />                        class=\"AllMembershipCondition\"<br />                        version=\"1\"<br />                  /&gt;<br />                  &lt;CodeGroup<br />                        class=\"UnionCodeGroup\"<br />                        version=\"1\"<br />                        PermissionSetName=\"ASP.Net\"&gt;<br />                  ...<br />                  &lt;/CodeGroup&gt;<br />                  ...<br />               &lt;/CodeGroup&gt;<br />            &lt;/PolicyLevel&gt;<br />         &lt;/policy&gt;<br />      &lt;/security&gt;<br />   &lt;/mscorlib&gt;<br />&lt;/configuration&gt;</pre>\r\n        </li>\r\n        <li>\r\n          <p>Configure your application to run using the custom trust policy defined in the previous steps. Example:</p>\r\n          <pre>&lt;location allowOverride=\"true\"&gt;<br />   &lt;system.web&gt;<br />      &lt;securityPolicy&gt;<br />         &lt;trustLevel name=\"MyAppTrustLevel\" policyFile=\"myapp_customtrust.config\" /&gt;<br />      &lt;/securityPolicy&gt;<br />      &lt;trust level=\"MyAppTrustLevel\" originUrl=\"\" /&gt;<br />   &lt;/system.web&gt;&lt;/location&gt;</pre>\r\n        </li>\r\n      </ol>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Do not allow developers to change trust levels.</strong> Lock the trust level set in your application's root web.config:</p>\r\n      <pre>&lt;location allowOverride=\"false\"&gt;<br />   &lt;system.web&gt;<br />      &lt;trust level=\"Medium\" originUrl=\"\" /&gt;<br />   &lt;/system.web&gt;<br />&lt;/location&gt;</pre>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>A developer creates an ASP.NET application that requires file system access outside of the directory that is allocated for the application. The default Full Trust level does allow for file system access in the way that the application needs, however it also gives several unnecessary privileges such as socket access, and the ability to call unmanaged code. These additional privileges increase the amount of damage an attacker can do if the application is compromised.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>A developer creates an ASP.NET application that requires file system access outside of the directory that is allocated for the application. The developer does not want to give full permissions to the application. The developer runs permcalc.exe on the assembly, which generates an xml report that identifies the precise permissions that the application requires, which are:</p>\r\n  <ul>\r\n    <li>\r\n      <strong>SMTP access.</strong> Emails are sent on behalf of the application to notify users when important events occur, such as password reset acknowledgment responses and welcome emails for new users. </li>\r\n    <li>\r\n      <strong>Managed code only</strong>. The application is very modern, and relies on no unmanaged libraries to perform tasks. The application does not need to call unmanaged (native) code. </li>\r\n    <li>\r\n      <strong>Socket Access.</strong> The application relies on an older auditing package that employs a custom, socket based communication protocol. The application needs the ability to create a socket connection and read/write data from/to it.</li>\r\n  </ul>\r\n  <p>The developer looks at the Predefined trust levels, and determines that the lowest level of trust that the application can use and still satisfy it's requirements is the high trust level. She sets the trust level by adding an xml directive to the web config file:</p>\r\n  <pre>&lt;system.web&gt;<br />  ...<br />  &lt;trust level=\"High\" originUrl=\"\" /&gt;<br />  ...<br />&lt;/system.web&gt;</pre>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}