{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1881132457",
      "Content_Hash": "-655679823"
    },
    "Metadata": [
      {
        "Id": [
          "0f4cb1a2-b00a-4d71-9e26-627e6d425798"
        ],
        "Id_History": [
          "0f4cb1a2-b00a-4d71-9e26-627e6d425798,788b8376-46ed-4ac1-ac5b-074a4593fa1f,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use Prepared Statements for Data Access"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Prepared Statements for Data Access"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n- PHP\r\n\r\n\r\n## What to Do ##\r\n\r\nUse prepared statements to execute SQL queries, especially when untrusted data is being passed to the database. Do not concatenate user input into SQL queries. You can use static query strings without using prepared statements and it won't result in SQL injection, so long as all queries that include untrusted data, such as user input, use prepared statements. You can also use parameterized stored procedures as an alternative solution to similar effect.\r\n\r\n\r\n## Why ##\r\n\r\nPrepared statements mitigate the number one risk for Internet-facing Web applications that use databases: SQL injection. This powerful attack is language independent, as it depends on the algorithm used to generate SQL strings passed to the database and affects the database engine, not the actual application. The vulnerability is caused by concatenating untrusted data into SQL query strings. This allows attackers to insert valid SQL statement fragments as part of user input so they, in turn, are embedded within the SQL query that is submitted to the database engine for execution. Successful exploitation allows an attacker to potentially compromise the entire database and often the application. Compromising the application can then potentially be leveraged to take over the server and then use it to pivot around whatever networks it might be connected to.\r\n\r\nPrepared statements offer a simple yet effective mitigation since they automatically separate user input from SQL syntax, making it impossible to modify the structure of the SQL query, regardless of what data is entered by the user. \r\n\r\n\r\n## How ##\r\n\r\nTo use prepared statements to prevent SQL injection, follow these steps:\r\n\r\n1. **Identify SQL queries.** Locate all SQL queries throughout your application.\r\n\r\n2. **Identify the parameters in each SQL query.** After locating all SQL queries, identify the parameters in each query. Understand the format and type of each parameter's data.\r\n\r\n3. **Use prepared statements for SQL queries.** The exact APIs are different for different database drivers. The very popular mysql interface does not support prepared statements, use msqli instead. To form query strings suitable for use with prepared statements, substitute the parameters in SQL queries with question marks (\"?\"). The basic steps for using prepared statements are: get a database handle, call the prepare function to make the prepared statement, bind prepared statement parameters to variables, load data into the variables, and call the execute function to execute the prepared statement. All the APIs necessary to use prepared statements are thoroughly documented on php.net. \r\n\r\n## Problem Example ##\r\n\r\nHere is a classic SQL injection example:\r\n\r\n\t\t<?php\r\n\t\t$username = 'root';\r\n\t\t$password = '';\r\n\t\t$con = mysqli_connect(\"localhost\", $username, $password, \"tpcatalog\");\r\n\r\n\t\tif(mysqli_connect_errno())\r\n\t\t{\r\n\t\techo \"Error: could not connect to the database\";\r\n\t\t}\r\n\r\n\t\t//VULNERABLE CODE BELOW\r\n\t\t$query = \"SELECT name, description FROM TPCourses WHERE id=\".$_REQUEST['id'];\r\n\t\t$result = $con->query($query);\r\n\t\t//VULNERABLE CODE ABOVE\r\n\r\n\t\tif($result->num_rows >0){\r\n\t\twhile($row = $result->fetch_assoc()){\r\n\t\techo $row['name'] . ' ' . $row['description'] . '<br>';\r\n\t\t}\r\n\r\n\t\t$con->close();\r\n\t\t}\r\n\r\nConcatenating untrusted data to the end of an SQL query is probably the most common type of SQL injection. It is so common that some attackers use search engines to look for URLs that contain an id parameter, because a lot of such pages are vulnerable.\r\n\r\n## Solution Example ##\r\n\r\nLet's fix the vulnerable code from the example above using prepared statements:\r\n\r\n\r\n\t\t<?php\r\n\t\t$username = 'root';\r\n\t\t$password = '';\r\n\t\t$con = new mysqli(\"localhost\", $username, $password, \"tpcatalog\");\r\n\r\n\t\tif(mysqli_connect_errno())\r\n\t\t{\r\n\t\techo \"Error: could not connect to the database\";\r\n\t\t}\r\n\r\n\t\t//INVULNERABLE CODE BELOW\r\n\t\t$query = $con->prepare(\"SELECT name, description FROM TPCourses WHERE id=(?)\");\r\n\t\t$query->bind_param(\"i\", intval($_REQUEST['id']));\r\n\t\t$query->execute();\r\n\t\t$query->bind_result($name, $description);\r\n\t\t//INVULNERABLE CODE ABOVE\r\n\r\n\t\twhile($query->fetch()){\r\n\t\techo $name . ' ' . $description . '<br>';\r\n\t\t}\r\n\r\n\t\t$query->close();\r\n\t\t$con->close();\r\n\t\t\r\nThere is no error checking or handling in the solution example to make it simpler and easier to read, but you should always do error checking and handling on production systems. A database connection might fail for example. The solution example does not contain an SQL injection vulnerability, even though it passes untrusted input to the database without validation, encoding, escaping or sanitization. In practice, all untrusted input should be validated."
        ]
      }
    ]
  }
}