{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-408524559",
      "Content_Hash": "-1620024769"
    },
    "Metadata": [
      {
        "Id": [
          "149c6907-0c10-4386-8f88-c3bfaf626485"
        ],
        "Id_History": [
          "149c6907-0c10-4386-8f88-c3bfaf626485,53cd7aa6-9579-4391-85ee-3358618294f6,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Use Windows Authentication for Web Users If Possible"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Windows Authentication for Web Users If Possible"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Consider windows authentication as an alternative to ASP.Net Forms Authentication. </p>\r\n  <h1>Why</h1>\r\n  <p>Unlike Forms Authentication, Windows Authentication never transmits either a password or a direct hash of the password over the network. This makes it much more difficult for an attacker to steal passwords by monitoring network traffic or to steal a session through a replay attack. In addition, it also benefits from a unified identity store, centralized account administration, and enforceable account and password policies. </p>\r\n  <h1>When</h1>\r\n  <p />Windows Authentication should be used whenever allowed by your application requirements. The&nbsp;main disadvantage of Windows Authentication is that all user accounts for your application must also be&nbsp;local machine accounts on the server or&nbsp;Active Directory accounts.<h1>How</h1><p>Follow these steps to design and configure your application for Windows Authentication.</p><ol><li><p><strong>Protect against Cross-Site Request Forgery attacks</strong>. When you configure your web application to use Windows Authentication, Internet Explorer will automatically authenticate using the currently logged-on user's credentials without prompting the user. This is known as \"silent authentication\" and makes your application more susceptible to Cross Site Request Forgery. </p></li><li><p><strong>Configure your application for Windows Authentication. </strong>To use Windows authentication in ASP.NET, you must use Microsoft Internet Information Services (IIS) to disable anonymous access and configure a Windows-based authentication method for your Web application's virtual directory. You must also ensure that the <em>mode</em> attribute on the &lt;<em>authentication</em>&gt; element is set to \"<em>Windows</em>\" (the default setting) in your <em>Web.config</em> file.</p></li></ol><h1>Problem Example</h1><p>John created a payroll ASP.Net Web Application for his company and decided to use ASP.Net Forms Authentication with the Active Directory Membership Provider because it seemed to be the simplest option at the time. He had no idea that Forms Authentication sends passwords and authentication cookies in plain text over the network. One week after the application was released, an employee used this vulnerability to impersonate a manager and increase their salary.</p><h1>Solution Example</h1><p>Upon review of the situation, John realized that the use of Forms Authentication was completely inappropriate for such a sensitive application. He switched the application over to use Windows Authentication instead and has had no subsequent problems.</p><hr /><p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}