{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-925923517",
      "Content_Hash": "2144558091"
    },
    "Metadata": [
      {
        "Id": [
          "15d6bff4-6a4a-4c92-b704-26e3bde867a7"
        ],
        "Id_History": [
          "15d6bff4-6a4a-4c92-b704-26e3bde867a7,7a44c255-1793-45fb-8965-d1e5592254cb,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Consider Using SecurityTransparent And SecurityCritical"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Consider Using SecurityTransparent And SecurityCritical"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>If you know that your code will not attempt to elevate the permissions of the call stack&#8212;for example, by using assertions or stack walk modifiers&#8212;consider marking the code with the <b>System.Security.SecurityTransparentAttribute</b>. </p>\n  <h1>Why</h1>\n  <p>This is particularly useful if your code calls untrusted code such as a third-party plug-in. If the untrusted code attempts to manipulate the permissions of the call stack, a security exception is generated. Security transparent code and the code it calls give up the right to elevate the permissions of the call stack.</p>\n  <p>In addition to providing added protection when calling untrusted code, marking code explicitly with the <b>SecurityTransparent</b> and <b>SecurityCritical</b> attributes helps people who have to review your code. Typically, the majority of your code will not elevate code access security permissions, and can therefore be marked as <b>SecurityTransparent</b>. The small amount of your code that actually performs elevations of privilege should be marked as critical. This helps reviewers to focus on those areas of code marked as security critical.</p>\n  <blockquote>\n    <b>Note</b>&nbsp;&nbsp;&nbsp;Because a transparent assembly cannot be used by partially trusted code to increase its effective permission set, any assemblies that are marked transparent do not require as thorough of a security audit as standard APTCA assemblies</blockquote>\n  <h1>When</h1>\n  <p>This guideline is useful when writing a code, that&nbsp;does not attempt to elevate the permissions of the call stack&#8212;for example, by using assertions or stack walk modifiers and your code calls untrusted code such as a third-party plug-in.</p>\n  <h1>How</h1>\n  <p>Marking an assembly <b>SecurityTransparent</b> forces it to abide by the following rules: </p>\n  <ul>\n    <li>It cannot assert permissions to stop a stack walk from continuing. <li>It cannot satisfy a link demand. Instead, any link demands on APIs called by the transparent assembly are automatically converted into full demands. <li>It cannot automatically use unverifiable code, even if it has <b>SkipVerification</b> permission. Instead, a full demand for <b>UnmanagedCode</b> occurs. <li>It cannot automatically make calls to P/Invoke methods, even if it has been decorated with the <b>SuppressUnmanagedCodeAttribute</b>. Instead, a full demand for <b>UnmanagedCode</b> occurs.</li></li></li></li>\n  </ul>\n  <blockquote>\n    <b>Note</b>&nbsp;&nbsp;&nbsp;By default, all assemblies compiled for .NET 3.5 are security critical and contain only critical code.</blockquote>\n  <p>To make an entire assembly transparent, you can explicitly add <b>SecurityTransparent</b> to an assembly by using the following attribute:</p>\n  <pre> &#91;assembly: SecurityTransparent&#93;  </pre>\n  <p>This indicates that the assembly does not contain any critical code, and does not elevate the privileges of the call stack in any way. </p>\n  <p>If you need to mix critical and transparent code in the same assembly, start by marking the assembly with the <b>System.Security.SecurityCriticalAttribute</b> as shown here.</p>\n  <pre> &#91;assembly: SecurityCritical&#93;  </pre>\n  <p>By marking the assembly with the <b>SecurityCriticalAttribute</b>, you indicate that the assembly <i>can</i> contain critical code. However, unless explicitly marked as critical, all code within the assembly defaults to being transparent. If you want to perform security critical actions, you must explicitly mark the code that will perform the critical action with another <b>SecurityCritical</b> attribute, as shown in the following example.</p>\n  <pre> &#91;assembly: SecurityCritical&#93;public class A<br />&#123;<br />&nbsp;&nbsp;&nbsp; &#91;SecurityCritical&#93;<br />&nbsp;&nbsp;&nbsp; public void Critical()<br />&nbsp;&nbsp;&nbsp; &#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // critical<br />&nbsp;&nbsp;&nbsp; &#125;</pre>\n  <pre>&nbsp;&nbsp;&nbsp; public int SomeProp<br />&nbsp;&nbsp;&nbsp; &#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; get &#123;/&#42; transparent &#42;/ &#125;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; set &#123;/&#42; transparent &#42;/ &#125;<br />&nbsp;&nbsp;&nbsp; &#125;<br />&#125;<br />public class B<br />&#123;<br />&nbsp;&nbsp;&nbsp; internal string SomeOtherProp<br />&nbsp;&nbsp;&nbsp; &#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; get &#123; /&#42; transparent &#42;/ &#125;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; set &#123; /&#42; transparent &#42;/ &#125;<br />&nbsp;&nbsp;&nbsp; &#125;<br />&#125;<br /></pre>\n  <p>All of the code above is transparent (the default setting even with the assembly level <b>SecurityCritical</b> attribute), with the exception of the method <b>Critical</b>, which is explicitly marked as critical.</p>\n  <p>You can also mark all code within an entire class as critical. To do so, use the <b>SecurityCritical</b> attribute at the class level, and then pass <b>SecurityCriticalScope.Everything</b>, as shown in the following example.</p>\n  <pre> &#91;assembly: SecurityCritical&#93;<br />&#91;SecurityCritical(SecurityCriticalScope.Everything)&#93;<br />public class MyClass<br />&#123;<br />&nbsp; ...<br />&#125; </pre>\n  <h1>Additional Resources</h1>\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}