{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "409193061",
      "Content_Hash": "-309862132"
    },
    "Metadata": [
      {
        "Id": [
          "17034ef0-8935-4fb2-bbae-d79982e710c7"
        ],
        "Id_History": [
          "17034ef0-8935-4fb2-bbae-d79982e710c7,4829d517-b32e-460f-8609-4b9bf8032240,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use Role-based Authorization"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Perform Role-based Security Checks"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Enumerate the different types of users and create specific roles for them. When authorizing access to a resource, build the security checks on a per-role basis rather than on a per-user basis.</p>\r\n  <h1>Why</h1>\r\n  <p>Application roles allow administrators to group users into categories that need the same level of privileges. The mechanism provides an easy and clear way to discover and manage the least privileges necessary for the execution of a given task. It provides a more robust and flexible way of managing the application's users.</p>\r\n  <h1>When</h1>\r\n  <p>If your application uses access control and authorizes its users to application resources.</p>\r\n  <h1>How</h1>\r\n  <p>To apply this concept access control should be based on a user's role rather than the actual user.</p>\r\n  <p>Use the following steps when designing the role-based security:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Understand the different types of users</strong>: Enumerate the different types of users needed for the application. Understand how they willl use the application and to which resources they will need access. Create a matrix mapping the actions each role is authorized to perform with the corresponding system components. Use this matrix to identify the different types of users according to the functionality they need. Creating a threat model may be a useful step to ensure that you correctly understand the implications of this matrix.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Establish the roles</strong>: Define which resources can be accessed by each role. There are two approaches when enforcing role-based security - programmatic and declarative.</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Programmatically</strong>: The programmatic approach to role-based security is written inside the code and provides additional runtime flexibility. It allows your application to dynamically create and assign roles so that user privileges can be granted and revoked without the need of restarting your application. When using the programmatic approach to role-based security, place access control checks at the appropriate locations in your application. For example, the following code requires users to be shareholders in order to generate a financial report:</p>\r\n          <pre>public void GenerateFinancialReport(DateTime startDate, DateTime endDate)<br />{<br />    if (HttpContext.Current.User.IsInRole(\"ShareHolders\"))<br />    {<br />        // Generate the relevant financial report<br />    }<br />}</pre>\r\n          <p>Additionally, your application can programmatically check if a user is member of a local Windows group.</p>\r\n          <pre>public void RetrieveLogs(ref Hashtable logTable)<br />{<br />    WindowsPrincipal user = new WindowsPrincipal((WindowsIdentity)HttpContext.Current.User.Identity);<br />    if (user.IsInRole(WindowsBuiltInRole.Administrator))<br />    {<br />        // Add logic for retrieving logs<br />    }<br />}</pre>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Declarative</strong>: The declarative approach to role-based security is done via the configuration files. It allows easy manageability as the declarations can be modified without having to recompile. By using the declarative approach, you can easily manage the security settings for large portions of the application without changing the source code. ASP.NET applications that use declarative security specify the appropriate roles inside <strong>web.config</strong>. The following elements enforce role-based security through <strong>web.config</strong>:</p>\r\n          <ul>\r\n            <li>\r\n              <p>\r\n                <strong>roleManager</strong>: Configures the ASP.NET role manager. Applicable only if form-based authentication is used. Example:</p>\r\n              <pre>&lt;connectionStrings&gt;<br />  &lt;add name=\"MyAppSqlConnection\"<br />       connectionString=\"Server=serv02.example.com; Database=myapp; Integrated Security=SSPI;\"<br />       providerName=\"System.Data.SqlClient\"/&gt;<br /> ...<br /> &lt;system.web&gt;<br />   &lt;roleManager enabled=\"true\" cacheRolesInCookie=\"false\" defaultProvider =\"ProjectRoleProvider\"&gt;<br />    &lt;providers&gt;<br />      &lt;clear /&gt;<br />      &lt;add name=\"MyAppRoleProvider\"<br />            type=\"System.Web.Security.SqlRoleProvider\"<br />            connectionStringName=\"MyAppSqlConnection\"<br />            applicationName=\"MyApp\"/&gt;</pre>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>authorization</strong>: Encapsulates the authorization settings for a resource.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>allow</strong>: Represents the users and roles that are allowed access to the given resource.</p>\r\n            </li>\r\n            <li>\r\n              <p>\r\n                <strong>deny</strong>: Represents the users and roles that are denied access to the given resource.</p>\r\n            </li>\r\n          </ul>\r\n          <p>For example:</p>\r\n          <pre>&lt;!-- web.config --&gt;<br />&lt;system.web&gt;<br />   &lt;authentication mode=\"Windows\" /&gt;<br />   &lt;authorization&gt;<br />    &lt;allow roles=\"BUILTIN\\Administrators\"/&gt;<br />    &lt;deny users=\"*\"/&gt;<br />  &lt;/authorization&gt;<br />&lt;/system.web&gt;</pre>\r\n          <p>Additionally, if your application uses form-based authentication, you can configure your application's access controls through Visual Studio's ASP.NET Configuration, available by accessing the <strong>Website -&gt; ASP.NET Configuration</strong> menu.</p>\r\n          <p>Note that if you use Windows authentication, you will need to manage your application's users and user roles through managing Windows users and groups.</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Manage the users</strong>: Assign the users into their respective user roles. The application should enforce the security policy according to the user roles instead of the actual user. Based on your application's mechanism to enforce role-based access controls, use one of the following techniques to manage your application's users:</p>\r\n      <ul>\r\n        <li>\r\n          <p>\r\n            <strong>Programmatically</strong>: ASP.NET allows you to manage your application's users through the <strong>Roles</strong> class.</p>\r\n          <p>Use the following methods to assign users into roles:</p>\r\n          <ul>\r\n            <li>\r\n              <strong>AddUserToRole</strong>\r\n            </li>\r\n            <li>\r\n              <strong>AddUserToRoles</strong>\r\n            </li>\r\n            <li>\r\n              <strong>AddUsersToRole</strong>\r\n            </li>\r\n            <li>\r\n              <strong>AddUsersToRoles</strong>\r\n            </li>\r\n          </ul>\r\n          <p>Example:</p>\r\n          <pre>Roles.AddUserToRole(\"eric\", \"ShareHolders\");</pre>\r\n          <p>Use the following methods to remove users from roles:</p>\r\n          <ul>\r\n            <li>\r\n              <strong>RemoveUserFromRole</strong>\r\n            </li>\r\n            <li>\r\n              <strong>RemoveUserFromRoles</strong>\r\n            </li>\r\n            <li>\r\n              <strong>RemoveUsersFromRole</strong>\r\n            </li>\r\n            <li>\r\n              <strong>RemoveUsersFromRoles</strong>\r\n            </li>\r\n          </ul>\r\n          <p>Example:</p>\r\n          <pre>Roles.RemoveUserFromRole(\"eric\", \"ShareHolders\");</pre>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Declarative</strong>: Use the ASP.NET Role Manager to manage your application's users. If your application uses form-based authentication, you can configure your application's access controls through Visual Studio's ASP.NET Configuration, available by accessing the <strong>Website -&gt; ASP.NET Configuration</strong> menu.</p>\r\n        </li>\r\n        <li>\r\n          <p>\r\n            <strong>Windows</strong>: If your application uses Windows authentication, use the Windows <strong>Local Users and Groups</strong> service to manage your application's users. If your server is connected to your organization's NT Domain or Active Directory forest, user and role management will be performed by your organization's network administrators.</p>\r\n        </li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following segment illustrates an application's access control policy. Because the application does not enforce role-based security, it has a policy entry for each separate user; therefore managing the users' access rights can be quite difficult when the number of users to the application grows.</p>\r\n  <pre>&lt;authorization&gt;<br />  &lt;allow users=\"NTDomain\\joe, NTDomain\\sarah, NTDomain\\bill, NTDomain\\sue\"/&gt;<br />  &lt;deny users=\"*\"/&gt;<br />&lt;/authorization&gt;</pre>\r\n  <h1>Solution Example</h1>\r\n  <p>The following segment illustrates an application's access control policy. Because the application enforces role-based security, it provides a policy entry for each group of users; therefore increasing the application's users store has no impact on the ability to manage the users' access rights as only the group permissions need to be modified.</p>\r\n  <pre>&lt;authorization&gt;<br />  &lt;allow roles=\"NTDomain\\Employees\"/&gt;<br />  &lt;deny users=\"*\"/&gt;<br />&lt;/authorization&gt;</pre>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}