{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-261388651",
      "Content_Hash": "1546712161"
    },
    "Metadata": [
      {
        "Id": [
          "1e240c0b-5d16-4191-b842-579809433eff"
        ],
        "Id_History": [
          "1e240c0b-5d16-4191-b842-579809433eff,2319a68c-9e0c-4c3b-8cbd-d54a94cc8284,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encode Echoed Input"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Encode Echoed Input"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* ASP.NET 4.0 and above.\r\n\r\n## What to Do ##\r\n\r\nEncode special characters in user input displayed on pages based on context that this output is presented in. The most common contexts are HTML, URLs and JavaScript. Occasionally, user input is presented as a part of CSS. Special characters in user data presented in XML documents also need to be encoded, but for that it is best to use parameterized APIs that build XML documents, rather than concatenating encoded user data into XML documents.\r\n\r\n## Why ##\r\n\r\nEncode user input that is displayed on web pages to prevent Cross-Site Scripting(XSS) attacks.\r\n\r\n## When ##\r\n\r\nApplications should never echo untrusted or user modifiable data back to the user without appropriate encoding.\r\n\r\n## How ##\r\n\r\nIf you write output that includes user input or data from a shared database or a local file that you do not trust, encode it. Encoding the data ensures that it is treated as literal text and not as script. Use the following guidelines to encode user input:\r\n\r\n1. **Use the Microsoft AntiXSS library.** The AntiXSS library is a part of .NET starting with .NET 4.5. For projects using .NET 4.0, it has to be added using NuGet. The AntiXSS library can encoded data in HTML, URL, JavaScript, CSS and XML contexts.\r\n\r\n2. **Identify all sources of user input.** Determine all the possible tainted inputs to the application. The following list includes some common input sources:\r\n * Form Fields\r\n * Query strings\r\n * Databases and data access methods\r\n * Cookie collection\r\n * Session and application variables\r\n\r\n3. **Identify all output that includes user input.** Trace all inputs to the system though and determine all the code that will output it as a part of HTML, URL, JavaScript, CSS and XML contexts. Make a spreadsheet that contains all this information.\r\n\r\n4. **Encode all special characters based on context.** Use the corresponding functions in the Microsoft AntiXSS library to encode the data that is being displayed in HTML, URL, JavaScript, CSS and XML contexts. Encode that data at the last possible moment before displaying it to reduce the possibility of double-encoding bugs.\r\n\r\n## Problem Example ##\r\n\r\nASP.NET platforms starting with .NET 4.0 include a feature called request validation, which effectively mitigates the bulk of reflected XSS vulnerabilities, making it difficult to come up with an example that does not appear unnecessarily contrived. That does not mean that encoding should not be used - untrusted data should still be encoded as a defense in depth measure.\r\n\r\n## Solution Example ##\r\n\r\nInclude the AntiXSS namespace:\r\n\r\n\tusing System.Web.Security.AntiXss;\r\n\r\nCreate an encode object and use it to encode untrusted data before rendering it to the client:\r\n\r\n\tAntiXssEncoder encoder = new AntiXssEncoder();\r\n\tString safeText = AntiXssEncoder.HtmlEncode(Request.Form[\"text\"],false);\r\n\tLiteral1.Text = safeText;\r\n\r\nThe HtmlEncode function encodes for the HTML context. The other supported contexts are: XML, CSS and URL. Use the corresponding method to encode for these contexts. For example, to encode for the URL context:\r\n\r\n\tAntiXssEncoder encoder = new AntiXssEncoder();\r\n\tString safeText = AntiXssEncoder.UrlEncode(untrustedData,false);\r\n\r\n## Additional Resources ##\r\n\r\n* To download the Anti-XSS library, go to [https://www.nuget.org/packages/AntiXSS/](https://www.nuget.org/packages/AntiXSS/)\r\n\r\n---\r\nAdapted from Microsoft patterns & practices guidance. "
        ]
      }
    ]
  }
}