{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "2023216636",
      "Content_Hash": "1053050880"
    },
    "Metadata": [
      {
        "Id": [
          "25d6522f-77d2-4f08-abee-88247a7b4118"
        ],
        "Id_History": [
          "25d6522f-77d2-4f08-abee-88247a7b4118,79767bfe-fefc-435a-9b34-780af44dd82e,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use C++ Exceptions Where Possible"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use C++ Exceptions Where Possible"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Use structured exception handling and catch exception conditions. Do not rely on function return codes to perform all error handling. </p>\n  <h1>Why</h1>\n  <p>The classic approach for error handling has been to use the codes that functions return in order to evaluate the success or failure of certain operations. However, with a nontrivial function call hierarchy, this approach clutters the code significantly. Every function must check the return code of every function call it makes and take care of errors. In most cases, the function will merely pass any errors back up to its caller. Complex applications may have several hundred internal functions and a call hierarchy many levels deep, so this approach is difficult to maintain. Using exception handling simplifies and de-clutters the application code, which improves robustness and avoids leaving your application in an inconsistent state that may lead to information disclosure. It also helps protect your application from denial of service attacks. </p>\n  <h1>When</h1>\n  <p>Use structured exceptions whenever erroneous or exceptional conditions can be raised in a given program. It is reasonable to expect that if a function is capable of raising an exception, it eventually will. All exceptions must be handled.</p>\n  <h1>How</h1>\n  <p>There are three types of sections necessary to effectively utilize exception handling; Try represents some code which needs to trap errors. Any methods that are called that can raise exceptions should be declared within a try block. Catch the place where specific exceptions are handled. Finally the place where cleanup from raised exceptions should go. Fortunately, exception handling syntax and behavior is similar across most modern programming languages. </p>\n  <h1>Related Items</h1>\n  <ul>\n      <li>\n        <a href=\"/article/e4a3052e-13f2-4062-9a83-49185ff14b0a\">Centralize Error Handling</a>\n      </li>\n  </ul>"
        ]
      }
    ]
  }
}