{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "810231475",
      "Content_Hash": "-72196778"
    },
    "Metadata": [
      {
        "Id": [
          "29d960c8-3bc8-469b-957e-b6845a00f02d"
        ],
        "Id_History": [
          "29d960c8-3bc8-469b-957e-b6845a00f02d,43fa3bed-18e8-41d7-9a46-4445e7822bb9,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Isolate Applications Using Medium Trust in Hosted Environments"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Isolate Applications Using Medium Trust in Hosted Environments"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Isolate multiple applications on a shared server from one another and from shared system resources by using the Medium trust policy setting in the machine-level config file. </p>\r\n  <h1>Why</h1>\r\n  <p>If a hosted, malicious application is&nbsp;able to read another application's data or interfere with another application in any way, the integrity of all accessible applications on the server has effectively&nbsp;been compromised. Applications in a hosted environment should not trust each other, and lacking enforcement of application&nbsp;isolation prevents applications from effectively protecting themselves.</p>\r\n  <h1>When</h1>\r\n  <p>Whenever multiple applications operate in a shared hosting environment, use&nbsp;the medim trust&nbsp;&nbsp;privilege level to&nbsp;isolate the applications&nbsp;from each other. If your application needs operations that are not available in medium trust such as event log access, or file I/O, create a custom trust policy rather then&nbsp;elevating privilege&nbsp;to&nbsp;a higher policy level. Medium trust is appropriate when the following permission are not required or needs restricted permission&nbsp;for application's operating capablities:</p>\r\n  <ul>\r\n    <li>\r\n      <strong>OleDbPermission</strong>. This means the application does not use the ADO.NET managed OLE DB data provider to access databases. However, the application can use the managed SQL Server provider to access SQL Server databases. <li><strong>EventLogPermission.</strong>&nbsp;This means the application does not use the Windows event log. <li><strong>ReflectionPermission</strong>. This means the application&nbsp;does not&nbsp;use reflection. <li><strong>RegistryPermission.&nbsp;</strong>This means the application does not access the registry. <li><strong>WebPermission</strong> is restricted. This means the application&nbsp;communicate only with an address&nbsp;or range of addresses that you define in the <strong>&lt;trust&gt;</strong> element. <li><strong>FileIOPermission</strong> is restricted. This means the application access files only in your application's virtual directory hierarchy. Your application performs Read, Write, Append, and PathDiscovery operations in its&nbsp;virtual directory hierarchy. <li>The application does not call&nbsp;unmanaged code <li>The application does not use enterprise services</li></li></li></li></li></li></li></li>\r\n  </ul>\r\n  <h1>How</h1>\r\n  <p>To enforce Medium trust for all Web applications on a server, use the following configuration in the machine-level Web.config file :</p>\r\n  <pre>&lt;location allowOverride=\"false\"&gt;<br />&nbsp; &lt;system.web&gt;<br />&nbsp;&nbsp; &lt;trust level=\"Medium\" originUrl=\"\" /&gt;<br />&nbsp; &lt;/system.web&gt;<br />&nbsp;&lt;/location&gt;</pre>\r\n  <h1>Related Rules</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/5a4ca787-30a1-487c-be5d-9d849aaaca36\">Choose a Trust Level that does Not Exceed the Application's Requirements</a>\r\n      <li>\r\n        <a href=\"/article/743a34cc-ed5f-4550-8458-4456b9da9bf1\">Do Not Allow Developers to Change Their Application's Trust Level<br /></a>\r\n        <hr />\r\n      </li>\r\n    </li>\r\n  </ul>\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}