{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1578893525",
      "Content_Hash": "721598395"
    },
    "Metadata": [
      {
        "Id": [
          "2bc8999b-af3a-46e0-a1bf-c887cfe69f90"
        ],
        "Id_History": [
          "2bc8999b-af3a-46e0-a1bf-c887cfe69f90,758d5a83-2bfa-4644-b682-7907a9664490,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use Unique Cookie Names And Paths"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Unique Cookie Names And Paths"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Use unique cookie names and paths.</p>\n  <h1>Why</h1>\n  <p>By ensuring unique names, you prevent possible problems that can occur when hosting multiple applications on the same server.&amp;nbsp; For example, if you do not use distinct names, it is possible for a user who is authenticated in one application to make a request to another application without being redirected to that application's logon page. </p>\n  <h1>When</h1>\n  <p>All applications which use cookies should use unique cookie names and paths. </p>\n  <h1>How</h1>\n  <p>Use unique <b>name</b> and <b>path</b> attribute values on the &lt;<b>forms</b>&gt; element as follows.</p>\n  <pre>&lt;forms name=\"YourAppName\"       <br />&amp;#9;path=\"/FormsAuth\" ... /&gt;  </pre>\n  <p>By ensuring unique values for the <b>name</b> and <b>path</b> attributes, you prevent possible problems that can occur when hosting multiple applications on the same server. For example, if you do not use distinct names, it is possible for a user who is authenticated in one application to make a request to another application without being redirected to that application's logon page. By using partitioning and specific paths, you can prevent the authentication ticket from being transmitted unnecessarily and thus decrease the attack window.</p>\n  <p>Cookieless sessions are generally at greater risk because the authentication ticket cannot be protected natively using mechanisms such as <b>requireSSL</b> and <b>HttpOnly</b> described earlier. Therefore, it is recommended to always use cookies for the authentication ticket instead of the query string.</p>\n  <p />\n  <hr />\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}