{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1463126606",
      "Content_Hash": "1279868326"
    },
    "Metadata": [
      {
        "Id": [
          "2efe27a3-65bb-41e3-aea4-a026dd788356"
        ],
        "Id_History": [
          "2efe27a3-65bb-41e3-aea4-a026dd788356,20a81b5f-2896-47f8-bd1d-8ca77f6c8017,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Limit Session Lifetime"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Limit Session Lifetime"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "J.D. Meier, Alex Mackman, Michael Dunner, Srinath Vasireddy, Ray Escamilla and Anandha Murukan"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Web Application</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Reduce the lifetime of sessions to mitigate the risk of session hijacking and replay attacks.</p>\r\n  <h1>Why</h1>\r\n  <p>Even when using TLS, there's still&nbsp;a risk of session hijacking and replay; there are lots of other out-of-band ways to steal session tokens.&nbsp; The shorter the session timeout, however, the less time an attacker has to capture a session cookie and use it to access your application.</p>\r\n  <h1>When</h1>\r\n  <p>All applications should consider the length of their sessions carefully, and any application protecting any sensitive information should make it as short as possible.</p>\r\n  <h1>How</h1>\r\n  <p>There are two pieces of information that need to be handled to limit the session lifetime.&nbsp; The first is the actual session cookie and the second is the server side session state.&nbsp; With most frameworks, each time the user takes an action on the site the timestamps on the session cookie&nbsp;and the corresponding field in the server-side session state&nbsp;are both reset to the current time.&nbsp; If someone attempts to use an expired cookie, the timestamp in the server-side session state for that session is checked and the request is disallowed.&nbsp; If the session is old enough that the server-side state has been deleted, it's denied immediately.&nbsp; In web farms, the timestamp may be embedded in the cookie and cryptographically signed, freeing up servers from the need to keep a single explicit session-state table.</p>\r\n  <p>Most web application frameworks will handle the details for you, so you'll only need to specify a simple timeout value.&nbsp; In some situations, you'll be able to choose whether the session timer should reset after each action (an idle timer, the default) or if it should be a single fixed timer from the initial login (an absolute timer).&nbsp; The latter is useful for fast transactions and especially security critical situations.</p>\r\n  <p>For most situations, thirty minutes is the maximum that an idle session should be accepted.&nbsp; For sites which handle sensitive information, ten minutes is more appropriate.&nbsp; If you want to allow a user to browse a site and let sessions sit for long periods of time and retain a customized experience, you can seperate out the cookies that control site customization from those that control access to more sensitive information or functionality; the customization cookies can be persisted while the actual session is expired.</p>\r\n  <h1>Problem Example</h1>\r\n  <p>A web site uses the default (one hour) session time set by their web application framework.&nbsp; When a user in an internet cafe forgets to log off, an attacker using the machine after them can browse to the site and use the old session to gain access to the victim's sensitive information.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>A web site locks down its session timeouts to ten minutes, overriding the default set by their web application framework.&nbsp; When a user in an internet cafe forgets to log off, an attacker using the machine after them cannot browse to the site and use the old session to gain access to the victim's sensitive information, because the session has already expired.</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information see, \"Chapter 4 - Design Guidelines for Secure Web Applications\" at <a href=\"http://msdn2.microsoft.com/en-us/library/aa302420.aspx\">http://msdn2.microsoft.com/en-us/library/aa302420.aspx</a>&nbsp;&nbsp; </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}