{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-778273655",
      "Content_Hash": "536224132"
    },
    "Metadata": [
      {
        "Id": [
          "322f3f59-a0bc-4056-9657-3d3ac2a60140"
        ],
        "Id_History": [
          "322f3f59-a0bc-4056-9657-3d3ac2a60140,3cefc86c-f65f-47d2-af07-948ca14fe5d9,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Log Authentication Events"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Log Authentication Events"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Log authentication events.</p>\r\n  <h1>Why</h1>\r\n  <p>Logging authentication events helps detect suspicious behavior, such as an attacker trying to guess passwords. </p>\r\n  <h1>When</h1>\r\n  <p>All systems that implement user authentication should log authentication events.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to assure that your application logs authentication events:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify authentication events.</strong> Make a list of authentication events that may occur when using your application. Typical authentication events include: </p>\r\n      <ul>\r\n        <li>Successful or failed authentication <li>Password changes <li>Account lockouts <li>User creation or removal <li>Changes in user privilege level, such as assigning a user to the Administrators group </li></li></li></li></li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Identify code that is used for authentication.</strong> Use the list of authentication events to find functions that are responsible for those events.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Identify the logging subsystem.</strong> The logging subsystem should provide an API that allows generating log entries from application code. If this API or the logging subsystems don't exist, it is recommended to write them. PHP provides a function for generating log entries, however writing a custom logging subsystem helps make sure that all the relevant event details are always logged. Make a list of functions that may be used to generate log entries and collect documentation about how to use them.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Add code that generates log entries.</strong> Use the list of functions that perform authentication and add code to each one to generate log entries. Generate log entries for both successful and failed events. Use the list of functions in the logging subsystem when adding code that generates log entries.</p>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about the <em>error_log</em> function, see <a href=\"http://www.php.net/manual/en/function.error-log.php\">http://www.php.net/manual/en/function.error-log.php</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}