{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "32928544",
      "Content_Hash": "2014112758"
    },
    "Metadata": [
      {
        "Id": [
          "3d7d45c7-5ec0-4531-b989-802d2678210c"
        ],
        "Id_History": [
          "3d7d45c7-5ec0-4531-b989-802d2678210c,46687152-2611-4851-a622-2cfff66ea09e,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Use the Correct Algorithm And Correct Key Size"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use the Correct Algorithm And Correct Key Size"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "J.D. Meier, Alex Mackman, Michael Dunner, Srinath Vasireddy, Ray Escamilla and Anandha Murukan"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>\n      <div>Web Application</div>\n    </li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Examine what algorithms your application uses and for what purpose and ensure that correct algorithm and correct key sizes are being used.</p>\n  <h1>Why</h1>\n  <p>Cryptography only provides real security if it is used appropriately and the right algorithms are used for the right job. The strength of the algorithm is also important.&nbsp; Larger key sizes result in improved security, but performance suffers. Stronger encryption is most important for persisted data that is retained in data stores for prolonged periods of time.</p>\n  <h1>When</h1>\n  <p>If your application uses cryptography to provide security, examine what algorithm and key size it uses and the way it is used.</p>\n  <h1>How</h1>\n  <p />It is important to make sure you choose the right algorithm for the right job and to make sure you use a key size that provides a sufficient degree of security. Larger key sizes generally increase security. The following list summarizes the major algorithms together with the key sizes that each uses: <ul><li>Data Encryption Standard (DES) 64-bit key (8 bytes) <li>TripleDES 128-bit key or 192-bit key (16 or 24 bytes) <li>Rijndael 128-256 bit keys (16-32 bytes) <li>RSA 384-16,384 bit keys (48-2,048 bytes) </li></li></li></li></ul><p>For large data encryption, use the TripleDES symmetric encryption algorithm (also&nbsp;called Triple Data Encryption Algorithm, TDEA) . For slower and stronger encryption of large data, use Rijndael,&nbsp;also known as Advanced Encryption Standard(AES). As per NIST&nbsp;recomendations, 192-256-bit AES&nbsp;keys are required for highly sensitive data.&nbsp;&nbsp;To encrypt data that is to be stored for short periods of time, you can consider using a faster but weaker algorithm such as DES. For digital signatures, use Rivest, Shamir, and Adleman (RSA) or Digital Signature Algorithm (DSA). NIST guidelines suggest that 15360-bit RSA keys are equivalent&nbsp;to 256-bit symmetric keys in strength. For hashing, use the Secure Hash Algorithm (SHA)1.0. For keyed hashes, use the Hash-based Message Authentication Code (HMAC) SHA1.0.</p><h1>Additional Resources</h1><ul><li>For more information see, \"Chapter 4 - Design Guidelines for Secure Web Applications\" at <a href=\"http://msdn2.microsoft.com/en-us/library/aa302420.aspx\">http://msdn2.microsoft.com/en-us/library/aa302420.aspx</a></li></ul><h1>&nbsp;</h1><hr /><p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}