{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1786424123",
      "Content_Hash": "-933526436"
    },
    "Metadata": [
      {
        "Id": [
          "3ed07c79-09ef-41c6-a443-3bcda17eb189"
        ],
        "Id_History": [
          "3ed07c79-09ef-41c6-a443-3bcda17eb189,de6c34c9-dd27-496c-95cf-adc27a14d0fe,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Instrument Access to Significant Business Logic"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Instrument Access to Significant Business Logic"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* ASP.NET\r\n\r\n## What to Do ##\r\n\r\nUse ASP.NET health monitoring to track significant business operations, and instrument your application to record access to particularly sensitive methods and business logic.\r\n\r\n\r\n## Why ##\r\n\r\nLogging access to business logic is vital for the enforcement of many business rules. Logging can be a key component of fraud prevention and dispute resolution. Furthermore, its vital to forensics work when determining if a break-in is about to occur or has occurred and what damage may have been done. ASP.NET health monitoring provides a well integrated, easy to use, and easy to manage built-in logging framework.\r\n\r\n\r\n## When ##\r\n\r\nThe determining factor for logging is what you need to be able to recreate later, and all applications have a core set of actions which matter from a business perspective. What actions in the system must be nonrepudiatable and unforgeable? What actions need to be tracked? Interfaces which allow users to take these actions are primary candidates for logging.\r\n\r\n\r\n## How ##\r\nLogging access to business logic is easy. The following steps walk you through the process:\r\n\r\n1. **Identify significant business logic in your application.** In order to properly log business activity, you first must understand what the important activities that your application performs are, and what their logging needs are. This information should come directly from the business requirements of an application (and should be added to the requirements documentation for the application if it's not present). If you don't have a good breakdown of business activities for the application, the requirements modeling phase of a threat model is a good way to generate one. \r\n2. **Determine what level of logging each activity requires.** How much information you need to log about each activity depends on what you need to be able to say about an occurence of the activity after the fact. There are three rough levels of logging, namely tracking, verification, and non-repudiation, each of which has an increasing requirement for what needs to be logged.\r\n\t* Logging for tracking. Logging for tracking purposes is appropriate when you only need to provide statistical data about transactions -- frequency, timing, etc. As the statistics need to be accurate, per-event logging is still appropriate, particularly if flexibility is desired in the actual statistics to be gathered.\r\n\t* Logging for verification. Verification is slightly more in depth; all relevent basic information about the transaction should be recorded. The goal of logging at this level is to provide a full record of transactions, sufficient to manually re-create the transaction. This is the default level to log at for most business logic.\r\n\t* Logging for nonrepudiation. Nonrepudiation is a significantly higher standard. The goal here is to ensure that, if one of the parties to a transaction disputes the transaction, proof of the validity of the transaction can be produce. Being able to provide this proof is an architecture-level issue, which will have implications for many security-relevant design issues, especially authentication, but the issue is fundamentally a logging one. The hard part for nonrepudiation is ensuring that sufficient data exists within the system. Log files designed to support nonrepudiation should include all data related to the transaction. This data should ideally include cryptographic signatures, and should itself be signed to prevent tampering, and stored securely.\r\n3. **Ensure that all ways of accessing that logic are logged with sufficient data.** Once you know all of the pieces of logic which need to have their access logged, and what levels they need to be logged at, you need to enumerate all of the ways of accessing those pieces of logic. For most applications, there will be a single entry point for any given piece of logic, but more complicated applications may have more than one entry point. Also, logging on multiple levels provides a form of defense in depth, in case higher levels of functionality are circumvented. N-tier systems are a good example of this -- while the normal entry point may be through a web front-end, logging at the middleware and database layers is very important in detecting circumvention of the normal entry point. When you do have multiple levels of logging, or even multiple non-hierarchical systems working together, it's vital that business-level logging provide a way of unifieing those disparate data sources into a single view. By default, health monitoring is enabled for ASP.NET applications and all Web infrastructure error events (inheriting from System.Web.Management.WebErrorEvent) and all audit failure events (inheriting from System.Web.Management.WebFailureAuditEvent) are written to the event log. The default configuration is defined in the <healthMonitoring> element in the machine-level Web.config file. To audit additional events, you create custom event types by deriving from one of the built-in types. The health monitoring feature has built-in providers that allow you to log events in an e-mail message (SimpleMailWebEventProvider, TemplatedMailWebEventProvider), to SQL Server (SqlWebEventProvider), to the event log (EventLogWebEventProvider), as ASP.NET trace output (TraceWebEventProvider), or to the Windows Management Instrumentation (WMI) Web event provider (WMIWebEventProvider). You can configure health monitoring in the machine or application Web.config file to modify the events that are logged and the way in which they are logged. In-database logging can be implemented either inside the stored procedures which you use to interact with the data, or via triggers. Logging via triggers may be preferable in some cases, because alterations to the data which occur outside of stored procedures (say, via a SQL injection vulnerability) will still be logged. Care should be taken when implementing in-database logging to ensure that the process which is normally generating the log entries cannot overwrite them.\r\n\r\n4. **Ensure that logs are monitored.** The next step is ensuring that logs are monitored and the information in them acted upon. Logging won't do any good if the results never see the light of day. Work with the operations team who will be managing the application to define a plan for monitoring and responding to log events. Depending on the environment, you may need to define this from scratch, or you may be fitting into a pre-exisiting framework.\r\n\r\n5. **Avoid pitfalls for logging.** Logging information at the business level is harder than providing implementation level logs, like logs of specific function calls, web server traffic, or database queries. Ensuring all of these disparate sources of information work together to provide a coherent view of business level events while still allowing the component implementation-level log entries that make up those events to be easily found is not an easy task. Depending on the complexity of your application, this level of logging integration may not be necessary -- if it's possible to easily determine which business event a given database query is part of, for instance, you probably don't need to automate this sort of thing. Larger and more complex applications, however, do require this sort of logging coordination. Logging too much information can end up being a problem of its own. Once you have an idea of the volume of log events that you're seeing from your application, it may be worthwhile to implement some form of log throttling to reduce the flow of information to a rate at which you can act upon. Good log throttling should only eliminate redundant information and should provide a way to surface the most important information first. Automatically taking action based on detection of anomolous conditions is a very dangerous thing to do, and is best avoided. While it may be reasonable to throttle the speed at which an event (say, a login attempt) may occur, preventing an action from occurring may result in an easy-to-launch denial of service attack against your application.\r\n\r\n---\r\nAdapted from Microsoft patterns & practices guidance."
        ]
      }
    ]
  }
}