{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "557159289",
      "Content_Hash": "-675094088"
    },
    "Metadata": [
      {
        "Id": [
          "419bd265-9b0e-44ee-be61-d32dcb1672cc"
        ],
        "Id_History": [
          "419bd265-9b0e-44ee-be61-d32dcb1672cc,53452170-1816-4fd5-80d6-997528e38189,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "1sink junk Encrypt Sensitive Cookie State"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Encrypt Sensitive Cookie State"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "J.D. Meier, Alex Mackman, Michael Dunner, Srinath Vasireddy, Ray Escamilla and Anandha Murukan"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>\r\n      <div>Web Application</div>\r\n    </li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Cookies that contain sensitive data, such as a user name or a role list, should be encrypted.</p>\r\n  <h1>Why</h1>\r\n  <p>Cookie data can be changed at the client or it can be captured and changed as it is passed over the network.</p>\r\n  <h1>When</h1>\r\n  <p>When passing sensitive data, such as session identifiers, using parameters such as query strings, cookies, and view state between client and server.</p>\r\n  <h1>How</h1>\r\n  <p>Cookies may contain sensitive data such as session identifiers or data that is used as part of the server-side authorization process. To protect this type of data from unauthorized manipulation, use cryptography to encrypt the contents of the cookie.</p>\r\n  <p>If your application passes sensitive data in parameters such as query strings or form fields, examine why your application favors this approach over the much more secure approach of passing a session identifier (for example, in an encrypted cookie). Use this information to associate the session with the state of a user that is maintained in the state store on the server. Consider the following review points: </p>\r\n  <ul>\r\n    <li>\r\n      <b>Do you encrypt cookies with sensitive data?</b>\r\n      <p>If your application uses a cookie that contains sensitive data, such as a user name or a role list, make sure it is encrypted. </p>\r\n      <li>\r\n        <b>Do you pass sensitive data in query strings or Form fields?</b>\r\n        <p>This is not recommended because there is no easy way to prevent the manipulation of data in query strings or form fields. Instead, consider using encrypted session identifiers and store the sensitive data in the session state store on the server. </p>\r\n        <li>\r\n          <b>Do you protect view state?</b>\r\n          <p>If your Web pages or controls use view state to maintain state across HTTP requests, check that the view state is encrypted and checked for integrity with message authentication codes (MACs). You can configure this at the machine level or on a page-by-page basis. </p>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ul>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information see, \"Chapter 4 - Design Guidelines for Secure Web Applications\" at <a href=\"http://msdn2.microsoft.com/en-us/library/aa302420.aspx\">http://msdn2.microsoft.com/en-us/library/aa302420.aspx</a>&amp;nbsp; </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance.</p>"
        ]
      }
    ]
  }
}