{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "360311650",
      "Content_Hash": "130279952"
    },
    "Metadata": [
      {
        "Id": [
          "441b4138-1866-442f-8abb-6d05236d6fcb"
        ],
        "Id_History": [
          "441b4138-1866-442f-8abb-6d05236d6fcb,384249ad-5a56-4800-a60a-51312bffe940,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Throw Exceptions from Deallocation Functions"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Don't Throw Exceptions from Deallocation Functions"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nWrite deallocation functions in such a way that they don't throw exceptions.\r\n\r\n## Why ##\r\n\r\nDeallocation functions may be called when exceptions are thrown. If a deallocation function throws an exception after being called when an exception is thrown, the program may terminate. This may result in a denial-of-service vulnerability.\r\n\r\n## When ##\r\n\r\nUse this guideline when your code includes deallocation functions that throw exceptions.\r\n\r\n## How ##\r\n\r\nPerform the following actions to assure that your deallocation functions don't throw exceptions:\r\n\r\n1. **Identify deallocation functions.** Review your code and identify all deallocation functions.\r\n\r\n2. **Search for deallocation functions that throw exceptions.** From the list of deallocation functions, identify the ones that throw exceptions.\r\n\r\n3. **Rewrite affected deallocation functions.** Rewrite the deallocation functions that throw exceptions in a way that doesn't involve throwing exceptions. This may be accomplished by simply removing code that throws exceptions from the deallocation functions. If error handling must be done based on the results of the execution of the deallocation functions, use error codes.\r\n\r\n4. **Inform the team.** Prevent future code from throwing exceptions from deallocation functions by telling the team not to do it.\r\n\r\n"
        ]
      }
    ]
  }
}