{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1817066764",
      "Content_Hash": "-2051920568"
    },
    "Metadata": [
      {
        "Id": [
          "4b9647f2-644f-48bf-b2b5-cd025261450d"
        ],
        "Id_History": [
          "4b9647f2-644f-48bf-b2b5-cd025261450d,f4698155-4d48-4a07-a859-e6876f514e04,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Secure the Account Administration Functionality"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Secure the Account Administration Functionality"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>Applications written using Servlets or JSP.</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Separate the account administration from the main application interface.</p>\n  <h1>Why</h1>\n  <p>Account administration requires higher privileges than the main application interface. Separating the two interfaces decreases the risk of a normal user being able to escalate his privileges to that of an administrator.</p>\n  <h1>When</h1>\n  <p>If your application has an administrative interface, use this guideline to separate it from the main application interface.</p>\n  <h1>How</h1>\n  <p>Use the following steps when designing an administrative interface:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Only privileged users can administer all accounts. </strong>Design your application such that the administrative module is separate from the main application interface. Since the separation requires using separate authentication mechanisms&amp;nbsp;for the application and administration, there is a reduced risk&amp;nbsp;of escalation-of-privilege attacks. </p>\n    </li>\n    <li>\n      <p>\n        <strong>Users may be allowed to administer their own accounts. </strong>It may be necessary to allow users to administer their own accounts. This involves the ability to change passwords, account details, etc. Such administration can be done through the main application interface. Because the user is modifying sensitive data, extra security precautions must be enforced:</p>\n      <ul>\n        <li>\n          <strong>Track userID at the server-side</strong>: The user should always be tracked at the server-side. Store the userID inside a session. The only data the client needs to know is the session identifier. This reduces the risk of an attacker modifying another user's account information. </li>\n        <li>\n          <strong>Force re-authentication</strong>: Enforce re-authentication when modifying the user's password. This helps verify that the user is aware of the password change and is not a victim of a session hijacking. <br /></li>\n        <li>\n          <strong>Modify accounts in sections</strong>: Do not modify all account information at once. Split the account modification procedure in sections. For example, group the account information into credentials, personal data, contact information and additional information. Modifying the account information in groups reduces the risk of information leakage when the user is updating his/her account. </li>\n        <li>\n          <strong>Use TLS when modifying&amp;nbsp;accounts</strong>: The use of TLS provides encryption when transmitting sensitive data over the network. TLS also certifies the authenticity of the application against the user.</li>\n      </ul>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}