{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "682219670",
      "Content_Hash": "-627456581"
    },
    "Metadata": [
      {
        "Id": [
          "4be4ed09-ed2f-4f05-9e63-e20708807542"
        ],
        "Id_History": [
          "4be4ed09-ed2f-4f05-9e63-e20708807542,6641957f-cfeb-4cbe-809b-bc599fe2c8ce,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use Type Safe SQL Parameters When Constructing SQL Queries"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Type Safe SQL Parameters When Constructing SQL Queries"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Use type-safe parameters when constructing dynamic SQL queries or when passing parameters to stored procedures. </p>\r\n  <h1>Why</h1>\r\n  <p>If you use the Parameters collection, SQL treats the input is as a literal value rather then as executable code. The Parameters collection can be used to enforce type and length constraints on input data. Values outside of the range trigger an exception. If type safe SQL parameters are not used, attackers might be able to execute injection attacks that are embedded in the unfiltered input.</p>\r\n  <h1>When</h1>\r\n  <p>This guideline is applicable whenever there is an SQL statement that is built dynamically. It is also appropriate whenever stored procedures are utilized.</p>\r\n  <h1>How</h1>\r\n  <p>One way of making the application less susceptible to SQL injection attacks is by using stored procedures. Stored procedures are subroutines stored in the database that are available to applications for accessing the data. </p>\r\n  <p>Just using stored procedures isn't a complete remedy for SQL injection. The important thing to do is use parameters with stored procedures, else, your stored procedures can be susceptible to SQL injection if they use unfiltered input. Stored procedures provide several security advantages:</p>\r\n  <ul>\r\n    <li>By parameterizing input parameters and type enforcing them, user input is effectively filtered </li>\r\n    <li>Stored procedures are allowed to execute under different security privileges from the database user by most databases, thereby restricting the ability of the application to do anything beyond the actions specified in the stored procedures. For instance, an application would have execute access to a stored procedure, but no access to the base tables.</li>\r\n  </ul>\r\n  <p>To use type safe SQL parameters, follow these steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>If possible, use stored procedures.</strong> Stored procedures are pre-compiled statements that are stored on the database server. Using stored procedures improves your application's performance and security. <br /></p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Determine the parameters in the SQL query or stored procedure being constructed.</strong> All parameters that result from user input or another untrusted source should be escaped, by specifying variable names in the query:</p>\r\n      <pre>SELECT * from books WHERE ISBN = '@isbn'</pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Declare the explicit data types for each parameter in the SQL statement.</strong> When executing the SQL statement, specify the data type and length for each parameter in the query:</p>\r\n      <pre>myCommand.SelectCommand.Parameters.Add(\"@isbn\", SqlDbType.VarChar, 10);</pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Specify the value for each parameter.</strong> The untrusted input is then specified, so that it can be properly handled when the SQL statement executes:</p>\r\n      <pre>myCommand.SelectCommand.Parameters[\"@isbn\"].Value = '0494483923';</pre>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>Consider an ASP.NET application that handles employee payroll functionality for a small company. One of the pages requires retrieving an employee record from a table based on a username and password supplied via a login dialog. The developer of the application created an SQL SELECT query to accomplish said task:</p>\r\n  <pre>using (SqlConnection myConnection = new SqlConnection(connectionString))<br /><pre>SqlConnection myConnection = new SqlConnection(\"Data Source=localhost\\\\sqlexpress;<br />\t\t\t\t\t\tInitial Catalog=EmployeePayroll;<br />\t\t\t\t\t\tIntegrated Security=True\");<br />string SQLstr = \"SELECT * from users WHERE username = '\" + un.Text + <br />\t\t\t\t\t\t\t\"' AND password = '\" + <br />\t\t\t\t\t\t\tpass.Text + \"'\";</pre><pre>SqlCommand myCommand = new SqlCommand(SQLstr, myConnection);<br />SqlDataAdapter myDataAdapter = new SqlDataAdapter(myCommand);<br />myCommand.Connection.Open();<br />SqlDataReader myReader = myCommand.ExecuteReader();<br /></pre></pre>\r\n  <p>In the preceding example, the SELECT statement will work as expected, assuming that the input is perfectly constrained. However, what happens if a user enters unexpected input such as '1234' for a password, and this for a username:</p>\r\n  <pre>mjones' AND 1=1; -- </pre>\r\n  <p>This will result in the SQL statement being executed at the database level:</p>\r\n  <pre>SELECT * from users WHERE username = 'mjones' AND 1=1; --'  AND password = '1234';</pre>\r\n  <p>This will allow the person entering data into the dialog box to select the account details of mjones without the correct password.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>Consider an ASP.NET application that handles employee payroll functionality for a small company. One of the pages requires retrieving an employee record from a table based on a username and password supplied via a login dialog. The developer of the application uses the following SQL query to take advantage of type safe parameters with the SqlParameterCollection when constructing the query dynamically:</p>\r\n  <pre>\r\n    <pre>using System.Data;<br />using System.Data.SqlClient;   </pre>\r\n    <pre>using (SqlConnection connection = new SqlConnection(connectionString))<br />{<br />&nbsp; DataSet userDataset = new DataSet();<br />&nbsp; SqlDataAdapter myDataAdapter = new SqlDataAdapter(<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \"SELECT * from users WHERE username = '@uname' AND password = '@pwd'\", connection);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br />&nbsp; myCommand.SelectCommand.Parameters.Add(\"@uname\", SqlDbType.VarChar, 24);<br />&nbsp; myCommand.SelectCommand.Parameters.Add(\"@pwd\", SqlDbType.VarChar, 16);<br />  myCommand.SelectCommand.Parameters[\"@uname\"].Value = un.Text;<br />  myCommand.SelectCommand.Parameters[\"@pwd\"].Value = pass.Text;<br />&nbsp; myDataAdapter.Fill(userDataset);<br />}  </pre>\r\n  </pre>\r\n  <p>In the preceding code example, the input values are constrained for length and escaped. If the data does not conform to the type or length defined by the parameter, the SqlParameter class throws an exception.</p>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}