{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "626668172",
      "Content_Hash": "1603769713"
    },
    "Metadata": [
      {
        "Id": [
          "4f3147c2-7ca1-487c-9144-56630e5a6f80"
        ],
        "Id_History": [
          "4f3147c2-7ca1-487c-9144-56630e5a6f80,0180bd3c-1b98-4832-8ddf-f3aa7b7eb97b,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Automatically Lock Inactive User Accounts"
        ],
        "Category": [
          "Authorization"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Automatically Lock Inactive User Accounts"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## What to Do ##\r\n\r\nAutomatically lock inactive user accounts. Log the instance when accounts have been locked.\r\n\r\n\r\n## Why ##\r\n\r\nInactive user accounts increase the attack surface of the application and can be used by an attacker as a means of entry.\r\n\r\n\r\n## When ##\r\n\r\nDesign your application so that inactive user accounts can be detected and locked. After deployment, set the system to lock inactive accounts after an appropriate amount of time.\r\n\r\n\r\n## How ##\r\n\r\nUse the following steps when locking inactive user accounts:\r\n\r\n1. **Set a lockout policy.** Create the application's lockout policy. Determine the necessary duration of inactivity before an account can be locked/disabled. This policy can vary depending on whether the account is of a normal user or an administrator. Make sure to comply with any regulatory requirements.\r\n\r\n2. **Keep track of user inactivity.** Establish a mechanism to keep track of the last successful authentication. Successful authentication can be tracked via logs or timestamps, which reside in the user store. \r\n\r\n3. **Set a lockout mechanism.** Establish a mechanism to verify the current period of inactivity and automatically set the disabled bit for inactive accounts. Using the application or database server's scheduler, activate such functionality to run during the hours with least user activity. Keep in mind that inactive accounts should be disabled, but not removed until it is confirmed that they should be completely removed. "
        ]
      }
    ]
  }
}