{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "192150980",
      "Content_Hash": "-1099234054"
    },
    "Metadata": [
      {
        "Id": [
          "56a1ea9e-8981-4315-a048-127a2bea2285"
        ],
        "Id_History": [
          "56a1ea9e-8981-4315-a048-127a2bea2285,3164051a-2755-4cbd-88f6-aa306403510e,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "0sink junk Monitor the Use of Privileged Accounts"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Monitor the Use of Privileged Accounts"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Closely monitor the use of privileged accounts so that suspicious activity can be detected promptly.</p>\r\n  <h1>Why</h1>\r\n  <p>Privileged accounts by their nature are allowed to do potentially damaging activities. If compromised, they can cause the most damage. Close monitoring can catch unauthorized and/or malicious activities and help minimize the damage done.</p>\r\n  <h1>When</h1>\r\n  <p>If your application supports privileged accounts that enable potentially dangerous activities, ensure they can be easily monitored for malicious activity.</p>\r\n  <h1>How</h1>\r\n  <p>To monitor privileged accounts, use the following steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the privileged users. </strong>For the purposes of security monitoring, privileged accounts are those that can cause more damage than other users. This will vary by application and roles defined, however some examples are: Administrator, Power user, Team leader</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Ensure there are auditing mechanisms in place. </strong>Place logging mechanisms on functionality that is unique to privileged users. This will ensure there is a record of administrative activities by privileged users. Examples of such areas include: Project management, User management, Global application management.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is a multi-user financial application. The application records all basic security related operations for all users. Unfortunately, it fails to monitor all authorizations that accompany the transactions of large financial assets, an action for which a privileged account is needed. Therefore it is impossible to trace such financial fraud to the responsible user.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>MyApp is a multi-user financial application. The application records all basic security related operations for all users and monitors closely the activities that require a privileged account. If there is a financial fraud involving the transaction of large financial assets, the application can identify the user that authorized the transaction.</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance.</p>"
        ]
      }
    ]
  }
}