{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1386994888",
      "Content_Hash": "408329902"
    },
    "Metadata": [
      {
        "Id": [
          "5cc75586-f379-4b52-9b9f-365f6e470b68"
        ],
        "Id_History": [
          "5cc75586-f379-4b52-9b9f-365f6e470b68,4393276b-786e-4740-abf8-6920c8d363c0,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Encrypt Off-site Backups"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Encrypt Off-site Backups"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Encrypt off-site backups. Encrypt and store keys separately.</p>\n  <h1>Why</h1>\n  <p>Off-site backups should be encrypted to protect them if they are physically stolen. Encryption keys should be encrypted and stored separately to make sure that if the data backups are stolen, the attackers don't have the keys to go with them.</p>\n  <h1>How</h1>\n  <p>To protect off-site backups:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify data to backup. </strong>Make a list of assets that should be backed up off-site.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Choose an encryption mechanism.</strong> Choose a software suite to use for encrypting off-site backups.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Establish key management.</strong> Define key management procedures for managing encryption keys used to protect off-site backups.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Choose an off-site storage location for the data.</strong> Choose a safe location for off-site backups. One example is a safe deposit box</p>\n    </li>\n    <li>\n      <p>\n        <strong>Choose an off-site storage location for the keys.</strong> Choose a safe location for storing keys for off-site backups, separately from the backups themselves. One example is a safe deposit box. Make sure to store the encryption keys at a separate location from the encrypted backups.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Encrypt and backup data.</strong> Establish a schedule for backing up data and encrypting the backups. Make sure that key management procedures are followed - keys are changed and backed up as necessary. Take the encrypted backups to the off-site storage location.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Encrypt and backup encryption keys.</strong> Establish a schedule for backing up and storing the encryption keys used to encrypt off-site backups. Take the encryption keys to an off-site location separate from the backups themselves.</p>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}