{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1947872593",
      "Content_Hash": "-537941120"
    },
    "Metadata": [
      {
        "Id": [
          "5f6a8e60-f809-4038-a725-c5019f1dc993"
        ],
        "Id_History": [
          "5f6a8e60-f809-4038-a725-c5019f1dc993,c1cbc787-ba81-477c-8fce-c3c57a45cf26,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Validate Input from All Sources"
        ],
        "Category": [
          "Input and Data Validation"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Validate Input from All Sources"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Treat input from all external sources as untrusted and apply input validation techniques.</p>\r\n  <h1>Why</h1>\r\n  <p>Input that is not validated can lead to cross-site scripting, SQL injection, directory traversals, and other vulnerabilities that would allow an attacker to gain unauthorized access to sensitive data or otherwise compromise an application.</p>\r\n  <h1>When</h1>\r\n  <p>Treat all input as untrusted. If you have established trust boundaries for your application, validate data every time it crosses a trust boundary.</p>\r\n  <h1>How</h1>\r\n  <p>An application can take input via various ways: file system, other software running on the server, etc. Use the following steps to establish a validation strategy:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all sources of input:</strong> Establish your application's trust boundary. The general notion is that all input not generated by your application is untrusted. Enumerate all possible sources of input and make note of the expected input from these sources. An application can have various sources of input. Each of these sources is an entry point to your application and can potentially be used to break your application's security model. Place a content specific validator at each entry point.</p>\r\n      <p>Potential sources of input in a web application typically include:</p>\r\n      <ul>\r\n        <li>URL based parameters </li>\r\n        <li>Form based parameters </li>\r\n        <li>Hidden fields </li>\r\n        <li>Cookies </li>\r\n        <li>HTTP headers </li>\r\n        <li>Data stored on the local file system </li>\r\n        <li>Database </li>\r\n        <li>Other related services</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Understand the input that your application can handle and process:</strong> Understand the specifics about your application's input. After identifying the different entry points, define the format and type of input that will be provided through each entry point. Build a validator for every format and type of expected input.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Create a set of validators:</strong> Centralize your application's validators as it helps strengthen the code by limiting the amount of scattered validation code throughout your application. Place the set of validators on your application's trust boundary. Your application should accept input from the outside world only through its set of validators.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>In the following code, a page accepts a query string parameter called <strong>isbn</strong>. The value of this variable is used to look up a book in the database using an unmanaged middle-layer.</p>\r\n  <pre>&lt;script language=\"C#\" runat=\"server\"&gt;<br />    protected void Page_Load(object sender, EventArgs e)<br />    {<br />        String strIsbn = this.Request.QueryString[\"isbn\"];<br />        //lookup isbn in a database using an<br />        //unamanged middle layer<br />    }<br />&lt;/script&gt;</pre>\r\n  <p>In this example, the middle layer may be prone to malicious attacks as the value of ISBN is not validated. he length of the string is not limited, which could lead to a buffer overflow in the unmanaged middle layer, and it may not be in the correct format, which could cause a middle layer string parser to crash, allow for format string attacks, SQL injection, or a host of other issues.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>In the following code, a page accepts a query string parameter called isbn. The value of this variable is used to look up a book in the database using an unmanaged middle layer. The code uses regular expressions to validate the query string string value. This ensures that the value supplied by the client is in the correct format by checking the length of the string and the characters used.</p>\r\n  <pre>&lt;script language=\"C#\" runat=\"server\"&gt;<br />    protected void Page_Load(object sender, EventArgs e)<br />    {<br />        String strIsbn = this.Request.QueryString[\"isbn\"];<br />        if (Regex.IsMatch((strIsbn), @\"(?=.{13}$)\\d{1,5}([- ])\\d{1,7}\\1\\d{1,6}\\1(\\d|X)$\"))<br />        {<br />            //lookup isbn in a database using an<br />            //unamanged middle layer<br />        }<br />        else<br />        {<br />            //display error<br />        }<br />    }<br />&lt;/script&gt;</pre>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}