{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "57904042",
      "Content_Hash": "2019588026"
    },
    "Metadata": [
      {
        "Id": [
          "63e628e0-c4bb-42c5-a549-7cd112cad81e"
        ],
        "Id_History": [
          "63e628e0-c4bb-42c5-a549-7cd112cad81e,4ca60a48-402c-49bb-9f4a-30907bf940f6,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Enforce Strong SQL Passwords"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Enforce Strong SQL Passwords"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "1"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Enforce strong passwords when the application connects to a backend database server.</p>\r\n  <h1>Why</h1>\r\n  <p>Enforcing strong passwords minimizes the risk of a dictionary attack against accounts on the database server.</p>\r\n  <h1>When</h1>\r\n  <p>If your application uses a backend database server.</p>\r\n  <h1>How</h1>\r\n  <p>When possible, avoid using a password at all, and authenticate to the database using Windows authentication.</p>\r\n  <p>If SQL Authentication must be used, use these guidelines to construct a password policy:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Define password requirements.</strong> Pick the schema that all passwords must follow and check them for length and certain characteristics. Some commonly agreed upon characteristics for strong passwords are:</p>\r\n      <ol>\r\n        <li>Should be atleast 8 characters in length </li>\r\n        <li>Should include at least one numeric and one special character </li>\r\n        <li>Should be changed every 90 days</li>\r\n      </ol>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Enforce password requirements.</strong> The password requirements should be enforced while creating and modifying accounts.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is a multi-user financial tool. Unfortunately, it does not enforce strong passwords for its database access. The administrator, tired of having to deal with a long password for the database server, sets it to a simple password and doesn't change it. The database server, although protected against outside attack, isn't properly segmented from the internal network, and an inside attacker discovers it and starts trying to crack the password. The Credentials Brute Force Attack succeeds, allowing the attacker access to the database server and the confidential data stored on it. Because the password was simply guessed, there was little other evidence of an attack, and it was not detected for some time.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>MyApp is a multi-user financial tool. Because it enforces strong passwords for its database access, no account on the SQL Server can have a weak password. Although the administrator wants to set a shorter password, the system won't accept it. Even though the server isn't properly segmented from the internal network, the inside attacker who discovers it is unable to compromise the server, as she cannot guess the password.</p>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}