{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-539196830",
      "Content_Hash": "-1618209344"
    },
    "Metadata": [
      {
        "Id": [
          "692215af-bca6-46b8-b237-7a7480ee65dd"
        ],
        "Id_History": [
          "692215af-bca6-46b8-b237-7a7480ee65dd,0bb25235-d56a-447d-88ac-cb77916d5935,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Use Pointer Arithmetic Correctly"
        ],
        "Category": [
          "Unmanaged Code"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Pointer Arithmetic Correctly"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>C&#43;&#43;</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>When using pointers as integers for addressing, make sure the arithmetic is correct.</p>\r\n  <h1>Why</h1>\r\n  <p>Miscalculations in pointer arithmetic may result in buffer overflows, which may allow an attack to execute arbitrary code.</p>\r\n  <h1>When</h1>\r\n  <p>Pay careful attention to the arithmetic when using pointers as integers.</p>\r\n  <h1>How</h1>\r\n  <p>Pointer arithmetic means using a pointer as an integer and adding some number to it to address another location in memory. This is most commonly used as a pointer to an array, where the pointer is incremented to address the sequential elements in the array. The only mathematical operator available for pointer arithmetic is addition. The challenge here is that incrementing a pointer by one actually increments its value by the size of the type of the variable it points to. For example, if a pointer points to an array of four-byte wide objects, incrementing the pointer by one programmatically actually increases its value by four. This is important, because a common mistake is to increment pointers by multiples of the size of the object programmatically, which results in miscalculations and buffer overflows.</p>\r\n  <h1>Problem Example</h1>\r\n  <pre>int buffer&#91;10&#93;;<br />int &#42;pointer = buffer;</pre>\r\n  <pre>&#42;pointer &#43;= 9&#42;sizeof(buffer);<br />&#42;buffer = 0;</pre>\r\n  <p>Here, the pointer is incremented by 9 times the size of an integer programmatically. This is wrong, because the compiler will automatically multiple that value by the size of an integer, resulting in a miscalculation and a 0 being written to some unexpected memory address.</p>\r\n  <h1>Solution Example</h1>\r\n  <pre>int buffer&#91;10&#93;;<br />int &#42;pointer = buffer;</pre>\r\n  <pre>&#42;pointer &#43;= 9;<br />&#42;buffer = 0;</pre>\r\n  <p>Here, the pointer is incremented by 9 programmatically. This is correct, because the compiler will automatically multiply 9 by the size of the integer and the program will write 0 to an array element during run-time.</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about pointer arithmetic, please see \"EXP08-CPP. Ensure pointer arithmetic is used correctly\" at <a href=\"https://www.securecoding.cert.org/confluence/display/cplusplus/EXP08-CPP.&#43;Ensure&#43;pointer&#43;arithmetic&#43;is&#43;used&#43;correctly\">https://www.securecoding.cert.org/confluence/display/cplusplus/EXP08-CPP.&#43;Ensure&#43;pointer&#43;arithmetic&#43;is&#43;used&#43;correctly</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}