{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "667924885",
      "Content_Hash": "-1790055905"
    },
    "Metadata": [
      {
        "Id": [
          "70b53138-faf7-410a-a966-16f3088fca63"
        ],
        "Id_History": [
          "70b53138-faf7-410a-a966-16f3088fca63,d01bd22b-de15-49ec-93e3-7e4c59a15b5a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Minimize the Number of Times Language Boundaries Are Crossed"
        ],
        "Category": [
          "Unmanaged Code"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Minimize the Number of Times Language Boundaries Are Crossed"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* Applications written using Servlets or JSP.\r\n\r\n\r\n## What to Do ##\r\n\r\nOptimize your code in sauch a way that native code is executed as infrequently as possible.\r\n\r\n\r\n## Why ##\r\n\r\nExecuting native code forces the developer to implement extra security checks and may result in security bugs (such as buffer overflows), which would otherwise be mitigated by the Java Virtual Machine.\r\n\r\n\r\n## When ##\r\n\r\nAlways optimize your code so that native code is executed as infrequently as possible.\r\n\r\n\r\n## How ##\r\n\r\nTo minimize the number of times language boundaries are crossed:\r\n\r\n1. **Understand the functionality.** Make sure there is a clear understanding of the required functionality. Label each component as low or high level:\r\n\t* Low level: Low-level components are closely tied to the hardware and operating system. Although low-level components are commonly written in native code, Java provides support for the most basic operations such as filesystem access, sockets, etc.\r\n\t* High level: High-level components hold the business logic within an application. Their loose coupling with hardware and operating systems allows them to be implemented 100% using Java.\r\n2. **Reduce calls into native code.** Determine which functionalities should be executed in native code. Ensure that native code is called from as few locations in your application as possible. Segregate functionality that requires native code so that its use is isolated into a small number of components.\r\n\r\n\r\n## Problem Example ##\r\nThe following segment shows JNI code that utilizes a COM object. Because the code uses Java to verify the GUID's length, the application does unnecessary crossing of language boundaries by invoking Java functionality from native code, thereby disrupting the JVM's security optimization routines.\r\n\r\n~~~~\r\nJNIEXPORT jboolean JNICALL Java_Identifier_invokeObject\r\n      (JNIEnv * env, jobject jobj, jstring jguid){\r\n\r\n      ...\r\n\r\n\r\n      // The code crosses the language boundaries twice:\r\n      // get the string and get the string's length\r\n      char* temp_guid = (*env)->GetStringUTFChars(env, jguid, &iscopy);\r\n      int guid_size = (int)(*env)->GetStringLength(env, jguid);\r\n\r\n      ...\r\n}\r\n~~~~\r\n\r\n\r\n## Solution Example ##\r\n\r\nThe following segment shows JNI code that utilizes a COM object. Because the code uses C to verify the GUID's length, there is no extra crossing of language boundaries; therefore, the JVM's security optimization routines are not disrupted.\r\n\r\n~~~~\r\nJNIEXPORT jboolean JNICALL Java_Identifier_invokeObject\r\n      (JNIEnv * env, jobject jobj, jstring jguid){\r\n\r\n      ...\r\n\r\n\r\n      // The code crosses the language boundaries once:\r\n      // get the string\r\n      char* temp_guid = (*env)->GetStringUTFChars(env, jguid, &iscopy);\r\n      int guid_size = (int)strlen(temp_guid);\r\n\r\n      ...\r\n}\r\n~~~~"
        ]
      }
    ]
  }
}