{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1669830242",
      "Content_Hash": "1142863276"
    },
    "Metadata": [
      {
        "Id": [
          "7317fcb7-b91b-4184-b5e4-01a25b8baf00"
        ],
        "Id_History": [
          "7317fcb7-b91b-4184-b5e4-01a25b8baf00,b59abfa3-8714-4573-8648-6f1bcd8d21de,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Use Health Monitoring for Logging And Auditing Events"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Health Monitoring for Logging And Auditing Events"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Use ASP.NET health monitoring feature to log and audit events. </p>\r\n  <h1>Why</h1>\r\n  <p>ASP.NET health monitoring supports many standard events that you can use to monitor the health of your application. Examples of security related events that are automatically generated include logon failures and successes when using the ASP.NET membership system, attempts to tamper with or reuse forms authentication tickets, and infrastructure events such as disk access failures. </p>\r\n  <p>The health monitoring feature includes built-in providers that allow you to log events to an email message, to SQL server, to the event log, as an ASP.NET trace output, or to the Windows Management Instrumentation (WMI) web event provider.</p>\r\n  <h1>How</h1>\r\n  <p>By default, health monitoring is enabled for ASP.NET applications and all Web infrastructure error events (inheriting from <b>System.Web.Management.WebErrorEvent</b>) and all audit failure events (inheriting from <b>System.Web.Management.WebFailureAuditEvent</b>) are written to the event log.&nbsp; The default configuration is defined in the <b>&lt;healthMonitoring&gt;</b> element in the machine-level Web.config file.&nbsp; To audit additional security related events, you create custom event types by deriving from one of the built-in types. </p>\r\n  <p />The health monitoring feature has built-in providers that allow you to log events in an e-mail message (<b>SimpleMailWebEventProvider</b>, <b>TemplatedMailWebEventProvider</b>), to SQL Server (<b>SqlWebEventProvider</b>), to the event log (<b>EventLogWebEventProvider</b>), as ASP.NET trace output (<b>TraceWebEventProvider</b>), or to the Windows Management Instrumentation (WMI) Web event provider (<b>WMIWebEventProvider</b>).&nbsp; You can configure health monitoring in the machine or application Web.config file to modify the events that are logged and the way in which they are logged. <p /><hr /><p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}