{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-130933852",
      "Content_Hash": "-1303851619"
    },
    "Metadata": [
      {
        "Id": [
          "7821fd38-643c-4ae7-bb94-2c1e1d58ba1a"
        ],
        "Id_History": [
          "7821fd38-643c-4ae7-bb94-2c1e1d58ba1a,3bf3f7b6-e2ac-4bba-b8b7-880491a89765,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Prevent SQL Injection"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Prevent SQL Injection"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>To help prevent SQL injection, you should validate input and use parameterized stored procedures for data access. </p>\r\n  <h1>Why</h1>\r\n  <p>If you use the Parameters collection, SQL treats the input is&nbsp;as a literal value rather then as&nbsp;executable code. The Parameters collection can be used to enforce type and length constraints on input data. Values outside of the range trigger an exception. If&nbsp;type-safe SQL parameters are not used, attackers might be able to execute&nbsp;injection attacks&nbsp;that are embedded in the&nbsp;unfiltered input.</p>\r\n  <h1>When</h1>\r\n  <p>This guideline is applicable whenever there is an SQL statement that is built dynamically. It&nbsp;is also appropriate&nbsp;whenever stored procedures are utilized.</p>\r\n  <h1>How</h1>\r\n  <p>To use&nbsp;type-safe SQL parameters, follow these steps:</p>\r\n  <p>\r\n    <strong>1. Determine the parameters in the SQL query or stored procedure being constructed.</strong> All parameters that result from user input or another untrusted source should be escaped, by specifying variable names in the query:</p>\r\n  <blockquote>\r\n    <p>SELECT &#42; from&nbsp;books WHERE&nbsp;ISBN = '&#64;isbn'</p>\r\n  </blockquote>\r\n  <p>\r\n    <strong>2. Declare the explicit data types for each parameter in the SQL statement.</strong> aWhen executing the SQL statement, specify the data type and length for each parameter in the query:</p>\r\n  <blockquote>\r\n    <pre>myCommand.SelectCommand.Parameters.Add(\"&#64;isbn\", SqlDbType.VarChar, 10);<br /></pre>\r\n  </blockquote>\r\n  <p>\r\n    <strong>3. Specify the value for each parameter.</strong> The untrusted input is then specified, so that it can be properly handled when the SQL statement executes:</p>\r\n  <blockquote>\r\n    <pre>myCommand.SelectCommand.Parameters&#91;\"&#64;isbn\"&#93;.Value = '0494483923';</pre>\r\n  </blockquote>\r\n  <p>Additionally, use structured exception handling to catch errors that occur during database access, and prevent them from being returned to the client. A detailed error message may reveal valuable information such as the connection string, SQL server name, or table and database naming conventions. Attackers can use this information to construct more precise attacks. </p>\r\n  <p>As an additional precaution, use a least privileged account to access the database, so that even if your application is compromised, the impact will be reduced.</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>SQL Injection at <a href=\"http://msdn.microsoft.com/en-us/library/ms161953.aspx\">http://msdn.microsoft.com/en-us/library/ms161953.aspx</a></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}