{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-47178462",
      "Content_Hash": "1468505612"
    },
    "Metadata": [
      {
        "Id": [
          "82b37aec-65f1-49d7-a0eb-548107cdd1b0"
        ],
        "Id_History": [
          "82b37aec-65f1-49d7-a0eb-548107cdd1b0,d368c671-106a-4d71-884b-066b9c4fcc00,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Separate Account Administration from the Main Application Interface"
        ],
        "Category": [
          "Administration"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Separate Account Administration from the Main Application Interface"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Separate the account administration from the main application interface.</p>\r\n  <h1>Why</h1>\r\n  <p>Account administration requires higher privileges than the main application interface. Separating the two interfaces decreases the risk of a normal user being able to escalate privileges to that of an administrator.</p>\r\n  <h1>When</h1>\r\n  <p>If your application has an administrative interface, use this guideline to separate it from the main application interface.</p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps when designing an administrative interface:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Allow only privileged users to administer all accounts.</strong> Design your application such that the administrative module is separate from the main application interface. Using separate authentication mechanisms in the application and the administration interface will reduce the risk for escalation of privilege attacks. Even if a privileged user account is compromised via session hijacking in the main application interface, the attacker will not be able to access the administrative interface and compromise other user accounts.</p>\r\n      <p>Use session IDs for the administrative module that are different than the session IDs for the main interface. Modify the <em>cookieName</em> attribute inside the <em>sessionState</em> element of the respective <em>web.config</em> to differentiate the session names for each interface. Example:</p>\r\n      <pre>&lt;system.web&gt;<br /> ...<br /> &lt;sessionState cookieName=\"MyAppAdminSess\" /&gt;<br /> ...<br />&lt;/system.web&gt;</pre>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Allow users to administer their own accounts. </strong>It may be necessary to allow users to administer their own accounts. This involves the ability to change passwords, account details, etc. Such administration can be done through the main application interface. Because the user is modifying sensitive data, extra security precautions must be enforced:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Track the user ID on the server-side</strong>: The user should always be tracked on the server-side. Store the user ID inside a session. The only data the client needs to know is the session identifier. This reduces the risk of an attacker modifying another user's account information. </li>\r\n        <li>\r\n          <strong>Force re-authentication</strong>: Enforce re-authentication when modifying the user's password. This helps verify that the user is aware of the password change and is not a victim of a session hijacking.&amp;nbsp; </li>\r\n        <li>\r\n          <strong>Modify account in sections</strong>: Do not modify all account information at once. Split the account modification procedure in sections. For example, group the account information into credentials, personal data, contact information, and additional information. Modifying the account information in groups reduces the risk of information leakage when the user is updating his or her account. </li>\r\n        <li>\r\n          <strong>Use TLS when modifying account</strong>: The use of TLS provides encryption when transmitting sensitive data over the network and verifies the authenticity of the application to the user. </li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following snippet shows the HTTP requests that an administrator makes when accessing the main and administrative interfaces of the application. Because the administrative interface is not separated from the application, an administrator can use a single session to use and administer the application. Therefore, a vulnerability such as cross-site scripting in the main application interface will expose the administrative interface as well.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>The following snippet shows the HTTP requests that an administrator makes when accessing the main and administrative interfaces of the application. Because the administrative interface is separated from the application via server directory and server port, an administrator would need to use two distinct sessions to use and administer the application. Therefore a vulnerability such as cross-site scripting in the main application interface will not expose the administrative interface.</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}