{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1427510093",
      "Content_Hash": "1648943287"
    },
    "Metadata": [
      {
        "Id": [
          "87afcdc0-00f4-402c-8baf-73e1da59ba85"
        ],
        "Id_History": [
          "87afcdc0-00f4-402c-8baf-73e1da59ba85,89c6ce65-5712-45e8-a62f-1c0a9adbde75,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Keep Up with Security Updates"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Keep Up with Security Updates"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Keep up with security updates.</p>\n  <h1>Why</h1>\n  <p>Software patches should be installed to protect from known and actively exploited vulnerabilities.</p>\n  <h1>How</h1>\n  <p>To keep up with security updates:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify software packages that may need updating.</strong> Make a list of all software packages that may need updating, including operating systems, servers, user applications, and code libraries.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify update sources.</strong> For each software package that may need updating, identify the source of vendor-supplied updates. Identify the schedule used by the vendor to release updates; typically vendors release patches on a set schedule or whenever new vulnerabilities are discovered. Make a list of all sources for software updates with notes on when new updates may be available.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Establish patching documentation.</strong> Start a document to keep track of installed patches and any issues that may crop up. Every now and again, a vendor patch may break something or fail to install correctly. Document these situations and the solutions. It is important to record the time when patches are installed.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Establish a process for installing updates.</strong> Schedule periodic checks for new security updates. If possible, time these checks to match the vendor release schedules. Go through the list of vendor sources, check for new patches, download and install them, and document the process.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Delegate responsibility.</strong> Once the process for installing updates and the documentation are established, delegate responsibility for these tasks to a system administrator.</p>\n    </li>\n  </ol>\n  <br />"
        ]
      }
    ]
  }
}