{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-535263433",
      "Content_Hash": "-838424558"
    },
    "Metadata": [
      {
        "Id": [
          "8f39bcc9-619b-479e-94b7-af822c7cc5fe"
        ],
        "Id_History": [
          "8f39bcc9-619b-479e-94b7-af822c7cc5fe,53dfe157-f705-48a4-b108-c14c25e5ab07,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Use Page ViewState User Key to Prevent CSRF"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Page ViewState User Key to Prevent CSRF"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\r\n  <ul>\r\n    <li>ASP.NET 4.0</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Use page ViewState user key to&nbsp;prevent Cross-Site Request Forgery vulnerabilities.&nbsp;</p>\r\n  <h1>Why</h1>\r\n  <p>A&nbsp;CSRF attack consists of posting a malicious HTTP form to a known, vulnerable Web site.&nbsp;This allows an attacker to perform any action caused by the vulnerable form with the credentials of the victim. <em>ViewStateUserKey</em> makes it much harder for hackers to use the content of the client-side view state to prepare malicious posts against the site. Each time a form is invoked, a unique key is generated. The key contains encrypted time and session information, and the form submission is rejected if it is used in another session or after the session timeout has expired. </p>\r\n  <h1>When</h1>\r\n  <p>All forms which require authentication&nbsp;should be protected with a <em>ViewStateUserKey</em>.&nbsp;Furthermore, if a form triggers important functionality but does not require authentication, it should also be protected—a good example would be a financial transaction.</p>\r\n  <h1>How</h1>\r\n  <p>The&nbsp;following code added to each&nbsp;of your pages will set the key based on SessionID.</p>\r\n  <pre>void Page_Init (object sender, EventArgs e)<br />{<br />   ViewStateUserKey = Session.SessionID;<br />}</pre>\r\n  <p>Alternatively, you can add this code to the <em>OnInit</em> virtual method of the <em>Page</em>-derived class.&nbsp;(Note that you must set this property in the <em>Page.Init</em> event).&nbsp;This will allow you to write the code once rather than per page.</p>\r\n  <pre>protected override OnInit(EventArgs e)<br />{<br />   base.OnInit(e);<br />   ViewStateUserKey = Session.SessionID;<br />}</pre>\r\n  <p>Setting <em>ViewStateUserKey</em> to a constant string—the same for all users—is like leaving it blank.&nbsp; You must set it to something that varies for each user—user ID or, better yet, session ID.&nbsp; For a number of technical and social reasons, session ID is a much better fit because a session ID is unpredictable, times out, and varies on a per-user basis. </p>\r\n  <h1>Problem Example</h1>\r\n  <p>An e-commerce web site stores all of their customer's billing information and allows them to order merchandise by submitting a single simple form with the item number, quantity, and shipping address.&nbsp;The form is completely static, allowing an attacker who can lure a logged-in user into submitting a form request on the attacker's behalf to order arbitrary items on the victim's account.&nbsp;</p>\r\n  <h1>Solution Example</h1>\r\n  <p>An e-commerce web site stores all of their customer's billing information and allows them to order merchandise by submitting a single simple form with the item number, quantity, and shipping address.&nbsp;The form uses a <em>ViewStateUserKey</em> set to the session ID, ensuring that even if an attacker can lure a logged-in user into submitting a form on their behalf, the attacker will be unable to construct a valid form submission.&nbsp;</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}