{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-565394683",
      "Content_Hash": "1868016318"
    },
    "Metadata": [
      {
        "Id": [
          "91b4d456-79cf-4da6-afee-23f8e5d8c7b3"
        ],
        "Id_History": [
          "91b4d456-79cf-4da6-afee-23f8e5d8c7b3,78c0c312-e456-4cbd-8914-8c2e09614bff,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "0sink editme Lock Accounts After Consecutive Failed Login Attempts"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Lock Accounts After Consecutive Failed Login Attempts"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Consider locking users' accounts after several consecutive failed login attempts. Keep in mind that a locked account can result in a denial of service vulnerability. Depending on the needs of your application, you may instead want to implement a progressive slowdown in the authentication response.</p>\r\n  <h1>Why</h1>\r\n  <p>Multiple consecutive failed authentication attempts over a short period of time are an indication of a brute force attack on that account. Locking the account prevents an attacker from compromising and accessing the account, at the expense of a denial of service condition for the legitimate account owner.</p>\r\n  <h1>When</h1>\r\n  <p>Any password based system should consider locking accounts after multiple repeated login failures. Applications that have a high attack profile may instead a progressive slowdown in the authentication response.</p>\r\n  <h1>How</h1>\r\n  <p>Use the following steps to successfully lock accounts after consecutive failed login attempts:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Determine a lockout policy: </strong>There are two variables to consider when determining a lockout policy:</p>\r\n      <ul>\r\n        <li>Number of allowed consecutive failed login attempts </li>\r\n        <li>Amount of time that a locked account will remain locked</li>\r\n      </ul>\r\n      <p>A simple policy would be to lock an account after 5 failed login attempts for the duration of 15 minutes. Although this is an effective method for blocking a brute force attack, it exposes your application to denial of service as an attacker can easily keep an account locked through a small stream of authentication requests. When determining the lockout policy, it is important to evaluate the risk of attacks against the user and the support costs associated with reactivating a locked account. For example, requiring the user to contact your organization's support personnel to reactivate a locked account will have a direct impact on support costs and would add general user frustration. Add extra care when designing more sophisticated variations, such as correlating a single or multiple user login attempts with a source IP, of your application's lockout policy. When adding extra levels of complexity, carefully consider and evaluate the scenarios where your application's lockout policy can be circumvented, or can harm your business. For instance, consider scenarios where an attacker would attempt to compromise a user through the use of multiple hosts, or multiple users would authenticate using a shared office IP.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Enforce the lockout policy:</strong> The lockout policy should be enforced at all points in the application where authentication is necessary. If your application uses membership providers, specify the following attributes in your provider's configuration: </p>\r\n      <ul>\r\n        <li>\r\n          <strong>maxInvalidPasswordAttempts</strong>: provides the maximum number of invalid password attempts before an account is locked out </li>\r\n        <li>\r\n          <strong>passwordAttemptWindow</strong>: provides the time window, in minutes, during which a user must successfully authenticate without reaching the maximum allowed authentication attempts </li>\r\n        <li>\r\n          <strong>passwordAnswerAttemptLockoutDuration</strong>: if supported by the membership provider, this attribute specifies the duration of a lockout due to invalid password attempts</li>\r\n      </ul>\r\n      <p>Example:</p>\r\n      <pre>&lt;membership defaultProvider=\"SqlProvider\" userIsOnlineTimeWindow=\"30\"&gt;<br />  &lt;providers&gt;<br />    &lt;add name=\"MyAppMembershipProvider\"<br />      type=\"System.Web.Security.SqlMembershipProvider\"<br />      connectionStringName=\"MyAppMembershipDatabase\"<br />      enablePasswordRetrieval=\"false\"<br />      enablePasswordReset=\"true\"<br />      requiresQuestionAndAnswer=\"true\"<br />      passwordFormat=\"Hashed\"<br /><strong>      maxInvalidPasswordAttempts = \"4\"<br /></strong><strong>passwordAttemptWindow = \"10\"<br /></strong>      applicationName=\"MyApp\" /&gt;<br />  &lt;/providers&gt;<br />&lt;/membership&gt;</pre>\r\n      <p>Be aware that the standard .NET membership providers handle user passwords as System.string objects, which are immutable and can expose your application's user accounts. <br /></p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following code executes a database transaction that is required during authentication. Because the transaction fails to check the login attempts counter, it may be possible for an attacker to compromise an account through the use of a brute force or a dictionary attack.</p>\r\n  <pre>&lt;membership defaultProvider=\"SqlProvider\" userIsOnlineTimeWindow=\"30\"&gt;<br />  &lt;providers&gt;<br />    &lt;add name=\"MyAppMembershipProvider\"<br />      type=\"System.Web.Security.SqlMembershipProvider\"<br />      connectionStringName=\"MyAppMembershipDatabase\"<br />      enablePasswordRetrieval=\"false\"<br />      enablePasswordReset=\"true\"<br />      requiresQuestionAndAnswer=\"true\"<br />      passwordFormat=\"Hashed\"<br />      applicationName=\"MyApp\" /&gt;<br />  &lt;/providers&gt;<br />&lt;/membership&gt;</pre>\r\n  <h1>Solution Example</h1>\r\n  <p>The following code executes the database transaction that is required during authentication. Because the transaction checks the login attempts counter, it would be very expensive for an attacker to compromise an account through the use of brute force or a dictionary attack.</p>\r\n  <pre>&lt;membership defaultProvider=\"SqlProvider\" userIsOnlineTimeWindow=\"30\"&gt;<br />  &lt;providers&gt;<br />    &lt;add name=\"MyAppMembershipProvider\"<br />      type=\"System.Web.Security.SqlMembershipProvider\"<br />      connectionStringName=\"MyAppMembershipDatabase\"<br />      enablePasswordRetrieval=\"false\"<br />      enablePasswordReset=\"true\"<br />      requiresQuestionAndAnswer=\"true\"<br />      passwordFormat=\"Hashed\"<br /><strong>      maxInvalidPasswordAttempts = \"4\"<br /></strong><strong>passwordAttemptWindow = \"10\"<br /></strong>      applicationName=\"MyApp\" /&gt;<br />  &lt;/providers&gt;<br />&lt;/membership&gt;</pre>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}