{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "212202878",
      "Content_Hash": "1440825065"
    },
    "Metadata": [
      {
        "Id": [
          "93a54578-f9ad-414c-8f19-2ef7fbb53b7e"
        ],
        "Id_History": [
          "93a54578-f9ad-414c-8f19-2ef7fbb53b7e,2fce4ff7-a688-425b-88ee-cefe5f134d40,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Identify Security Objectives"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Identify Security Objectives"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Define security objectives and requirements early in the application development process. Security objectives are goals and constraints that affect the confidentiality, integrity, and availability of your data and application.</p>\n  <h1>Why</h1>\n  <p>Identification of security objectives is the first, best step you can take to help ensure the security of your application. The objectives, once created, can be used to direct all the subsequent security activities that you perform. Security objectives do not remain static, but are influenced by later design and implementation activities.</p>\n  <h1>When</h1>\n  <p>Security objectives should be identified as early in the development process as possible, ideally in the requirements and analysis phase. The objectives, once created, can be used to direct all the subsequent security activities that you perform. Security objectives do not remain static, but are influenced by later design and implementation activities.</p>\n  <h1>How</h1>\n  <p>Identifying security objectives is an iterative process that is initially driven by an examination of the application&#8217;s requirements and usage scenarios. By the end of the requirements and analysis phase, you should have a first set of objectives that are not yet tied to design or implementation details. During the design phase, additional objectives will surface that are specific to the application architecture and design. During the implementation phase, you may discover a few additional objectives based upon specific technology or implementation choices that have an impact on overall application security. </p>\n  <p>Each evolution of the security objectives will affect other security activities. You should review the threat model, architecture and design review guidelines, and general code review guidelines when your security objectives change.</p>\n  <p>Use the following techniques to help you discover security objectives:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Roles Matrix.</strong> When an application supports multiple roles it is important to understand what each role should be allowed to do. This can be accomplished with a roles matrix that contains privileges in rows and roles in columns. Once the roles matrix has been created, you can generate security objectives to ensure the integrity of the application&#8217;s roles mechanism. Many systems have multiple roles and privileges that can be assigned flexibly to any role. In this case your objectives need to be more general.</p>\n      <li>\n        <p>\n          <strong>Derive From Functional Requirements.</strong> You can generate security objectives by examining every functional requirement in your application through the lens of confidentiality, integrity, and availability (CIA). This provides a very effective mechanism for generating security objectives based on known application characteristics.</p>\n      </li>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}