{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-92120899",
      "Content_Hash": "-1703878237"
    },
    "Metadata": [
      {
        "Id": [
          "9cb2d7b6-3657-4330-89d6-71cd9475675a"
        ],
        "Id_History": [
          "9cb2d7b6-3657-4330-89d6-71cd9475675a,78140d89-3458-47f6-b94f-ecd1bbc69d93,"
        ],
        "Library_Id": [
          "26bd1a04-beed-4a66-917d-b6ab0a7d634c"
        ],
        "Title": [
          "Log Unusual Activity"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Log Unusual Activity"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\n  <ul>\n    <li>ASP.NET 4.0</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Log unusual activity.</p>\n  <h1>Why</h1>\n  <p>Unusual activity may be an indication that an attack is in progress.</p>\n  <h1>How</h1>\n  <p>Perform the following actions to implement logging of unusual activity:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Define unusual activity.</strong> Make a list of events that constitute unusual activity. Some examples are: </p>\n      <ul>\n        <li>Repeated failed authentication attempts <li>Invalid logical access attempts <li>Failed password reset attempts <li>Suspicious financial transactions <li>Unauthorized data access <li>Suspicious database queries that may indicate SQL injection attempts</li></li></li></li></li></li>\n      </ul>\n      <li>\n        <p>\n          <strong>Identify relevant code.</strong> Use the list of unusual activity indicators to find code that implements the functionality for each unusual activity. Make a list of functions that implement the related functionality. One common area for detecting suspicious activity is authentication code.</p>\n        <li>\n          <p>\n            <strong>Identify the logging subsystem.</strong> The logging subsystem should provide an API that allows generating log entries from application code. If this API or the logging subsystems don't exist, write them. Make a list of functions that may be used to generate log entries and collect documentation about how to use them.</p>\n          <li>\n            <p>\n              <strong>Log unusual activity.</strong> Use the list of functions that are related to suspicious events from step 2 to add code that generates log entries when suspicious activity occurs. Use the list of logging APIs from step 3 to write code that generates log entries.</p>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ol>"
        ]
      }
    ]
  }
}