{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1896711120",
      "Content_Hash": "219574683"
    },
    "Metadata": [
      {
        "Id": [
          "9f17de24-ab94-45c7-9d85-3695c8026c72"
        ],
        "Id_History": [
          "9f17de24-ab94-45c7-9d85-3695c8026c72,16f25e1b-431b-43b0-a136-3e4e206ce5d4,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Use Windows Authentication When You Can"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "WCF"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Windows Authentication When You Can"
        ],
        "Tag": [
          "WCF 3.5"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "J.D. Meier, Jason Taylor, Prashant Bansode, Carlos Farre, Madhu Sundararajan, Rob Boucher, Steve Gregersen"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Microsoft&#174; Windows Communication Foundation (WCF) 3.5 <li>Microsoft Visual Studio&#174; 2008</li></li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Consider using Windows Authentication when you could.</p>\r\n  <h1>Why</h1>\r\n  <p>By using Windows authentication with Active Directory, you benefit from a unified identity store, centralized account administration, enforceable account and password policies, and strong authentication that avoid sending passwords over the network.</p>\r\n  <h1>When</h1>\r\n  <p>When your have users belonging to Windows Active Diretory, consider using Windows Authentication.</p>\r\n  <h1>How</h1>\r\n  <p>Use Windows authentication in the following scenarios: </p>\r\n  <ul>\r\n    <li>When both the client and service are in trusted domains, such as in an Intranet scenario. By using Windows authentication with Active Directory, you benefit from a unified identity store, centralized account administration, enforceable account and password policies, and strong authentication that avoid sending passwords over the network. <li>When service uses a local machine accounts, in this case client can authenticate using NTLM protocol. Consider NTLM is not secured, opening avenue for man in the middle attacks where the hash password send in the wire can be compromised by brute force attacks. While windows authentication can be used without active directory, consider using more secure methods like certificate authentication.</li></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}