{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1012591185",
      "Content_Hash": "-746723733"
    },
    "Metadata": [
      {
        "Id": [
          "a0ff8de9-7a67-43f2-a64e-9efde8115b6d"
        ],
        "Id_History": [
          "a0ff8de9-7a67-43f2-a64e-9efde8115b6d,e0b22801-fa8b-48db-bb9d-cf0480d18011,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Sanitize All Displayed Untrusted Data"
        ],
        "Category": [
          "Encoding"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Sanitize All Displayed Untrusted Data"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Escape HTML special characters in all user input that is displayed on web pages. </p>\r\n  <h1>Why</h1>\r\n  <p>It is important to properly encode all user-controlled data before it is outputted to a dynamically generated Web page. If data is not encoded then it will make its way to the browser in its original representation, which could be executable script code, causing the browser to interpret and run it. The most common case is of user-controlled input making its way into plain HTML; in this case it should be HTML-encoded before being inserted into the page.</p>\r\n  <h1>How</h1>\r\n  <p>To escape HTML characters in user input:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all pages that display data entered by users.</strong> Enumerate all the pages in the application. Make a list of all the pages that display user input.</p>\r\n      <li>\r\n        <p />\r\n        <strong>Use <em>htmlentities()</em> whenever displaying data entered by users.</strong> Review each page that displays data entered by users. Verify that PHP code in each page uses <em>htmlentities()</em> to escape special characters in user input before displaying it to the user, like this:<pre> echo htmlentities(&#36;userinput);</pre><p>where <em>&#36;userinput</em> is a string that contains user input.</p><li><p><strong>Define your own, non-HTML special characters, if tags are required for user input.</strong> Many interactive web applications offer the users functionality to post links, images and other content that requires special tags to be rendered correctly. One solution is to define a custom syntax specific for your application to allow users to post rich content. One common solution is to use square brackets, such as &#91;&#93;, instead of the &lt;&gt; brackets used by HTML, and then translate the &#91;&#93; brackets into &lt;&gt; when rendering user input. This approach requires positive input validation to be safe.</p><li><p><strong>Write a parser for handling non-HTML special characters, if tags are required for user input.</strong> Use positive input validation to make sure that only allowed tags are rendered. For example, a user may be allowed to display bold text by using a &#91;b&#93; tag, instead of HTML &lt;b&gt;. The parser should then be allowed to only translate the square brackets into &lt;&gt; if the only thing inside the brackets is \"b\". Writing such a parser is application-specific and non-trivial - a lot of care has to be taken when writing this parser to prevent XSS vulnerabilities.</p></li></li></li>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about the <em>htmlentities</em> function, please see <a href=\"http://ie2.php.net/htmlentities\">http://ie2.php.net/htmlentities</a></li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/18bb5583-773d-450c-a072-55f0c026ba99\">All Displayed Untrusted Data Is Sanitized</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}