{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "800778074",
      "Content_Hash": "-847806716"
    },
    "Metadata": [
      {
        "Id": [
          "a4d509b6-9f86-4ce7-a05a-96c87ca5f50d"
        ],
        "Id_History": [
          "a4d509b6-9f86-4ce7-a05a-96c87ca5f50d,76e02621-2ab5-43d6-83ea-61ab97b068b5,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use a Least Privileged Account for Running Applications"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use a Least Privileged Account for Running Applications"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<br />\r\n  <h1>What to Do</h1>\r\n  <p>Use an account with the minimum privilege level necessary to run an ASP.Net application.</p>\r\n  <h1>Why</h1>\r\n  <p>The principle of least privilege is a ubiquitous security concept. Applying this principle to running applications reduces the damage an attacker can do if the application gets compromised.</p>\r\n  <h1>When</h1>\r\n  <p>All ASP.NET web applications should run at minimum privilege levels.</p>\r\n  <h1>How</h1>\r\n  <p>ASP.NET runs with the following configuration:</p>\r\n  <ul>\r\n    <li>IIS 6 and later: Applications run inside an application pool using the least privileged Network Service account. If you need to use a custom service account to run your ASP.NET Web application, create a least-privileged account. You might need to create a custom service account to isolate your application from other applications on the same server or to be able to audit each application separately. </li>\r\n  </ul>\r\n  <p>To create a least privileged account:</p>\r\n  <ol>\r\n    <li>\r\n      <p>Create a local or domain Windows account.</p>\r\n    </li>\r\n    <li>\r\n      <p>Run the following <strong>aspnet_regiis.exe</strong> utility to assign the relevant ASP.NET permissions to the account:</p>\r\n      <blockquote>\r\n        <pre>aspnet_regiis.exe -ga machineName\\userName </pre>\r\n      </blockquote>\r\n      <p>On Windows Server, running the <strong>aspnet_regiis.exe -ga</strong> command will add the account to the IIS_WPG group. The IIS_WPG group provides the <strong>log on as a batch job</strong> user right and ensures that the necessary file system permissions are granted.</p>\r\n    </li>\r\n    <li>\r\n      <p>Use the Local Security Policy tool to grant the <strong>deny logon locally</strong> user right to the Windows account. This reduces the privileges of the account and prevents anyone logging onto Windows locally with the account.</p>\r\n    </li>\r\n    <li>\r\n      <p>If your application is hosted on IIS 6, use IIS Manager to create an application pool running under the new account's identity and assign your ASP.NET application to the pool.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>MyApp is an HR application that uses the company's shares to store its documents. The application is operating with a privilege set that exceeds the minimum set of privileges necessary for it to complete its tasks. Using a canonicalization attack, an intruder exploits the application's report download feature and is able to gain access to important company records that would otherwise only be available to senior members of the staff.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>MyApp is an HR application that uses the company's shares to store its documents. The application is operating with the minimum set of privileges necessary for it to complete its tasks. Using a canonicalization attack, an intruder exploits the application's report download feature and is able to gain access to arbitrary files on the company's share. Because of the application's account privileges, the intruder is only able to access files that are available to MyApp, but nothing more.</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance.</p>"
        ]
      }
    ]
  }
}