{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1148688328",
      "Content_Hash": "-1570652385"
    },
    "Metadata": [
      {
        "Id": [
          "a880d974-3543-4190-ae63-ea7e8ac11d0a"
        ],
        "Id_History": [
          "a880d974-3543-4190-ae63-ea7e8ac11d0a,4a91fe9d-0f2e-46ec-85b3-1bc258eec7ad,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Disclose Valuable Information in Error Messages"
        ],
        "Category": [
          "Error and Exception Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Disclose Valuable Information in Error Messages"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies To</h1>\n  <ul>\n    <li>ASP.NET 4.0</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Ensure that all error messages are generic and do not disclose any valuable or sensitive information. All error messages should take care to not disclose any information that could be useful to an attacker.</p>\n  <h1>Why</h1>\n  <p>Attackers often probe web applications for error messages as a first attempt to understand the underlying technologies in place. An attacker will look for discrepancies between error messages to discover when different code paths are being taken or to discover information about the quality of their input. Error messages that are directly echoed from backend systems such as SQL or OS error messages can help a malicious user choose their next attacks.</p>\n  <h1>When</h1>\n  <p>Whenever an error message has to be relayed to a user.</p>\n  <h1>How</h1>\n  <p>Use the following steps to make sure that valuable information is not disclosed via error messages:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Ensure all error messages are generic.</strong> Make sure no error message displays too much information about the quality of the data being processed or what mechanisms are being used to process the data. For example, an error message such as &#8220;the input contains invalid characters&#8221; is much more secure than \"the input cannot contain '&lt;' or '&gt;' characters\".</p>\n      <li>\n        <p>\n          <strong>Be careful with dynamically generated error messages.</strong> Dynamic error messages are difficult to get right and should not be used unless absolutely necessary. If they must be used, be sure the error message cannot aid an attacker in any way. Dynamically generated error messages may open the application up for other vulnerabilities, such as SQL injection, Buffer Overflows or Cross Site Scripting.</p>\n        <li>\n          <p>\n            <strong>Make sure debug information is not echoed to the user.</strong> Debug information can be generated but should be logged to a database with write only permissions that is accessible only by an administrator.</p>\n          <li>\n            <p>\n              <strong>Display only basic authentication failure messages.</strong> For authentication error messages be sure to choose a single error message to be displayed on all authentication failures. Ensure that the same generic error message is displayed any time a user fails to authenticate for any of the following reasons:</p>\n            <ul>\n              <li>Invalid username<li>Valid username, but invalid password<li>Account locked</li></li></li>\n            </ul>\n            <li>\n              <p>\n                <strong>Set customErrors to \"RemoteOnly\" or \"On\" in the web.config file.</strong> ASP.NET allows you to specify a custom error message instead of an error message that describes the error in detail. Leaving customErrors=\"Off\" means that an attacker will see a complete stack trace as well as a highly detailed error message generated by the .NET runtime or other backend systems.</p>\n              <li>\n                <p>\n                  <strong>Ensure error messages reporting the same message are exactly the same.</strong> Multiple error messages may be compared to discover more information about the system. Individually the error message may not display sensitive information, but when compared side by side they may aid an attacker. Error messages may differ in language or punctuation, but these differences will tell an attacker different code paths are being taken. Using a common error resource file can make reporting the same error message from multiple locations much easier. Create a common error resource file that links error text with an error number, this way when a certain error happens it can simply look up the error text in the error message resource file, which ensures the same message will be used in all places.</p>\n              </li>\n            </li>\n          </li>\n        </li>\n      </li>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>The following code authenticates a user. Unfortunately, the code reveals through its error messages whether the credentials sent represent a valid user or an invalid user:</p>\n  <pre>public void login()<br />&#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; if (&#33;validUser())<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; throw new Exception(\"User not found.\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#125;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; if (&#33;validPass())<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; throw new Exception(\"Wrong password.\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#125;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; commit();<br />&#125;</pre>\n  <h1>Solution Example</h1>\n  <p>The following code authenticates a user. Since it presents the same error message regardless of why the authentication failed, an attacker can't determine if the credentials tried represent a valid user or not.</p>\n  <pre>public void login()<br />&#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; if (&#33;validUser() &#124;&#124; &#33;validPass())<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#123;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; throw new Exception(\"Authentication failed.\");<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#125;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; commit();<br />&#125;</pre>\n  <h1>Additional Resources</h1>\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}