{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1512049307",
      "Content_Hash": "-311722888"
    },
    "Metadata": [
      {
        "Id": [
          "ae1f457b-c3ef-4d5f-9471-ae793137e07e"
        ],
        "Id_History": [
          "ae1f457b-c3ef-4d5f-9471-ae793137e07e,72259510-bf20-4fdc-b9ba-cc81c8d6b421,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Do Not Cache Sensitive Data"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Do Not Cache Sensitive Data"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* ASP.NET 4.0\r\n\r\n\r\n## What to Do ##\r\n\r\nASP.NET output caching is a great way to improve application performance, however, if your page contains data that is sensitive, such as a password, credit card number, or account status, the page should not be cached. ASP.NET output caching is off by default.\r\n\r\n\r\n## Why ##\r\n\r\nOutput caching is usually done on the client, and that has serious security implications if the page being cached has sensitive data. Output caching is similar in impact to storing sensitive data in cookies. The data may persist on the client machine, on proxy servers or on the web server. Due to this fact, it leaves interesting data available to attackers should the devices caching the data be compromised.\r\n\r\n\r\n## When ##\r\n\r\nIf a page displays sensitive info, ensure output caching is disabled.\r\n\r\n\r\n## How ##\r\n\r\nOutput caching is off by default and must be explicitly turned on in order to be activated. There are two ways that output caching can be turned on: high-level declarative API, or low-level programmatic API. The high-level declarative API is used by including the @OutputCache directive in the .aspx file for a page. The low-level programmatic API is used through the Page.Response.Cache property which returns an instance of the HttpCachePolicy class.\r\n\r\nUse the following steps to ensure that sensitive data is not cached:\r\n\r\n1. **Review pages for sensitive data.** Review all of your pages for instances of sensitive data. This could include, but is not limited to:\r\n\t* Information that either contains personally identifiable information or can be used to derive personally identifiable information that should not be shared with users.\r\n\t* Information that a user provides that they would not want shared with other users of the application.\r\n\t* Information that comes from an external trusted source that is not designed to be shared with users.\r\n\t* Review the pages for declarative Output Caching. Review the pages discovered in step 1 for the use of the @OutputCache directive. If it exists, remove it.\r\n2. **Review the pages for programmatic Output Caching.** Review the pages discovered in step 1 for the use of the HttpCachePolicy class. Generally this is accessed through the Page.Response.Cache property.\r\n\r\n\r\n## Problem Example ##\r\n\r\nAn ASP.NET application contains a page that asks the user for credit card information in order to complete an e-commerce transaction. For performance reasons, all pages in the application have output caching turned on through the use of the @OutputCache directive\r\n\r\n~~~~\r\n<%@ OutputCache Duration=\"60\" VaryByParam=\"None\" %>\r\n~~~~\r\n\r\nThis results in the page, including sensitive data, being cached on any HTTP 1.1 capable devices - including browsers, proxies and the web server.\r\n\r\n\r\n## Solution Example ##\r\n\r\nAn ASP.NET application contains a page that asks the user for credit card information in order to complete an e-commerce transaction. For performance reasons, almost all of the pages in the application have output caching turned on through the use of the @OutputCache directive. However sensitive pages, such as the page that includes credit card information have had the @OutputCache directive removed to prevent them from being cached on HTTP 1.1 capable devices.\r\n\r\n---\r\nAdapted from Microsoft patterns & practices guidance."
        ]
      }
    ]
  }
}