{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "372759075",
      "Content_Hash": "-936932838"
    },
    "Metadata": [
      {
        "Id": [
          "aebb10ce-aeb6-45e5-b159-e2bc76b012bf"
        ],
        "Id_History": [
          "aebb10ce-aeb6-45e5-b159-e2bc76b012bf,8db95d8f-15f5-4682-9541-fc9258c1d134,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use a Least-Privileged Account for Running Applications"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "How To"
        ],
        "DirectLink": [
          "Use a Least-Privileged Account for Running Applications"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Applications written using Servlets or JSP.</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Apply the principle of least privilege to the server account that runs Java for the web application.</p>\r\n  <h1>Why</h1>\r\n  <p>Applying the principle of least privilege to the application's server account reduces the damage potential if the application gets compromised by an attacker.</p>\r\n  <h1>When</h1>\r\n  <p>Always apply the principle of least privilege to your application's server account.</p>\r\n  <h1>How</h1>\r\n  <p>When applying the principle of least privilege to the application's server account:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the local account. </strong>Determine the local system account that will be used when running your application. Because the application is web-based, it is likely that the account is on the web server. </p>\r\n      <li>\r\n        <p>\r\n          <strong>Identify the application's requirements. </strong>Determine what access rights are required by your application. Because the application may need access to different resources such as sockets and the local filesystem, identify the resources that are essential to your application's business logic. For example, identify the local directories that should be accessed. </p>\r\n        <li>\r\n          <p>\r\n            <strong>Set the appropriate privileges. </strong>Create a role for your application by dedicating a local group to it. Once the appropriate privileges are established, set the appropriate access rights to the local system account. Any extra privileges should be revoked.</p>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following snippet shows the access rights associated with MyApp's local account as noted in the <em>/etc/passwd</em> file. Unfortunately, the local account is part of the root group; therefore, if an attacker compromises the application, he gains root privileges on the hosting server.</p>\r\n  <pre>myapp:&#33;:503:0:MyApp's account:/home/myapp:/bin/bash</pre>\r\n  <h1>Solution Example</h1>\r\n  <p>The following snippet shows the access rights associated with MyApp's local account as noted in the <em>/etc/passwd</em> file. Because the local account is in a dedicated group, compromising the application does not compromise the hosting server.</p>\r\n  <pre>myapp:&#33;:503:503:MyApp's account:/home/myapp:/bin/bash</pre>"
        ]
      }
    ]
  }
}