{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "2128132269",
      "Content_Hash": "-1370545252"
    },
    "Metadata": [
      {
        "Id": [
          "b2522586-6633-4994-a096-1ea757ce6970"
        ],
        "Id_History": [
          "b2522586-6633-4994-a096-1ea757ce6970,009e3395-8435-40d4-af6d-1a19234b417a,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Retrieve Sensitive Data on Demand"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Retrieve Sensitive Data on Demand"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "J.D. Meier, Alex Mackman, Michael Dunner, Srinath Vasireddy, Ray Escamilla and Anandha Murukan"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\n  <ul>\n    <li>Web Application&nbsp;</li>\n  </ul>\n  <h1>What to Do</h1>\n  <p>Examine how your application accesses the secrets and how long they are retained in memory in clear text form. </p>\n  <h1>Why</h1>\n  <p>Secrets should generally be retrieved on demand, used for the smallest amount of time possible, and then discarded as it include application configuration data, such as account passwords and encryption keys. Sensitive data should be stored and transmitted in encrypted form; anything less invites theft. </p>\n  <h1>When</h1>\n  <p>If your application stores secrets, review the design to make sure that it is absolutely necessary to store the secret. If the code must store a secret, then check whether it can be retrieved on demand. </p>\n  <h1>How</h1>\n  <p />The preferred approach is to retrieve sensitive data on demand when it is needed instead of persisting or caching it in memory. For example, retrieve the encrypted secret when it is needed, decrypt it, use it, and then clear the memory (variable) used to hold the plaintext secret. If performance becomes an issue, consider the following options: <ul><li><b>Cache the encrypted secret</b>. <li><b>Cache the plaintext secret</b>. </li></li></ul><h2>Cache the Encrypted Secret</h2><p>Retrieve the secret when the application loads and then cache the encrypted secret in memory, decrypting it when the application uses it. Clear the plaintext copy when it is no longer needed. This approach avoids accessing the data store on a per request basis.</p><h2>Cache the Plaintext Secret</h2><p>Avoid the overhead of decrypting the secret multiple times and store a plaintext copy of the secret in memory. This is the least secure approach but offers the optimum performance. Benchmark the other approaches before guessing that the additional performance gain is worth the added security risk.</p><h1>Additional Resources</h1><ul><li>Design Guidelines for Secure Web Applications <a href=\"http://msdn2.microsoft.com/en-us/library/aa302420.aspx\">http://msdn2.microsoft.com/en-us/library/aa302420.aspx</a><li>Architecture and Design Review for Security <a href=\"http://msdn2.microsoft.com/en-us/library/aa302420.aspx\">http://msdn2.microsoft.com/en-us/library/aa302420.aspx</a><li>Security Question List: ASP.NET 2.0 <a href=\"http://msdn2.microsoft.com/en-us/library/ms998375.aspx\">http://msdn2.microsoft.com/en-us/library/ms998375.aspx&nbsp;</a></li></li></li></ul><hr /><p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}