{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "58346279",
      "Content_Hash": "1977749432"
    },
    "Metadata": [
      {
        "Id": [
          "b5a68610-752a-4154-be82-6cbc4ab40866"
        ],
        "Id_History": [
          "b5a68610-752a-4154-be82-6cbc4ab40866,196818fe-5987-499a-b34c-6c988748f810,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Conduct Security Architecture And Design Reviews"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>There are three important aspects to conducting an architecture and design review for security:</p>\r\n  <ol>\r\n    <li>Evaluate your application architecture in relation to its target deployment environment and infrastructure.<li>Review your design choices in each of the key vulnerability categories defined by a security frame.<li>Conduct a tier-by-tier component analysis and examine the security mechanisms employed by your key components, such as your presentation layer, business layer, and data access layer.</li></li></li>\r\n  </ol>\r\n  <h1>Why</h1>\r\n  <p>If you spend time and effort at the beginning of your project to analyze and review your application architecture and design, you can eliminate design-related vulnerabilities and improve your application&#8217;s overall security. It is much easier and less expensive to fix vulnerabilities at design time than it is later in the development cycle when substantial re-engineering might be required. Use the architecture and design review as a checkpoint to ensure compliance with your team&#8217;s design guidelines. The review should cover both deployment and design considerations. By considering your design in relation to the target deployment environment and the security policies defined by that environment, you can help to ensure a smoother and more secure application deployment. Perform architecture and design reviews iteratively as your design evolves or as you learn more about the design and architecture of your applications. If your application has already been created, the architecture and design review is still an important part of the security assessment process that can help you to fix vulnerabilities and improve future designs.</p>\r\n  <h1>When</h1>\r\n  <p>Conduct security architecture and design reviews in the beginning of the project, if possible.</p>\r\n  <h1>How</h1>\r\n  <p>Use a question driven approach to expose the highest risk design decisions and use the security frame to dive into areas that reveal common mistakes. The following techniques can help to guide your approach when reviewing the architecture and design of your application:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Deployment and infrastructure.</strong> Review the design of your application in relation to the target deployment environment and the associated security policies. Consider the restrictions imposed by the underlying infrastructure layer security.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Security frame.</strong> Review the approach to critical areas in your application, including authentication, authorization, input / data validation, exception management, and other areas. Use the application vulnerability categories as a roadmap and to make sure that you do not miss any key areas during the review.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Tier-by-tier analysis.</strong> Walk through the logical tiers of your application, and evaluate security choices within your presentation, business, and data access layers.</p>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <p>Use checklists to help you perform architecture and design reviews while evaluating the security of your applications. The checklists should help you explore the high level design and architecture decisions that have been made for your application. You should evolve your checklists to include custom checks based on the unique aspects of your application&#8217;s architecture. Patterns &amp; practices security guidance includes checklists for each major application type. Use these checklists as a starting point and add new items as you learn more about architecture and design reviews.</p>"
        ]
      }
    ]
  }
}