{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1151156672",
      "Content_Hash": "-986364834"
    },
    "Metadata": [
      {
        "Id": [
          "b72c287a-c431-4ec9-a02e-210c9c02a739"
        ],
        "Id_History": [
          "b72c287a-c431-4ec9-a02e-210c9c02a739,c995a0da-f41c-4fd1-bfd9-3ab5fad8c02e,"
        ],
        "Library_Id": [
          "51eb81c3-1d23-4146-ba83-8a6bb9233c11"
        ],
        "Title": [
          "Don't Log Sensitive Information"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Don't Log Sensitive Information"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Avoid logging sensitive information.</p>\r\n  <h1>Why</h1>\r\n  <p>Log files are usually less protected and available to more users than sensitive data files. Including sensitive information in logs may lead to unauthorized information disclosure.</p>\r\n  <h1>When</h1>\r\n  <p>Use this guideline if your application handles sensitive data.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to prevent logging of sensitive information:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify sensitive data.</strong> Make a list of types of sensitive information handled by your application. Some examples are:</p>\r\n      <ul>\r\n        <li>System information<li>Filenames and paths<li>Passwords<li>Encryption keys<li>Cardholder data<li>Personal information</li></li></li></li></li></li>\r\n      </ul>\r\n      <li>\r\n        <p>\r\n          <strong>Identify logging functionality.</strong> Examine the application architecture to identify logging facilities, such as the logging API and where audit trails are actually stored. Make a list of APIs used to log events, document how to use them, and where they store logs.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Review logging code.</strong> Identify code that generates log entries. Review this code to verify that it does not include sensitive information in log entries. If necessary, rewrite this code in a way that does not log sensitive data.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Prevent logging of sensitive data.</strong> The most effective measure for avoiding logging sensitive information is prevention, which means making sure that sensitive information does not get logged whenever writing code that generates log entries.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Review logging of errors.</strong> Error logs often store sensitive data when they shouldn't. Pay particular attention to code that generates error logs, both when writing this code and when reviewing it, to make sure that sensitive information is not included in error messages or log entries.</p>\r\n            </li>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/7af4efea-59f5-468a-b5a1-c423cd29744a\">Centralize Logging</a>\r\n    </li>\r\n  </ul>"
        ]
      }
    ]
  }
}