{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "2006152360",
      "Content_Hash": "-592896537"
    },
    "Metadata": [
      {
        "Id": [
          "baad3cc3-460a-4358-918c-c6202e9edf76"
        ],
        "Id_History": [
          "baad3cc3-460a-4358-918c-c6202e9edf76,21be1e22-450d-47dd-814b-043ff3fc9524,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Secure Configuration Stores"
        ],
        "Category": [
          "Hardening"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Secure Configuration Stores"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "J.D. Meier, Alex Mackman, Michael Dunner, Srinath Vasireddy, Ray Escamilla and Anandha Murukan"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>\r\n      <div>Web Application</div>\r\n    </li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Identify the configuration stores of your application and then make sure that key items of configuration data, such as database connection strings, encryption keys, and service account credentials, are encrypted inside the store. </p>\r\n  <h1>Why</h1>\r\n  <p>If the configuration store is insecure then unauthorized users can access it and obtain secrets, such as account names and passwords, and database connection details.</p>\r\n  <h1>When</h1>This is an importnat guideline and should be followed all the time.&nbsp; <h1>How</h1><p>Text-based configuration files, the registry, and databases are common options for storing application configuration data. If possible, avoid using configuration files in the application's Web space to prevent possible server configuration vulnerabilities resulting in the download of configuration files. Whatever approach you use, secure access to the configuration store, for example, by using Windows ACLs or database permissions. Also avoid storing plaintext secrets such as database connection strings or account credentials. Secure these items using encryption and then restrict access to the registry key, file, or table that contains the encrypted data.</p><br /><hr /><p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}