{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "2128471655",
      "Content_Hash": "1723779696"
    },
    "Metadata": [
      {
        "Id": [
          "c25ceebf-e6b2-4b45-80fc-9f54fea496a2"
        ],
        "Id_History": [
          "c25ceebf-e6b2-4b45-80fc-9f54fea496a2,40bfb08b-0e17-4077-a94d-a5b7b75a2b93,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Strong Name Your Assemblies"
        ],
        "Category": [
          "Other"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Strong Name Your Assemblies"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Evaluate whether you need strong names.</p>\r\n  <h1>Why</h1>\r\n  <p>From a security point of view, there are no reasons not to use strong names. However, they can make versioning more complicated. For example, if you fix a bug in a strong named assembly and increment its strong name version number, you have to either rebuild everything that depends on that assembly or deploy publisher policy with the assembly.</p>\r\n  <h1>When</h1>\r\n  <p>Consider strong naming your assembly if:</p>\r\n  <ul>\r\n    <li>\r\n      <div>You need to add your assembly to the global assembly cache</div>\r\n    </li>\r\n    <li>\r\n      <div>You want to prevent partial trust callers</div>\r\n    </li>\r\n    <li>\r\n      <div>You want cryptographically strong evidence for security policy evaluation</div>\r\n    </li>\r\n  </ul>\r\n  <h1>How</h1>\r\n  <p />The following are the most common reasons to sign an assembly with a strong name: <ul><li><b>You need to add your assembly to the global assembly cache</b>. If you want your assembly to be shared among multiple applications, then you should add it to the global assembly cache. To add your assembly to the global assembly cache, you need to give it a strong name. Adding an assembly to the global assembly cache ensures that your assembly runs with full trust. </li><li><b>You want to prevent partial trust callers</b>. The CLR prevents partially trusted code from calling a strong named assembly by adding a link demand for the Full Trust permission set. You can override this behavior by using <b>AllowPartiallyTrustedCallersAttribute</b> (APTCA), although you should do so only if you are fully aware of the issues and after careful code review. For more information, see the section, \"APTCA,\" in this document. </li><li><b>You want cryptographically strong evidence for security policy evaluation</b>. Strong names provide cryptographically strong evidence for code access security policy evaluation. This allows administrators to grant permissions to specific assemblies. For example, the public key component of a strong name is often used to represent a particular organization. You could create policy that only allows code from designated organizations to run on your computers. </li></ul><p>&nbsp;</p><h1>Additional Resources</h1><ul><li>Strong Name Scenario at <a href=\"http://msdn.microsoft.com/en-us/library/szdke3d6.aspx\">http://msdn.microsoft.com/en-us/library/szdke3d6.aspx</a></li><li>How to: Sign an Assembly with a Strong Name at <a href=\"http://msdn.microsoft.com/en-us/library/xc31ft41.aspx\">http://msdn.microsoft.com/en-us/library/xc31ft41.aspx</a></li></ul><hr /><p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}