{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1347679757",
      "Content_Hash": "-1946677464"
    },
    "Metadata": [
      {
        "Id": [
          "c46128a0-b6fc-4113-9795-f5442b7510e1"
        ],
        "Id_History": [
          "c46128a0-b6fc-4113-9795-f5442b7510e1,08c759ea-e703-45d4-b351-36633bac8b36,"
        ],
        "Library_Id": [
          "92718d53-36b2-47bc-b6f5-e60994385f46"
        ],
        "Title": [
          "Consider Partitioning Your Site to Restricted Areas And Public Areas"
        ],
        "Category": [
          "Authentication"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Consider Partitioning Your Site to Restricted Areas And Public Areas"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>To avoid the performance overhead of using SSL across your entire site, consider using a separate folder to help protect pages that require authenticated access. Configure that folder in IIS to require SSL access. Those pages that support anonymous access can safely be accessed over HTTP connections.</p>\r\n  <h1>Why</h1>\r\n  <p>Using SSL across an entire site can incur a significant performance penalty. For sites that have pages which may be viewed without encryption or authentication, it will improve performance to separate out restricted from non-restricted pages. </p>\r\n  <h1>When</h1>\r\n  <p>This technique should be employed whenever an application has a mix of pages - some of which require authentication while others don't. </p>\r\n  <h1>How</h1>\r\n  <p>To avoid having to use SSL across your entire site, structure your Web site so that the secure pages that require authenticated access are placed in a subdirectory that is separate from the anonymously accessible pages.&nbsp; </p>\r\n  <p />\r\n  <b>To secure pages in a separate subfolder</b>\r\n  <ol>\r\n    <li>\r\n      <p>In Microsoft Internet Information Services (IIS), configure the secure folder to require SSL. This sets the <b>AccessSSL=true</b> attribute for the folder in the IIS Metabase. Requests for pages in the secured folders are successful only if HTTPS is used for the request URL. </p>\r\n      <li>\r\n        <p />Use an &lt;<b>authorization</b>&gt; element to ensure that only authenticated users can access secure pages. Place this element beneath the closing &lt;<b>/system.web</b>&gt; tag, as shown here. <pre>&lt;&#33;-- The secure folder is for authenticated and SSL access only. --&gt;<br />&lt;location path=\"Secure\" &gt;<br />  &lt;system.web&gt;<br />    &lt;authorization&gt;<br />      &lt;deny users=\"?\" /&gt;<br />    &lt;/authorization&gt;<br />  &lt;/system.web&gt;<br />&lt;/location&gt;  </pre><p />Additionally, the following configuration ensures that unauthenticated users are allowed to access pages in the application's root directory. Place this configuration in the main &lt;<b>system.web</b>&gt; element. <pre>&lt;system.web&gt;<br />  &lt;&#33;-- The virtual directory root folder contains general pages.<br />       Unauthenticated users can view them and they do not need<br />        to be secured with SSL. --&gt;<br />  &lt;authorization&gt;<br />    &lt;allow users=\"&#42;\" /&gt;<br />  &lt;/authorization&gt;<br />&lt;/system.web&gt;  </pre><p><b>Note</b>&nbsp;&nbsp;&nbsp;If you use this type of site structure, your application must not rely on the user's identity on the non-SSL pages. In the preceding configuration, no forms authentication ticket is sent for requests for non-SSL pages. As a result, the user is considered anonymous. This has implications for related features, such as personalization, that require the user name.<b>&nbsp;</b>&nbsp;</p></li>\r\n    </li>\r\n  </ol>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}