{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1061822124",
      "Content_Hash": "32850559"
    },
    "Metadata": [
      {
        "Id": [
          "c62fb9d2-95f1-4e36-b10f-cdf9451d15ce"
        ],
        "Id_History": [
          "c62fb9d2-95f1-4e36-b10f-cdf9451d15ce,47bf9abc-9580-47d7-8138-112197f1aa41,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Allocate Enough Buffer Space for Copying Data"
        ],
        "Category": [
          "Memory Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "C++"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Allocate Enough Buffer Space for Copying Data"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "C++"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* C and C++\r\n\r\n## What to Do ##\r\n\r\nOnly copy the amount of data that can fit in the array or string. Make sure that the array or string is large enough to fit all the data, including the possible trailing null.\r\n\r\n## Why ##\r\n\r\nCopying more data than an array or string can fit results in a buffer overflow.\r\n\r\n## When ##\r\n\r\nAllocate enough buffer space for copying data, when data is being copied to an array or a string.\r\n\r\n## How ##\r\n\r\nPerform the following steps to assure that your code allocates enough buffer space when copying data to prevent buffer overflows:\r\n\r\n1. **Identify all functions that copy data to strings or arrays.** List the components, modules, and libraries that do the most amount of data handling. Usually there exists some code heavy on manipulating data that copies many buffers or constructs various strings.\r\n\r\n2. **Calculate the amount of memory that is used by data being copied or set a maximum size limit for valid data.** Make sure to include a trailing null if a null-terminated string is being copied. When calculating the size of data, count the amount of memory it uses, not the amount of elements in the array. Be careful when using the sizeof() function, because it returns the size of a pointer when an array containing data is passed as a parameter to the function. The memory size of data should be calculated beforehand, ideally in the same scope in which the data structure containing data is declared, and passed as an argument to the function that does the copying.\r\n\r\n3. **Allocate memory for the buffer.** Once the amount of memory needed to fit all the data is determined, allocate an array or a string of a sufficient size. Write code to handle possible memory allocation errors.\r\n\r\n4. **Check bounds when copying.** Use the size of the allocated array or string when copying to assure that only the amount of data that fits into the array is copied. This should always be the case if the amount of memory to allocate is calculated correctly, but for extra security it is a good idea to write code in a way that truncates data if it doesn't fit into the buffer.\r\n\r\n## Problem Example ##\r\n\r\nHere is a classic buffer overflow example:\r\n\r\n\t#include <stdio.h>\r\n\t#include <string.h>\r\n\r\n\tint main(int argc, char *argv[])\r\n\t{\r\n\t// make sure one argument is supplied to the executable\r\n\tif (argc != 2) return 0;\r\n\r\n\t// buffer size does not correspond to the size of the data being copied\r\n\tchar buffer[8];\r\n\t// data that doesn't fit in the buffer overflows\r\n\tstrcpy(buffer, argv[1]);\r\n\treturn 1;\r\n\t}\r\n\r\n## Solution Example ##\r\n\r\nOne solution is to simply truncate any data that does not fit in the buffer:\r\n\r\n\t#include <stdio.h>\r\n\t#include <string.h>\r\n\r\n\tint main(int argc, char *argv[])\r\n\t{\r\n\tif (argc != 2) return 0;\r\n\t\r\n\t// buffer size does not correspond to the size of the data being copied\r\n\tint buffersize = 8;\r\n\tchar buffer[buffersize];\r\n\t// data that doesn't fit in the buffer is truncated, so no overflow occurs\r\n\tstrncpy(buffer, argv[1], buffersize);\r\n\treturn 1;\r\n\t}\r\n\t\r\nIt is better to actually calculate the size of the data that is being copied and allocate the correct amount of memory for it. However, just in case the calculation is somehow incorrect, any data that does not fit in the buffer should be truncated:\r\n\r\n\t#include <stdio.h>\r\n\t#include <string.h>\r\n\r\n\tint main(int argc, char *argv[])\r\n\t{\r\n\tif (argc != 2) return 0;\r\n\t\r\n\t// buffer size is the same as the size of the data being copied, so no truncation should occur\r\n\tint buffersize = sizeof(argv[1]);\r\n\tchar buffer[buffersize];\r\n\t// data that doesn't fit in the buffer is truncated, so no overflow occurs\r\n\tstrncpy(buffer, argv[1], buffersize);\r\n\treturn 1;\r\n\t}\r\n\r\n## Additional Resources ##\r\n\r\n* For more information about assuring that data is copied to sufficiently large storage, please see \"ARR33-C. Guarantee that copies are made into storage of sufficient size\" at [https://www.securecoding.cert.org/confluence/display/c/void+ARR33-C.+Guarantee+that+copies+are+made+into+storage+of+sufficient+size](https://www.securecoding.cert.org/confluence/display/c/void+ARR33-C.+Guarantee+that+copies+are+made+into+storage+of+sufficient+size\r\n)\r\n\r\n"
        ]
      }
    ]
  }
}