{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "586181175",
      "Content_Hash": "1133596486"
    },
    "Metadata": [
      {
        "Id": [
          "ca55d261-5ee5-45a4-9fd7-6738364ef470"
        ],
        "Id_History": [
          "ca55d261-5ee5-45a4-9fd7-6738364ef470,ac161b74-afe9-4119-a7a9-e0b8590a29d2,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Monitor the Use of Privileged Accounts"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "PHP"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Monitor the Use of Privileged Accounts"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>PHP</li>\r\n  </ul>\r\n  <h1>What to Do</h1>\r\n  <p>Monitor actions taken by privileged accounts, such as administrator users.</p>\r\n  <h1>Why</h1>\r\n  <p>Attackers usually want to use privileged accounts, so monitoring privileged accounts provides a lot of valuable information in the event of a successful penetration. This information is also useful for detecting insider attacks.</p>\r\n  <h1>How</h1>\r\n  <p>Perform the following actions to implement monitoring the use of privileged user accounts:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify privileged user roles.</strong> Identify the types of privileged user accounts available in your application. Some example are: administrator, root, power user, manager, etc. Make a list of privileged user roles.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Identify functionality unique to privileged users.</strong> For each type of privileged user account, make a list of functionality that this type of account can use that a regular user cannot. Some examples are: adding or removing user accounts, changing passwords for other users, changing application settings, shutting down the application, etc. Make a list of functionality that is unique to privileged users.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Identify code that implements functions unique to privileged users.</strong> Use the list of actions available exclusively to privileged users to identify the functions that implement these actions. Make a list of these functions.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Identify the logging subsystem.</strong> The logging subsystem should provide an API that allows generating log entries from application code. If this API or the logging subsystem don't exist, write them. Make a list of functions that may be used to generate log entries and collect documentation about how to use them.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Implement monitoring of privileged accounts.</strong> Use the list of functions that perform actions unique to privileged accounts to add code that generates log entries to each of those functions. Use the list of functions in the logging subsystem when writing code that generates log entries.</p>\r\n            </li>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information about generating log entries in PHP, see <a href=\"http://www.php.net/manual/en/function.error-log.php\">http://www.php.net/manual/en/function.error-log.php</a></li>\r\n  </ul>"
        ]
      }
    ]
  }
}