{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1426359057",
      "Content_Hash": "1900613381"
    },
    "Metadata": [
      {
        "Id": [
          "d81f0c17-cbda-4c73-85f2-6d2e43dec441"
        ],
        "Id_History": [
          "d81f0c17-cbda-4c73-85f2-6d2e43dec441,816982e5-93b3-475b-bb35-19b60a123bf6,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "0sink Do Not Put Sensitive Data in the Query String"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Put Sensitive Data in the Query String"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>If a user is submitting sensitive data, they should submit it as a form field via an HTTP POST, not in the query string.&amp;nbsp;&amp;nbsp;Whenever possible, avoid the problem entirely&amp;#8212;do not send sensitive data on a round trip to the user unless they need to edit the data.&amp;nbsp; Instead, store sensitive session data on the server side.&amp;nbsp; If sensitive data must be sent through the user, use an encrypted ViewState instead of a query string parameter. </p>\r\n  <h1>Why</h1>\r\n  <p>Sensitive data in the query string may be logged by web proxies, and will also appear in the user's browser history and in your own web server logs.&amp;nbsp; Additionally, if sensitive content is being sent through the user, the query string does not offer an easy way of protecting the content from user reading or tampering. </p>\r\n  <h1>When</h1>\r\n  <p>Sensitive data should never appear in the query string. </p>\r\n  <h1>How</h1>\r\n  <ol>\r\n    <li>\r\n      <p>Use HTTP POST (form submission) instead of HTTP GET for sensitive data provided by the user.&amp;nbsp; This will ensure that data is not logged by web proxies, the web server's logs, or browser histories. </p>\r\n      <li>\r\n        <p>Store sensitive data server side instead of repeatedly passing it as a query string parameter.&amp;nbsp; The best way to keep sensitive information safe is to leave it somewhere inaccessible. </p>\r\n        <li>\r\n          <p>If sensitive data must be sent through the user&amp;#8212;during a server transition, for instance&amp;#8212;send it via an encrypted ViewState instead of a query string parameter.&amp;nbsp; ViewStates are designed to support integrity and confidentiality, as needed, and are the best way of ensuring that sensitive data is not tampered with or disclosed when it is sent past the user. </p>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The order forms on an e-commerce site uses GET to place orders.&amp;nbsp; The URL generated by the payment page is of the form:</p>\r\n  <pre>http://www.example.com/cart.aspx?orderID=&amp;#91;...&amp;#93;&amp;name=&amp;#91;...&amp;#93;&amp;creditCard=&amp;#91;...&amp;#93;&amp;address=&amp;#91;...&amp;#93;</pre>\r\n  <p>When a customer places an order from a public terminal, an attacker retrieves their credit card number and address from the browser history.&amp;nbsp; Having found a vulnerable site, the attacker compromises several proxy servers and steals more credit card numbers from their logs.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>The order forms on an e-commerce site use POST for all transactions, all forms use a ViewStateUserKey, and all sensitive data is transmitted via SSL and stored on the server instead of being repeatedly passed through the client.&amp;nbsp; Using POST ensures that data isn't logged by web proxies, web server logs, or in the browser.&amp;nbsp; The ViewStateUserKey ensures that captured form submissions can't be replayed.&amp;nbsp; SSL and not passing sensitive data back to the client&amp;nbsp;ensures that the information can be neither sniffed nor stolen via XSS.&amp;nbsp; When a customer places an order from a public terminal, attackers are unable to retrieve the submitted data from the browser history or from proxy servers.</p>\r\n  <p />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}