{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "183284759",
      "Content_Hash": "-843030814"
    },
    "Metadata": [
      {
        "Id": [
          "deeb51ee-f75a-4e6a-a5f7-de2f27aa2beb"
        ],
        "Id_History": [
          "deeb51ee-f75a-4e6a-a5f7-de2f27aa2beb,8955c98d-41e8-4c4e-93fe-d9a054e9b0ce,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Perform a Security Design Inspection for Web Applications"
        ],
        "Category": [
          "Design Considerations"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          "Web Application"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>Applies to</h1>\r\n  <ul>\r\n    <li>Web Application</li>\r\n  </ul>\r\n  <h1>Summary </h1>\r\n  <p>The architecture and design review process analyzes the architecture and design from a security perspective. If you have just completed the design, the design documentation can help you with this process. Regardless of how comprehensive your design documentation is, you must be able to decompose your application and be able to identify key items, including trust boundaries, data flow, entry points, and privileged code. You must also know the physical deployment configuration of your application. Pay attention to the design approaches you have adopted for those areas that most commonly exhibit vulnerabilities. This guide refers to these as application vulnerability categories.</p>\r\n  <h1>Summary of Steps</h1>\r\n  <p>\r\n    <img alt=\"\" src=\"http://msdn2.microsoft.com/en-us/library/Aa302421.f05thcm01%28en-us,MSDN.10%29.gif\" border=\"0\" />\r\n  </p>\r\n  <ul>\r\n    <li>Step 1. Analzye the deployment and infrastructure. \r\n<li>Step 2. Analyze the application architecture and design. \r\n<li>Step 3. Analzye tier by tier and layer by layer. </li></li></li>\r\n  </ul>\r\n  <h1>Step 1. Analzye the deployment and infrastructure.</h1>\r\n  <p>You review the design of your application in relation to the target deployment environment and the associated security policies. You also consider the restrictions imposed by the underlying infrastructure-layer security. See \"Web Application Security Design Inspections Questions\".</p>\r\n  <h1>Step 2. Analyze the application architecture and design.</h1>\r\n  <p>You review the approach to critical areas in your application, including authentication, authorization, input validation, exception management, and other areas. You can use the application vulnerability categories as a roadmap and to ensure that you do not miss any key areas during the review. See \"Web Application Security Design Inspections Questions\".</p>\r\n  <h1>Step 3. Analzye tier by tier and layer by layer.</h1>\r\n  <p>You walk through the physical tiers and logical layers of your application. This means analyzing your Web server, application server and database server, as well as your presentation, business and data access layers. See \"Web Application Security Design Inspections Questions\".</p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information see \"Chapter 5 - Architecture and Design Review for Security\" at <a href=\"http://msdn2.microsoft.com/en-us/library/aa302421.aspx\">http://msdn2.microsoft.com/en-us/library/aa302421.aspx</a></li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance.</p>"
        ]
      }
    ]
  }
}