{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1538928176",
      "Content_Hash": "1488819275"
    },
    "Metadata": [
      {
        "Id": [
          "e1992e93-39c6-4508-9b16-0e07b0939c37"
        ],
        "Id_History": [
          "e1992e93-39c6-4508-9b16-0e07b0939c37,17d98dea-18ac-48b3-afa7-d3d279840238,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Secure Connection Strings"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Secure Connection Strings"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Protect the application's credentials to the backend database server.</p>\r\n  <h1>Why</h1>\r\n  <p>If an attacker gains access to the application's credentials to the backend database the attacker could access the database with all the permissions allowed for the application.</p>\r\n  <h1>When</h1>\r\n  <p>If your application uses a backend database server.</p>\r\n  <h1>How</h1>\r\n  <p>To protect the application's database credentials:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>When possible, use Windows authentication to connect to the database server.</strong> Using windows authentication solves the problem of having to store credentials entirely. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Store credentials in an encrypted configuration file.</strong> Do not hardcode database credentials into your code. Instead, use an application configuration file and encrypt the sections which contain sensitive data. In ASP.NET applications, there are two libraries that provide encryption facilities for connection strings — DPAPI and RSA. If your application is deployed in a Web farm, you should use the RSA protected configuration provider due to the ease with which RSA keys can be exported. Otherwise you should use the DPAPI protected configuration provider.</p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Protect configuration files</strong>:</p>\r\n      <ul>\r\n        <li>\r\n          <strong>Choose a configuration directory</strong>: Dedicate a directory for storing your application's configuration files. Make sure the directory is not web-accessible. This limits the scope of users that can potentially compromise the contents inside the directory. </li>\r\n        <li>\r\n          <strong>Set appropriate permissions</strong>: Apply the appropriate filesystem permissions such that the configuration files can be only accessed by your application and its administrators.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Encrypt connection to database server.</strong> Encrypting the connection between your application and the database server protects the database credentials when your application initially authenticates to the backend database. Because the implementation varies between the different brands of database servers, it is recommended to consult the server manual on how to utilize such functionality.</p>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>An ASP.NET application contains the following Identity element in its web.config file:</p>\r\n  <pre>\r\n    <identity impersonate=\"true\">\r\n    </identity>\r\n    <br />          userName=\"MyDomain\\MyUserName\"<br />          password=\"MySecretPassword\"/&gt;</pre>\r\n  <p>Since the username and password are in plaintext they would be easily readable by any attacker who gains access to the server.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>An ASP.NET application contains the something similar to the following in place of the Identity element in its web.config file:</p>\r\n  <pre>\r\n    <encrypteddata>\r\n      <br />\r\n      <cipherdata>\r\n        <br />\r\n        <ciphervalue>\r\n          <br />          AQAAANCMnd8BFdERjHoAwE/Cl+sBAAAAexuI<br />          J/8oFE+sGTs7jBKZdgQAAAACAAAAAAADZgAA<br />          qAAAABAAAAAKms84dyaCPAeaSC1dIMIBAAAA<br />          AASAAACgAAAAEAAAAKaVI6aAOFdqhdc6w1Er<br />          3HMwAAAAcZ00MZOz1dI7kYRvkMIn/BmfrvoH<br />          NUwz6H9rcxJ6Ow41E3hwHLbh79IUWiiNp0Vq<br />          FAAAAF2sXCdb3fcKkgnagkHkILqteTXh<br /></ciphervalue>\r\n        <br />\r\n      </cipherdata>\r\n      <br />\r\n    </encrypteddata>\r\n  </pre>\r\n  <p>The username and password have been encrypted and are not easily readable by an attacker who gains access to the server.</p>\r\n  <br />\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}