{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1911316662",
      "Content_Hash": "1149124107"
    },
    "Metadata": [
      {
        "Id": [
          "e72d0afe-72eb-4605-a815-b6b8f4234a4b"
        ],
        "Id_History": [
          "e72d0afe-72eb-4605-a815-b6b8f4234a4b,29379e91-e109-4550-a76b-d4fbe5dd5519,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Conduct a Security Deployment Review"
        ],
        "Category": [
          "Security Engineering"
        ],
        "Phase": [
          "Deployment"
        ],
        "Technology": [
          "Technology Independent"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Conduct a Security Deployment Review"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>When you deploy your application, perform a security deployment review to identify potential security vulnerabilities introduced by inappropriate configuration settings. A security deployment review is an activity that can be used to ensure that configuration and deployment problems are discovered before they can result in an application vulnerability. Even the most securely designed and implemented application can be compromised by an error during deployment, leaving it open to attack. </p>\r\n  <h1>Why</h1>\r\n  <p>A deployment review helps to ensure that application security is not compromised by poor configuration of the network or host - even the most securely designed and implemented application can be compromised by an error during deployment. </p>\r\n  <h1>When</h1>\r\n  <p>Perform the security deployment review during the deployment stage in the application development life cycle.</p>\r\n  <h1>How</h1>\r\n  <p>Use following techniques when conducting a deployment review:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Use server security categories.</strong> Use server security categories to help make deployment reviews for security systematic and repeatable.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Break down your deployment review.</strong> You can use the categories to break down your application deployment for further analysis and to help identify vulnerabilities.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Review systematically.</strong> By using categories, you can systematically go through the deployment review process from start to finish or pick a particular category for further analysis.</p>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h2>Server Security Categories</h2>\r\n  <p>Patterns &amp; practices security guidance includes server security categories for each major application type. Use these categories as a starting point and add new items as you learn more about deployment reviews. Table 7.1 lists categories that are common to most deployed applications.</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Patches and Updates.</strong> Installing patches and updates fixes known vulnerabilities with relatively little effort, so it is a good first step.</p>\r\n      <li>\r\n        <p>\r\n          <strong>Accounts.</strong> Only grant access that is required for users to perform their job functions. Remove accounts that are not used and disable accounts that have been idle for a long time. Require strong passwords and password changes to make password-guessing attacks ineffective. Log authentication failure and warn users to become aware of attacks on user accounts.</p>\r\n        <li>\r\n          <p>\r\n            <strong>Auditing and Logging.</strong> Logging is one of the most useful tool for becoming aware of attacks and for investigating attacks that have already occured. Enable and configure logging. Ideally, logs should be sent to a centralized log server where they are monitored in real time or reviewed daily.</p>\r\n          <li>\r\n            <p>\r\n              <strong>Files and Directories.</strong> Configure access controls to only allow authorized users and services to access data. Access controls should be configured with \"deny-all\" defaults. Log unauthorized data access events.</p>\r\n            <li>\r\n              <p>\r\n                <strong>Ports.</strong> Open ports accept incoming connections over the network. This makes them a simple attack vector. Scan your server for open ports to make sure that unsecure or unnecessary services are not running on your server.</p>\r\n              <li>\r\n                <p>\r\n                  <strong>Protocols.</strong> Some protocols have been designed without security in mind. Avoid using protocols that are known to have security vulnerabilities, such as FTP, which transmits authentication credentials in plain-text. If such protocols are necessary for operations, use additional security technologies, such as VPN, to provide secure communications and authentication.</p>\r\n                <li>\r\n                  <p>\r\n                    <strong>Registry.</strong> Secure configuration settings stored in the registry by using ACLs and by disabling the remote registry service.</p>\r\n                  <li>\r\n                    <p>\r\n                      <strong>Services.</strong> Disable unused services. Secure, configure, and monitor important services. If a service that is known to be unsecure, such as FTP, but is necessary for operations is used, considering using a secure alternative or using additional security technologies to protect it.</p>\r\n                    <li>\r\n                      <p>\r\n                        <strong>Shares.</strong> Protect file shares with access controls only allowing the minimum required amount of access to the smallest necessary set of data. Remove any unused file shares.</p>\r\n                    </li>\r\n                  </li>\r\n                </li>\r\n              </li>\r\n            </li>\r\n          </li>\r\n        </li>\r\n      </li>\r\n    </li>\r\n  </ol>\r\n  <h2>Application Security Categories</h2>\r\n  <p>Application security categories are different for different applications. Some application types will require review of application security categories as well as server security categories. For example, you should review application-level Web.config file settings for ASP.NET applications. Use server security categories as a starting point, and add new items as you learn more about deployment reviews.</p>"
        ]
      }
    ]
  }
}