{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-2024469347",
      "Content_Hash": "-380740232"
    },
    "Metadata": [
      {
        "Id": [
          "e9e34335-e80f-4273-8d59-d7f82cabf3b2"
        ],
        "Id_History": [
          "e9e34335-e80f-4273-8d59-d7f82cabf3b2,24a2b8c5-7603-4f10-918e-0b23c9f5f86b,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Do Not Cache Sensitive Data"
        ],
        "Category": [
          "Cryptography"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Do Not Cache Sensitive Data"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>ASP.NET output caching is a great way to improve application performance, however, if your page contains data that is sensitive, such as a password, credit card number, or account status, the page should not be cached. ASP.NET output caching is off by default. </p>\n  <h1>Why</h1>\n  <p>Output caching is usually done on the client, and that has serious security implications if the page being cached has sensitive data. Output caching is similar in impact to storing sensitive data in cookies.&amp;nbsp;The data&amp;nbsp;may persist on the client machine, on proxy servers or on the web server. Due to this fact, it leaves interesting data available to&amp;nbsp;attackers should the devices caching the data be compromised. </p>\n  <h1>When</h1>\n  <p>If a page displays sensitive info,&amp;nbsp;ensure output caching is disabled. </p>\n  <h1>How</h1>\n  <p>Output caching&amp;nbsp;is off by default and must be explicitly turned on in order to be activated.&amp;nbsp; There are two ways that output caching can be turned on: high-level declarative API, or low-level programmatic API.</p>\n  <p>The high-level declarative API is used&amp;nbsp;by including the <strong>@OutputCache</strong> directive in the .aspx file for a page.</p>\n  <p>The low-level programmatic API is used through the <strong>Page.Response.Cache</strong> property which returns an instance of the <strong>HttpCachePolicy </strong>class.</p>\n  <p>To ensure sensitive data is not cached use the following steps:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Review pages for sensitive data.</strong>&amp;nbsp; Review all of your pages for instances of sensitive data.&amp;nbsp; This could include, but is not limited to:</p>\n      <ul>\n        <li>Information that either contains personally identifiable information or can be used to derive personally identifiable information that should not be shared with users. </li>\n        <li>Information that a user provides that they would not want shared with other users of the application. </li>\n        <li>Information that comes from an external trusted source that is not designed to be shared with users. </li>\n      </ul>\n      <p>Once you have identified the set of pages that could contain sensitive data move to steps 2 and 3.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Review the pages for declarative Output Caching.</strong>&amp;nbsp; Review the pages discovered in step 1 for the use of the <strong>@OutputCache</strong> directive.&amp;nbsp; If it exists, remove it.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Review the pages for programmatic Output Caching.</strong>&amp;nbsp; Review the pages discovered in step 1 for the use of the <strong>HttpCachePolicy </strong>class.&amp;nbsp; Generally this is accessed through the <strong>Page.Response.Cache</strong> property.</p>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>An ASP.NET application contains a page that asks the user for credit card information in order to complete&amp;nbsp;an e-commerce transaction.&amp;nbsp; For performance reasons, all pages in the application have output caching turned on through the use of the <strong>@OutputCache</strong> directive&amp;nbsp;&amp;nbsp; </p>\n  <pre>&lt;%@ OutputCache Duration=\"60\" VaryByParam=\"None\" %&gt;</pre>\n  <p>This results in the page, including sensitive data, being cached on any HTTP 1.1 capable devices - including browsers, proxies and the web server.</p>\n  <h1>Solution Example</h1>\n  <p>An ASP.NET application contains a page that asks the user for credit card information in order to complete&amp;nbsp;an e-commerce transaction.&amp;nbsp; For performance reasons, almost all of the pages in the application have output caching turned on through the use of the <strong>@OutputCache</strong> directive.&amp;nbsp; However sensitive pages, such as the page that includes credit card information have had the <strong>@OutputCache</strong> directive removed to prevent them from being cached on HTTP 1.1 capable devices.</p>\n  <ul>\n  </ul>\n  <hr />\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}