{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1994370182",
      "Content_Hash": "-1492264774"
    },
    "Metadata": [
      {
        "Id": [
          "eb5dbadd-49ab-46e1-bc0d-d299eeb465f6"
        ],
        "Id_History": [
          "eb5dbadd-49ab-46e1-bc0d-d299eeb465f6,8c1b2132-1bb5-4dea-85dd-5b350e2a1093,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Partition Code into Separate Assemblies"
        ],
        "Category": [
          "Code Access Security"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Partition Code into Separate Assemblies"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\n  <p>Partition web controls, user controls, and resource access code in their own assemblies for granular security. Assign the appropriate code access security settings to each assembly.</p>\n  <h1>Why</h1>\n  <p>Partitioning your application into multiple assemblies provides extra flexibility when constructing and enforcing a code access security policy. Because different components may require different privileges and levels of trust, your application may not be suited well by a single security policy. Following this strategy will help you reduce the overall minimum set of privileges that your application requires while granting a given component extra trust when completing a task.</p>\n  <h1>When</h1>\n  <p>Use this guideline when your application's components require different levels of privileges and trust.</p>\n  <h1>How</h1>\n  <p>Use the following steps when partitioning your application:</p>\n  <ol>\n    <li>\n      <p>\n        <strong>Identify the major components</strong>: Review your application's design and locate all major functionality.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Identify all special security settings</strong>: Review your application's security requirements. Identify all cases where a component would require a privilege that is otherwise not needed by the rest of your application. For example, all code that accesses the file system should be placed within a single assembly.</p>\n    </li>\n    <li>\n      <p>\n        <strong>Partition your application</strong>: Store all major functionality into separate assemblies. Adding this level of granularity to your application provides extra flexibility when applying your application's security settings. ASP.NET provides the following types of assemblies:</p>\n      <ul>\n        <li>\n          <strong>Page assemblies</strong>: By default, each ASP.NET page is compiled into its own assembly that is then loaded into the ASP.NET engine. Security configuration for such assemblies is stored inside <strong>web.config</strong>. </li>\n        <li>\n          <strong>Executable assemblies</strong>: Typically known as external libraries or DLL, these assemblies can be re-used outside of ASP.NET development. Security settings for such assemblies is managed through <strong>app.config</strong> and the <strong>caspol.exe</strong> utility.</li>\n      </ul>\n    </li>\n    <li>\n      <p>\n        <strong>Apply the appropriate security settings</strong>: Define a security policy that best meets each assembly's security requirements.</p>\n    </li>\n  </ol>\n  <h1>Problem Example</h1>\n  <p>MyApp is the HR application for MyCorp. Among its basic features for keeping track of employee records, the application allows document and calendar sharing that allows MyCorp's HR staff to be up-to-date on daily activities. Because the application is compiled as a single assembly, it is impossible to assign different security settings for its calendar and document sharing features. Therefore a successfully exploited vulnerability in the calendar feature could lead to compromising shared documents. The following snippet shows the deployment of MyApp's security policy:</p>\n  <blockquote>\n    <pre>&lt;location allowOverride=\"true\"&gt;<br />   &lt;system.web&gt;<br />      &lt;securityPolicy&gt;<br />         &lt;trustLevel name=\"MyAppTrustLevel\" policyFile=\"myapp_customtrust.config\" /&gt;<br />      &lt;/securityPolicy&gt;<br />      &lt;trust level=\"MyAppTrustLevel\" originUrl=\"\" /&gt;<br />   &lt;/system.web&gt;<br />&lt;/location&gt;</pre>\n  </blockquote>\n  <h1>Solution Example</h1>\n  <p>MyApp is the HR application for MyCorp. Among its basic features for keeping track of employee records, the application allows document and calendar sharing that allows MyCorp's HR staff to be up-to-date on daily activities. Since the calendar and document features are compiled as separate assemblies, the developers are able to assign the appropriate security policies for each component; therefore preventing an attacker from compromising shared documents through successfully exploiting a vulnerability in the calendar feature. The following snippet shows the deployment of the security policies that are associated with each assembly:</p>\n  <blockquote>\n    <pre>&lt;location allowOverride=\"false\"&gt;<br />   &lt;system.web&gt;<br />      &lt;securityPolicy&gt;<br />         &lt;trustLevel name=\"MyAppCalendarTrustLevel\" policyFile=\"myapp_calendartrust.config\" /&gt;<br />      &lt;/securityPolicy&gt;<br />      &lt;trust level=\"MyAppCalendarTrustLevel\" originUrl=\"~/Calendar/\" /&gt;<br />   &lt;/system.web&gt;<br />&lt;/location&gt;<br />&lt;location allowOverride=\"false\"&gt;<br />   &lt;system.web&gt;<br />      &lt;securityPolicy&gt;<br />         &lt;trustLevel name=\"MyAppDocumentTrustLevel\" policyFile=\"myapp_documentstrust.config\" /&gt;<br />      &lt;/securityPolicy&gt;<br />      &lt;trust level=\"MyAppDocumentTrustLevel\" originUrl=\"~/Documents/\" /&gt;<br />   &lt;/system.web&gt;<br />&lt;/location&gt;</pre>\n  </blockquote>\n  <br />\n  <hr />\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}