{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1323208444",
      "Content_Hash": "60159307"
    },
    "Metadata": [
      {
        "Id": [
          "ecfc4c67-2a6c-443e-844e-8a3051fe54f3"
        ],
        "Id_History": [
          "ecfc4c67-2a6c-443e-844e-8a3051fe54f3,6d58a353-7271-47ce-9bdc-047226772d2b,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Use IPSsec to Encrypt Traffic Between Servers"
        ],
        "Category": [
          "Communication Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use IPSsec to Encrypt Traffic Between Servers"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "Html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Internet Protocol security (IPSec)&amp;nbsp;provides encryption, integrity, and authentication services for IP-based network traffic.&amp;nbsp;Use&amp;nbsp;IPSec to provide server-to-server protection&amp;nbsp;against internal network threats, including eavesdropping, tampering, man in the middle attacks, IP spoofing, and other password-based attacks by restricting which computers can communicate with each other, and limit the protocols they can communicate with.</p>\r\n  <h1>Why</h1>\r\n  <p>Servers&amp;nbsp;do not usually co-exist in a secure environment. Eavesdropping and spoofing are threats when two or more entities must communicate over&amp;nbsp;typical untrusted mediums such as the public internet&amp;nbsp;or a company intranet. Failure to use IPSec&amp;nbsp;increases the likleihood&amp;nbsp;that data traveling on the network will be intercepted, modified, or&amp;nbsp;stolen.</p>\r\n  <h1>When</h1>\r\n  <p>IPSec can be used&amp;nbsp;for the following tasks:</p>\r\n  <ul>\r\n    <li>Provide message confidentiality by encrypting all of the data sent between two computers. </li>\r\n    <li>Provide message integrity between two computers (without encrypting data). </li>\r\n    <li>Provide mutual authentication between two computers. For example, you can help secure a database server by establishing a policy that permits requests only from a specific client computer (for example, an application or Web server). </li>\r\n    <li>Restrict which computers can communicate with one another. You can also restrict communication to specific IP protocols and TCP/UDP ports.</li>\r\n  </ul>\r\n  <p>&amp;nbsp;Using IPSec is not a a possibility when the two servers are not using static ip addresses.</p>\r\n  <h1>How</h1>\r\n  <p>To secure traffic between two servers, follow these steps:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Create an IP Filter.</strong> This&amp;nbsp;restricts&amp;nbsp;what computers can communicate with each other, and require that&amp;nbsp;specific&amp;nbsp;communication protocols are used.&amp;nbsp;A filter consists of:</p>\r\n      <ul>\r\n        <li>A source IP address or range of addresses. </li>\r\n        <li>A destination IP address or range of addresses. </li>\r\n        <li>An IP protocol, such as TCP, UDP, or \"any.\" </li>\r\n        <li>Source and destination ports (for TCP or UDP only).</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Create Filter Actions.</strong> This procedure creates two filter actions. The first will be used to block all communications from specified computers and the second will be used to enforce the use of encryption between application server and database server computers. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Create Rules.</strong> This procedure creates two new rules that will be used to associate the filter that you created in Procedure 1, with the two filter actions you created in Procedure 2. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Export the IPSec Policy to the Remote Computer.</strong> The IPSec policy that you have created on the database server must now be exported and copied to the application server computer. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Assign Policies.</strong> An IPSec policy must be assigned before it becomes active. Note that only one policy may be active at any one time on a particular computer. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Verify that it Works.</strong> Use Network Monitor (netmon.exe) to verify that data sent between the two servers&amp;nbsp;is encrypted. </p>\r\n    </li>\r\n  </ol>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>How To: Use IPSec Policy to Secure Terminal Services Communications in Windows Server 2003 <a href=\"http://support.microsoft.com/kb/816521\">http://support.microsoft.com/kb/816521</a></li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/ecfc4c67-2a6c-443e-844e-8a3051fe54f3\">Use IPSsec to Encrypt Traffic Between Servers</a>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns &amp; practices guidance. </p>"
        ]
      }
    ]
  }
}