{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1061536634",
      "Content_Hash": "-1294485662"
    },
    "Metadata": [
      {
        "Id": [
          "ee82e7db-52f2-473d-8a65-798380ba0420"
        ],
        "Id_History": [
          "ee82e7db-52f2-473d-8a65-798380ba0420,90f0dfe8-d62c-4937-ae3c-99684a8b51a7,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "[SINK] Protect Credentials over the Network When Using SQL Authentication"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Protect Credentials over the Network When Using SQL Authentication"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 3.5,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>If you use SQL authentication and your application is not located in a physically secure data center, you should use Internet Protocol Security (IPSec) or TLS to create an encrypted communication channel between the Web server and database server. </p>\r\n  <h1>Why</h1>\r\n  <p>Failure to protect credentials over the network means that credentials can be easily captured with a network monitor. When you connect to SQL Server with SQL authentication, the credentials are not encrypted prior to transmission across the network. This means that account login details for the database being accessed over the network are sent in plain text, and an attacker that captures such info can now log in to the database as a legitimate user and execute under that context.</p>\r\n  <h1>When</h1>\r\n  <p>Use TLS when you need granular channel protection for a particular application instead of for all applications and services running on a computer. If you want to protect all the IP traffic between Web and database server, use IPSec. You can also use IPSec to restrict which computers can communicate with one another. For example, you can help protect a database server by establishing a policy that permits requests only from a trusted client computer, such as an application or Web server. You can also restrict communication to specific IP protocols and TCP/UDP ports. </p>\r\n  <h1>Additional Resources</h1>\r\n  <ul>\r\n    <li>For more information on how to connect to SQL Server using SQL Authentication in ASP.NET: <a href=\"http://msdn2.microsoft.com/en-us/library/ms998300.aspx\">http://msdn2.microsoft.com/en-us/library/ms998300.aspx</a><li>For more information on how to use IPSec to provide secure communication between two servers : <a href=\"http://msdn2.microsoft.com/en-us/library/aa302413.aspx\">http://msdn2.microsoft.com/en-us/library/aa302413.aspx</a><li><a href=\"http://msdn2.microsoft.com/en-us/library/ms998372.aspx#pagpractices0001_sechowtochoosebetweenipsecandssl\">How to choose between IPSec and SSL</a></li></li></li>\r\n  </ul>\r\n  <h1>Related Items</h1>\r\n  <ul>\r\n    <li>\r\n      <a href=\"/article/cf0acf4b-6085-4a5f-84e9-e0eb38d33bb3\">When Using SQL Authentication, Protect Credentials in Configuration Files</a>\r\n      <li>\r\n        <a href=\"/article/fab1733c-61d7-46a8-88c6-2617a643c0d9\">Use Least Privileged Accounts for Database Access</a>\r\n      </li>\r\n    </li>\r\n  </ul>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance. </p>"
        ]
      }
    ]
  }
}