{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-796276344",
      "Content_Hash": "468563351"
    },
    "Metadata": [
      {
        "Id": [
          "fab1733c-61d7-46a8-88c6-2617a643c0d9"
        ],
        "Id_History": [
          "fab1733c-61d7-46a8-88c6-2617a643c0d9,7d475839-efce-421e-912f-7f4a0022feb0,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          "Use Least Privileged Accounts for Database Access"
        ],
        "Category": [
          "Database Security"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          ".NET 3.5"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Least Privileged Accounts for Database Access"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          "2"
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "html"
        },
        "Data": [
          "<h1>What to Do</h1>\r\n  <p>Your application should connect to databases using the least-privileged account possible. </p>\r\n  <h1>Why</h1>\r\n  <p>Connecting to the database with a least privilege account limits the damage that can be done in the event of a SQL injection attack or in the event of an attacker obtaining your account's credentials. </p>\r\n  <h1>When</h1>\r\n  <p>Regardless of authentication mechanism, always restrict the account's permissions in the database. An account should have the minimum privileges necessary to satisfy the application's operating constraints. </p>\r\n  <h1>How</h1>\r\n  <p>If you are following the guideline <b>Use Windows Authentication to Connect to the SQL Server</b>, use a least-privileged account with limited operating system permissions, and limited ability to access Windows resources.</p>\r\n  <p>If using SQL Authentication, use the following pattern to limit permissions in the database:</p>\r\n  <ol>\r\n    <li>Create a SQL Server login for the account. </li>\r\n    <li>Map the login to a database user in the required database. </li>\r\n    <li>Place the database user in a database role. </li>\r\n    <li>Grant the database role limited permissions to only those stored procedures or tables that your application needs to access.</li>\r\n  </ol>\r\n  <p>To apply the principle of least privilege to the application's database accounts:</p>\r\n  <ol>\r\n    <li>\r\n      <p>\r\n        <strong>Identify all database accounts.</strong> Create a list with all of your application's database accounts and the respective servers and databases that they connect to. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Identify the roles associated with each database account.</strong> Understand the purpose of the accounts and the functionality they will be executing. Using a table, map all accounts to the privileges they require. None of the application's accounts should have administrative rights on the database server. </p>\r\n    </li>\r\n    <li>\r\n      <p>\r\n        <strong>Set appropriate privileges.</strong> Once all accounts and their roles have been identified, set the appropriate privileges at the respective database servers. Make sure that each account has enough privileges to execute the assigned tasks only. Any extra privileges should be revoked. </p>\r\n      <p>Use the following guidelines to determine appropriate access permissions:</p>\r\n      <ul>\r\n        <li>Ideally, provide no direct table access and limit access to selected stored procedures only. </li>\r\n        <li>If you must grant table access, grant the minimum access that the application requires. For example, do not grant update access if read access is sufficient. </li>\r\n        <li>Use a database role, to avoid granting permissions directly to the database user. This isolates you from potential changes to the database user name. For example, if you change the database user name, you can simply add the new user to the database role and remove the existing one. </li>\r\n        <li>If an application needs to affect many databases, or if an application is complicated, consider using separation of privilege by partitioning the database access into different accounts. For example, create a database user that only has permissions necessary to setup new application users, and then create a separate database user to carry out operations permitted by legitimate application users.</li>\r\n      </ul>\r\n    </li>\r\n  </ol>\r\n  <h1>Problem Example</h1>\r\n  <p>The following snippet shows a list of database accounts and some of their permissions. Unfortunately, the application's account (myapp) is given more privileges than necessary. If an attacker compromises the application's database account, she can drop tables from the database server.</p>\r\n  <h1>Solution Example</h1>\r\n  <p>The following snippet shows a list of database accounts and some of their permissions. Because the application's account is given appropriate permissions, an attacker cannot drop tables by compromising the application's database account.</p>\r\n  <hr />\r\n  <p>Adapted from Microsoft patterns & practices guidance.</p>"
        ]
      }
    ]
  }
}