{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "609054510",
      "Content_Hash": "-474866422"
    },
    "Metadata": [
      {
        "Id": [
          "ffef7554-2a1d-487f-9b0a-8b1c522bc51c"
        ],
        "Id_History": [
          "ffef7554-2a1d-487f-9b0a-8b1c522bc51c,fc529110-ddf0-430e-9e22-335277a0cc8d,"
        ],
        "Library_Id": [
          "be5273b1-d682-4361-99d9-6234f2d47eb7"
        ],
        "Title": [
          ".NET Throttle Logs"
        ],
        "Category": [
          "Auditing and Logging"
        ],
        "Phase": [
          "Design"
        ],
        "Technology": [
          ".NET"
        ],
        "Type": [
          "Code Example"
        ],
        "DirectLink": [
          "Throttle Logs"
        ],
        "Tag": [
          "ASP.NET,ASP.NET 4.0,ASP"
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ],
        "Source": [
          "SI"
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "## Applies To ##\r\n\r\n* ASP.NET\r\n\r\n\r\n## Summary ##\r\n\r\nThrottle logging of events and activity that might degrade your application's performance. Logging too quickly or logging large amounts of data are the ideal conditions for a denial of service attack and loss of logged entries. Poisoning the logs by repeatedly executing an operation allows an attacker to overwhelm the logging mechanism and cover up intrusions.\r\n\r\n\r\n## Problem Example ##\r\n\r\nAn ASP.NET application does not use health monitoring, but logs many events via a standard SQL server database. Several of the operations that the application user performs is capable of generating quantities of log volume. An attacker begins to perform the operation many times. The logs will fill up quickly, and dramatically affect the server's ability to handle incoming requests, this results in a denial of service condition for application users. Furthermore, logs start to get dropped which allows the hacker to cover up evidence of a previous attack by flooding the logs until so that the events that indicate hacking attempts are flushed from the system.\r\n\r\n\r\n## Solution Example ##\r\n\r\nAn ASP.NET application logs many events via a standard SQL server database. The developer realizes that the application might be subjected to denial of service attempts, and configures health monitoring throttle logging by setting the BufferModes element in the Web.config file:\r\n\r\n~~~~\r\n<healthMonitoring>\r\n  <bufferModes>\r\n    <add name=\"Extra Critical Notification\"\r\n      maxBufferSize=\"10\"\r\n      maxFlushSize=\"5\"\r\n      urgentFlushThreshold=\"3\"\r\n      regularFlushInterval=\"00:03:00\"\r\n      urgentFlushInterval=\"00:01:00\"\r\n      maxBufferThreads=\"1\"/>\r\n  </bufferModes>\r\n</healthMonitoring>\r\n~~~~\r\n\r\n* name attribute is a name for the buffer mode used to reference it from other elements. For example, the <provider> element references the specific buffer mode configuration by referencing the name in its bufferMode attribute.\r\n\r\n* maxBufferSize is the maximum number of events that can be buffered by a provider before flushing them out and writing them to a store.\r\n\r\n* maxFlushSize is the maximum number of events per flush. Its value should be between 1 and maxBufferSize.\r\n\r\n* urgentFlushThreshold is the minimum number of events after which the events should be flushed. Its value should be less than or equal to maxBufferSize.\r\n\r\n* regularFlushInterval is the time interval per flush. Its value cannot be zero.\r\n\r\n* urgentFlushInterval is the minimum time between flushes. Its value must be between 0 and regularFlushInterval.\r\n\r\n* maxBufferThreads is the maximum number of threads used for flushing.\r\n\r\nIt is determined that the logging facilities for the application enables an attacker to generate 6 log entries per minute, regardless of the number of connections to the application that she or he is able to achieve. The goal is to ensure that the attacker can never exceed the maxBufferSize, since logs will start getting dropped.\r\n\r\n\r\n----\r\nAdapted from Microsoft patterns & practices guidance."
        ]
      }
    ]
  }
}