{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "4b8acf69-b890-44d9-831e-5e454c270db2"
        ],
        "Id_History": [
          "4b8acf69-b890-44d9-831e-5e454c270db2,8ab9e63f-8ee4-4647-ba0a-d2ace10605c7,"
        ],
        "Library_Id": [
          "c4b9cb6a-4561-4451-9b6c-4e59d73584f6"
        ],
        "Title": [
          "Sensitive Cookies Are Not Made Persistent"
        ],
        "Category": [
          "Session Management"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Java"
        ],
        "Type": [
          "Checklist Item"
        ],
        "DirectLink": [
          "Sensitive Cookies Are Not Made Persistent"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Java\r\n\r\n==What to Check For==\r\n\r\nVerify that sensitive cookies are not made persistent.\r\n\r\n==Why==\r\n\r\nAllow sensitive cookies to expire when the user closes the browser to prevent attackers from stealing these cookies from the user's system. An attacker would have to gain unauthorized access to the user's system to be able to recover persistent cookies, but this does happen in practice, for example as a result of malware infection. Botnet operators often steal cookies stored on users' computers to hijack those users' accounts on sites that store session information in persistent cookies. If sensitive cookies are not persistent, then they will not be stored on the system and it will be more difficult for an attacker to recover them.\r\n\r\n==How to Check==\r\n\r\nTo verify that sensitive cookies are not made persistent:\r\n\r\n# **Identify sensitive cookies.** Cookies are represented by objects of Cookie class in Java, so you can search for the keyword \"Cookie\" to help identify all cookies used by the application. Once all the cookies have been identified, it should be simple to determine which ones contain sensitive data and which ones do not. Pay particular attention to cookies that contain session identifiers. Create a spreadsheet to list all the cookies that contain sensitive data in your application. \r\n# **Verify that sensitive cookies are not made persistent.** Examine each piece of code that handles each sensitive cookie. Make sure that the expiration time for sensitive cookies is never set.\r\n\r\n\r\n==How to Fix==\r\n\r\nTo let sensitive cookies expire when the browser exits:\r\n\r\n# **Identify sensitive cookies.** Cookies are represented by objects of Cookie class in Java, so you can search for the keyword \"Cookie\" to help identify all cookies used by the application. Once all the cookies have been identified, it should be simple to determine which ones contain sensitive data and which ones do not. Pay particular attention to cookies that contain session identifiers. Create a spreadsheet to list all the cookies that contain sensitive data in your application. \r\n# **Remove or modify code that sets expiration time for sensitive cookies.** In all the code that handles sensitive cookies, remove code that sets the cookies’ expiration time. By default, expiration time is not set for cookies, and they will expire when the user closes the browser. Therefore, to make sensitive cookies expire, it is sufficient to never assign an expiration time to them. \r\n"
        ]
      }
    ]
  }
}