{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "99435f29-517e-48ea-a531-448bad4ecd92"
        ],
        "Id_History": [
          "99435f29-517e-48ea-a531-448bad4ecd92,fd2dfd83-15f5-469c-85d2-4c359ffb1972,"
        ],
        "Library_Id": [
          "f215ceee-9a08-41d9-b2c1-bbcc058a8f32"
        ],
        "Title": [
          "Use Secure Intents When Performing IPC"
        ],
        "Category": [
          "Inter-Process Communication"
        ],
        "Phase": [
          "Implementation"
        ],
        "Technology": [
          "Android"
        ],
        "Type": [
          "Guideline"
        ],
        "DirectLink": [
          "Use Secure Intents When Performing IPC"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "==Applies To==\r\n\r\n* Android\r\n\r\n==What to Do==\r\n\r\nIntents are used to send broadcasts, start and stop services, and start activities and subactivities. Implement proper security mechanisms for intents to ensure that sensitive information is not inadvertently disclosed to other application processes.\r\n\r\n==Why==\r\n\r\nIntents are used as a method of inter-process communication (IPC) on Android devices. When incorrectly configured, they can leak information to other applications or processes. Some of this occurs by design with Android, so it is imperative to learn proper coding techniques.\r\n\r\n==When==\r\n\r\nUse secure intents when sending broadcasts, starting and stopping services, and starting activities or subactivities.\r\n\r\n==How==\r\n\r\nTo use secure intents:\r\n\r\n# **Determine what you require for your intent.** If it is specific to your activities or services within your package, use an explicit intent. The component named in the intent constructor will be the only class to receive the intent message. You can further secure components that receive intents through custom permissions in the Android manifest file. Doing so requires that any intent calling your component have the same permission specified in its manifest.\r\n# **If you are not sure which receivers can consume your intent, use an implicit intent.** Android makes a determination about which receivers can view an implicit intent based on which actions and intent filters they have, so it is not in your control who will receive them. As a result, it is critical that you do not rely on implicit intents for secure communications.\r\n# **Be careful about sending extra information.** It is possible to put additional information in an intent by using the //putExtra()// method, but exercise caution about what type of information you send. According to testing through CommonsWare, it is possible to view this data for certain tasks by using the //ActivityManager//. Also, a malicious application could use the same package name as the intended recipient, provided, of course, that the recipient’s application is not already installed. Therefore, even with explicit intents, avoid communicating sensitive data such as user accounts and passwords.\r\n\r\n==Problem Example==\r\n\r\nAs the MyApp developer, you need a service that will continually run in the background, waiting for a value to insert into the database. You design the service so that whenever an activity has an error or warning, the service logs it to the database. You believe that the intent filter will provide enough security and set the service entry in the manifest as:\r\n\r\n{{{\r\n<service android:name=\".ErrorUploadService\"  >\r\n  <intent-filter>\r\n    <action android:name=\"com.sample.coding.security.ERROR\" />\r\n  </intent-filter>\r\n</service> \r\n}}}\r\n\r\nThe service’s //onStartCommand()// method calls //intent.getStringExtra(\"CODE\")// to retrieve the value to upload. Another package in Android—one that does not belong to the MyApp team—has discovered this service and the intent filter. You add the following to an intent:\r\n\r\n{{{\r\nIntent intent = new Intent(\"com.sample.coding.security.ERROR\");\r\nintent.putExtra(\"CODE\", false);\r\nstartService(intent);\r\n}}}\r\n\r\nWith these three lines, the external, unauthorized package is able to start the MyApp service at will and insert anything it wants into the database. This obviously causes problems for MyApp’s data integrity.\r\n\r\n==Solution Example==\r\n\r\nTo avoid this problem, update the manifest with permissions for the service intent. Label the service as:\r\n\r\n{{{\r\n<service android:name=\".ErrorUploadService\"  >\r\n<android:permission=\"com.sample.CODE\" >\r\n  <intent-filter>\r\n    <action android:name=\"com.sample.ERROR\" />\r\n  </intent-filter>\r\n</service> \r\n}}}\r\n\r\nIf an external service wants to access MyApp through the //.ErrorUpLoadService//, it will have to add a permission similar to the one below to its Android manifest:\r\n\r\n{{{\r\n<uses-permission android:name=\"com.rps.bwahaha.CODE\" />\r\n<permission android:name=\"com.sample.CODE\"\r\n  android:label=\"@string/permission_label\"\r\n  android:description=\"@string/permission_desc\"\r\n  android:permissionGroup=\"android.permission-group.HARDWARE_CONTROLS\"\r\n  android:protectionLevel=\"dangerous\" />\r\n}}}\r\n\r\nBecause the service is not intended for use outside the MyApp application, you may also want to add the //android:exported=\"false\"// tag to avoid any external interprocess communication with the service. If you do this, there will be no way for an external application to access the service.\r\n\r\n"
        ]
      }
    ]
  }
}